{"references": [{" publication_date": "2020", "fullname_first_author": "Tom B Brown", "paper_title": "Language models are few-shot learners", "reason": "This paper is foundational to the field of large language models (LLMs), introducing the concept of few-shot learning, which is directly relevant to the advancements in LLM alignment discussed in the report.  The paper's influence on the development and understanding of LLMs makes it a crucial reference in the introduction section, establishing the context and highlighting the significance of alignment methodologies within the broader LLM landscape.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Josh Achiam", "paper_title": "GPT-4 technical report", "reason": "This paper is a comprehensive technical report on GPT-4, a leading large language model.  As a leading model, its architecture, training methodology, and capabilities are relevant benchmarks for evaluating the performance of the Baichuan models. It's mentioned in the introduction to provide context for the capabilities of leading LLMs and in the evaluation section to offer a basis of comparison for experimental results.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Rohan Anil", "paper_title": "Palm 2 technical report", "reason": "Similar to the GPT-4 technical report, the Palm 2 technical report provides a benchmark for the evaluation of LLMs.  Its inclusion in the evaluation section allows for a direct comparison of Baichuan models against another state-of-the-art model, providing a broader perspective on the effectiveness of Baichuan Alignment.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Jinze Bai", "paper_title": "Qwen technical report", "reason": "The Qwen technical report details another significant LLM and its capabilities, making it an important comparative point in the report's introduction and evaluation sections. The comparison highlights the achievements and advancements made by Baichuan Alignment in relation to other major LLMs.", "section_number": 1}, {" publication_date": "2024", "fullname_first_author": "Xiao Bi", "paper_title": "Deepseek llm: Scaling open-source language models with longtermism", "reason": "This paper is another significant contribution to the LLM field, providing another benchmark in the evaluation section. The inclusion of this paper in the evaluation section allows for a comparison of different scaling and alignment strategies, highlighting the unique aspects of Baichuan Alignment.", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "Yuntao Bai", "paper_title": "Training a helpful and harmless assistant with reinforcement learning from human feedback", "reason": "This paper is directly relevant to the reinforcement learning aspects of Baichuan Alignment, discussed in Section 2. The techniques presented in this paper are important for understanding and improving the model's alignment with human values and preferences, a crucial component of the Baichuan Alignment methodology.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "John Schulman", "paper_title": "Proximal policy optimization algorithms", "reason": "This paper introduces Proximal Policy Optimization (PPO), a widely used reinforcement learning algorithm.  Its mention in Section 2 shows the basis of the reinforcement learning techniques used in Baichuan Alignment. Understanding PPO is crucial for grasping the technical details of the optimization process.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Zhihong Shao", "paper_title": "Deepseekmath: Pushing the limits of mathematical reasoning in open language models", "reason": "This paper directly relates to Section 4.2 on enhancing mathematical capabilities in LLMs. It’s cited to illustrate the state-of-the-art in this specific area and serves as a comparative point to showcase the advancement achieved through Baichuan Alignment.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Takeshi Kojima", "paper_title": "Large language models are zero-shot reasoners", "reason": "This paper is important for Section 4.3 on enhancing reasoning capabilities.  It introduces the concept of zero-shot reasoning, a key capability highlighted in the report.  The inclusion of this paper shows the background and the context of the advancements made in reasoning through Baichuan Alignment.", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Mark Chen", "paper_title": "Evaluating large language models trained on code", "reason": "This paper is crucial for Section 4.4, which discusses code-related capabilities. As a benchmark for evaluating code-related capabilities of LLMs, it sets the context for the work done in Baichuan Alignment and allows for a comparison of the Baichuan models’ performance with other state-of-the-art LLMs.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Ziyang Luo", "paper_title": "Wizardcoder: Empowering code large language models with evol-instruct", "reason": "This paper is cited in Section 4.4, focusing on code capabilities.  It offers a direct comparative point, showcasing another approach to enhancing code generation capabilities in LLMs.  The comparison highlights the unique aspects of the Baichuan Alignment methodology for code improvement.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Long Ouyang", "paper_title": "Training language models to follow instructions with human feedback", "reason": "This paper significantly influences the SFT methodology within Baichuan Alignment.  The techniques described are highly relevant to the SFT phase and are mentioned frequently throughout the report, especially in the optimization and evaluation sections. It's a cornerstone paper in the field of LLM alignment.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Karl Cobbe", "paper_title": "Training verifiers to solve math word problems", "reason": "This paper is highly relevant to Section 4.2, focusing on enhancing mathematical problem-solving abilities.  The work on training verifiers to solve math problems provides a key context for understanding the challenges and the methods used to improve this specific capability in the Baichuan models.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Tianle Li", "paper_title": "From crowdsourced data to high-quality benchmarks: Arena-hard and benchbuilder pipeline", "reason": "This paper is critical for understanding the methodology used in Section 5.2, which focuses on the use of open-source benchmarks for evaluating the performance of the Baichuan models. The ArenaHard benchmark, mentioned in this paper, is a key benchmark used in the evaluation and provides a strong comparative basis.", "section_number": 5}, {" publication_date": "2023", "fullname_first_author": "Xuechen Li", "paper_title": "Alpacaeval: An automatic evaluator of instruction-following models", "reason": "This paper introduces AlpacaEval, a benchmark for evaluating instruction-following capabilities, directly relevant to Section 5.2. It's referenced for a comparative analysis of Baichuan Alignment's effectiveness in enhancing instruction-following performance against a well-established benchmark.", "section_number": 5}, {" publication_date": "2024", "fullname_first_author": "Tao Zhang", "paper_title": "CFBench: A comprehensive constraints-following benchmark for LLMs", "reason": "This paper introduces CFBench, a benchmark specifically designed to evaluate constraint-following capabilities, which is directly relevant to the key ability evaluation in Section 5.3.1. CFBench provides a granular and comprehensive assessment of the model's ability to follow various types of constraints.", "section_number": 5}, {" publication_date": "2024", "fullname_first_author": "Yanzhao Qin", "paper_title": "SysBench: Can large language models follow system messages?", "reason": "This paper introduces SysBench, a benchmark designed to evaluate system message following capabilities, highly relevant to Section 5.3.2.  SysBench provides a unique way of evaluating how well a model adheres to system instructions, offering a different perspective than traditional benchmarks.", "section_number": 5}, {" publication_date": "2024", "fullname_first_author": "Youquan Li", "paper_title": "FB-Bench: A fine-grained multi-task benchmark for evaluating LLMs' responsiveness to human feedback", "reason": "This paper introduces FB-Bench, a benchmark specifically designed to evaluate a model's ability to respond to human feedback, directly relevant to Section 5.3.3.  It offers a unique perspective on evaluating the collaborative aspects of human-AI interaction, going beyond simple accuracy metrics.", "section_number": 5}, {" publication_date": "2023", "fullname_first_author": "Hugo Touvron", "paper_title": "Llama: Open and efficient foundation language models", "reason": "This paper is referenced in the introduction to describe one of the open-source models that has been improved by using Baichuan Alignment.  It also appears in the evaluation section as a baseline for comparing the performance of the enhanced model.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Aiyuan Yang", "paper_title": "Baichuan 2: Open large-scale language models", "reason": "This paper describes Baichuan-2, a large language model, which serves as a foundation for the Baichuan Alignment. Understanding the base model is crucial for evaluating the improvements achieved through alignment techniques and is repeatedly mentioned throughout the report.", "section_number": 3}]}