{"references": [{" publication_date": "2012", "fullname_first_author": "Browne, C.B.", "paper_title": "A survey of monte carlo tree search methods", "reason": "This paper provides a comprehensive overview of Monte Carlo Tree Search (MCTS), a crucial algorithm used in various fields, including game playing and automated theorem proving.  Its importance in the context of this paper stems from MCTS's application as a method for efficiently searching the space of possible proofs, which is fundamental to the Pantograph tool's functionality. The survey's detailed explanation and analysis of various MCTS techniques provide a solid foundation for understanding its application in the specific domain of automated theorem proving, as detailed in section 2.2.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Hales, T.", "paper_title": "A formal proof of the Kepler conjecture", "reason": "This paper showcases a high-profile application of proof assistants, demonstrating their capability in verifying complex mathematical conjectures. The success of this formal verification effort highlights the importance and potential impact of proof assistants in mathematical research.  The paper is referenced in the introduction (section 1) to emphasize the significance of proof assistants in addressing important mathematical problems.", "section_number": 1}, {" publication_date": "2009", "fullname_first_author": "Klein, G.", "paper_title": "sel4: Formal verification of an os kernel", "reason": "This paper presents the formal verification of the seL4 microkernel, a significant achievement demonstrating the practical use of proof assistants in ensuring the correctness and security of computer systems. The paper, cited in the introduction (section 1), underscores the importance and real-world applications of proof assistants in formal verification, motivating further research into improving their efficiency and capabilities.", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "Jiang, A.", "paper_title": "Draft, sketch, and prove: Guiding formal theorem provers with informal proofs", "reason": "This paper introduces the Draft-Sketch-Prove (DSP) approach to theorem proving, which is an innovative technique that leverages large language models to generate high-level proof outlines, which are then refined into formal proofs.  Its importance in this paper is because Pantograph provides features that directly support this methodology (section 4.6, section 5). The methodology's significance lies in its attempt to combine the strengths of human-style reasoning with the rigor of formal verification.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Lample, G.", "paper_title": "Hypertree proof search for neural theorem proving", "reason": "This paper presents HyperTree, a novel approach for proof search using large language models. The relevance to this paper is that Pantograph's approach shares similarities to HyperTree, particularly in utilizing tree search for automated theorem proving, and this is discussed in the related work section (section 3).  HyperTree's efficient proof search method through the use of and-or trees demonstrates the effectiveness of integrating machine learning with proof assistants for more sophisticated proof searches.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Limperg, J.", "paper_title": "Aesop: White-box best-first proof search for lean", "reason": "This paper introduces Aesop, a white-box best-first proof search algorithm for Lean.  Its importance for this paper is threefold. Firstly, it demonstrates advanced techniques in tree search which are relevant to the functionalities of Pantograph. Secondly, Aesop directly inspires Pantograph's approach to handling metavariable coupling.  Thirdly, Aesop is used as one of the tactic hammers in the evaluation of Pantograph, showcasing its practical application in the context of the DSP experiment. (sections 3, 4, 5)", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Yang, K.", "paper_title": "LeanDojo: Theorem proving with retrieval-augmented language models", "reason": "This paper introduces LeanDojo, a Python interface for machine interaction with Lean 4. This paper is important to this paper because LeanDojo serves as a crucial point of comparison for Pantograph.  The related work section (section 3) analyzes LeanDojo's strengths and weaknesses, highlighting Pantograph's improvements in efficiency, functionality, and metavariable coupling handling.  The comparison of LeanDojo and Pantograph helps to contextualize the contributions and novel features of Pantograph.", "section_number": 3}, {" publication_date": "2018", "fullname_first_author": "Silver, D.", "paper_title": "A general reinforcement learning algorithm that masters chess, shogi, and go through self-play", "reason": "This paper demonstrates the power of Monte Carlo Tree Search (MCTS) in achieving superhuman performance in complex games like Go, Chess, and Shogi.  The success of AlphaZero, described in this paper, directly supports the claim of using MCTS for complex theorem proving tasks in proof assistants. AlphaZero is explicitly mentioned in section 2.2 to highlight the power of MCTS and its potential for achieving comparable performance in the automated proof search domain.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Wang, H.", "paper_title": "Dt-solver: Automated theorem proving with dynamic-tree sampling guided by proof-level value function", "reason": "This work explores using dynamic-tree sampling guided by proof-level value functions for automated theorem proving. This paper's relevance to this paper stems from its use of tree-based search for efficient proof discovery. While differing in specific techniques, this work helps to establish the context and broader trend in the use of tree-based methods for theorem proving, adding to the justification for Pantograph's approach.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "Yang, K.", "paper_title": "Learning to Prove Theorems via Interacting with Proof Assistants", "reason": "This paper explores using machine learning to improve automated theorem proving by interacting with proof assistants.  Its relevance is significant because this paper focuses on building an effective interface for machine learning to interact with a proof assistant, a key challenge addressed by the work presented in this paper.  The challenges addressed by the methods in this paper are directly relevant to the motivation and design of the Pantograph tool, making it a highly relevant reference.", "section_number": 3}, {" publication_date": "2021", "fullname_first_author": "Zheng, K.", "paper_title": "Minif2f: a cross-system benchmark for formal olympiad-level mathematics", "reason": "This paper introduces the MiniF2F benchmark dataset, a collection of formal mathematical problems commonly used in Olympiads. This dataset is crucial for the evaluation performed in section 5 of this paper.  The MiniF2F benchmark provides a standardized and widely recognized evaluation setting, ensuring the credibility and comparability of the results obtained using Pantograph, and providing a well-established basis for evaluating the effectiveness of the system in a real-world scenario.", "section_number": 5}, {" publication_date": "2021", "fullname_first_author": "de Moura, L.", "paper_title": "The lean 4 theorem prover and programming language", "reason": "This paper provides foundational information about Lean 4, a key component of this paper's work.  It provides a comprehensive overview of Lean 4, its features, and its capabilities, which serves as background information in section 2.  The paper's detailed description of the Lean 4 system and its functionalities is crucial for understanding the technical details of Pantograph, making it a fundamental reference for the entire paper.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Crouse, M.", "paper_title": "A deep reinforcement learning approach to first-order logic theorem proving", "reason": "This paper explores the use of deep reinforcement learning for automated first-order logic theorem proving.  The methods described in this paper fall under the broader category of machine learning applications to automated theorem proving, which forms the context for the work presented in this paper.  It is referred to in section 1 to establish the context of existing work in this area.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Gauthier, T.", "paper_title": "Tactictoe: Learning to prove with tactics", "reason": "This paper explores a deep reinforcement learning approach to theorem proving using tactics, which provides a relevant context for the development of Pantograph.  The approach discussed in this paper addresses challenges similar to those being solved by Pantograph, focusing on learning effective tactic strategies, the importance of effective interfaces between machine learning models and proof assistants, and how effective the interaction between ML models and proof assistants can be. (section 1)", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "Jiang, A.Q.", "paper_title": "Thor: Wielding hammers to integrate language models and automated theorem provers", "reason": "This paper explores the integration of language models and automated theorem provers, which provides a broader context for the work presented in this paper.  The paper, referenced in section 3, highlights the increasing trend of leveraging large language models to enhance theorem proving, showing how large language models can work alongside proof assistants to achieve better automation in the proof process.", "section_number": 3}, {" publication_date": "2002", "fullname_first_author": "Nipkow, T.", "paper_title": "Isabelle/HOL: a proof assistant for higher-order logic", "reason": "This book introduces Isabelle/HOL, a prominent proof assistant.  The reference to Isabelle/HOL in section 2 serves to establish the broader context of proof assistants and their functionalities. The paper's mention provides a valuable comparison point for understanding the characteristics and design choices in other proof assistant systems, including Lean 4, which is the primary focus of this paper.", "section_number": 2}, {" publication_date": "2018", "fullname_first_author": "Silver, D.", "paper_title": "Mastering the game of go without human knowledge", "reason": "This paper describes AlphaGo Zero, which demonstrates the power of reinforcement learning coupled with Monte Carlo Tree Search (MCTS). It is relevant because the success of AlphaGo Zero showcases the effectiveness of using AI techniques to solve complex problems with vast search spaces. This relevance is noted in section 2.2 when describing the effectiveness and capabilities of MCTS.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "The Coq Development Team", "paper_title": "The Coq reference manual - release 8.19.0", "reason": "This manual provides a comprehensive reference for Coq, a well-known proof assistant. The mention of Coq in section 2 is important for establishing a broader context for the discussion of proof assistants.  Comparing Coq with other systems like Lean 4, highlights the similarities and differences in approaches and design choices, providing a richer understanding of the overall landscape of proof assistants.", "section_number": 2}]}