{"references": [{" publication_date": "2016", "fullname_first_author": "Alexandre Alahi", "paper_title": "Social LSTM: Human Trajectory Prediction in Crowded Spaces", "reason": "This paper is foundational in trajectory prediction, a key component of behavior modeling.  Its use of recurrent neural networks to model social interactions between agents is highly relevant to the context of ATS which also models agent-observer and agent-environment interactions.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "Eric Brachmann", "paper_title": "Neural-Guided RANSAC: Learning Where to Sample Model Hypotheses", "reason": "This paper proposes a method for robust model fitting that learns to strategically sample hypotheses, improving efficiency and accuracy. This approach is important for the coarse-to-fine registration method in ATS, addressing the challenges of aligning multiple videos with varying viewpoints and scene changes.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Zhe Cao", "paper_title": "Long-term Human Motion Prediction with Scene Context", "reason": "This paper addresses long-term motion prediction, a key aspect of learning interactive behaviors. Its incorporation of scene context is relevant to ATS's focus on modeling agent-environment interactions, improving the prediction of agent trajectories and actions.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Chiho Choi", "paper_title": "Drogon: A Trajectory Prediction Model Based on Intention-Conditioned Behavior Reasoning", "reason": "This paper emphasizes intention-based trajectory prediction which is crucial to understanding interactive behaviors. The concept of reasoning about agent intentions is central to ATS's goal of learning realistic interactive behavior models that accurately reflect the motivations and decisions of an agent in complex environments.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Scott Ettinger", "paper_title": "Large Scale Interactive Motion Forecasting for Autonomous Driving: The Waymo Open Motion Dataset", "reason": "This paper provides a large-scale dataset for motion forecasting, a crucial aspect of learning agent behavior.  Its focus on autonomous driving is relevant to ATS, as understanding and predicting interactive behaviors is essential for safe navigation and interaction in various environments.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Hang Gao", "paper_title": "Monocular Dynamic View Synthesis: A Reality Check", "reason": "This paper directly addresses the challenge of reconstructing time-varying 3D structures from monocular video, a key problem that ATS also addresses. Its focus on dynamic view synthesis, allowing for novel views of the scene, is relevant to the simulation aspect of ATS, enabling the generation of synthetic views for training and evaluation.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Shubham Goel", "paper_title": "Humans in 4D: Reconstructing and Tracking Humans with Transformers", "reason": "This paper showcases recent advances in 4D human reconstruction, offering a comparison point for ATS's work.  Its use of transformers for reconstruction is relevant to ATS's coarse-to-fine registration strategy, leveraging the power of deep learning for robust and efficient 3D alignment across time and multiple video views.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Mohamed Hassan", "paper_title": "Stochastic Scene-Aware Motion Prediction", "reason": "This paper introduces stochastic scene-aware motion prediction, capturing the variability and uncertainty in motion predictions. This approach is important in the context of ATS, as it aims to learn a probabilistic behavior model of the agents capable of handling uncertainty and multi-modality.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Karttikeya Mangalam", "paper_title": "From Goals, Waypoints & Paths to Long Term Human Trajectory Forecasting", "reason": "This paper tackles long-term human trajectory forecasting, a challenging problem related to the goal of ATS.  The focus on using goals, waypoints, and paths aligns with ATS's hierarchical behavior generation model, making it relevant to the design and evaluation of the behavior generation module in ATS.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Ben Mildenhall", "paper_title": "NeRF: Representing Scenes as Neural Radiance Fields for View Synthesis", "reason": "This paper is a seminal work in neural radiance fields (NeRFs), providing the foundational representation for the 3D scene reconstruction in ATS. NeRF's ability to represent complex 3D scenes from multiple viewpoints is critical to the 4D reconstruction method in ATS.", "section_number": 3}, {" publication_date": "2021", "fullname_first_author": "Michael Niemeyer", "paper_title": "Giraffe: Representing Scenes as Compositional Generative Neural Feature Fields", "reason": "This paper introduces a compositional generative neural feature field, a more advanced representation that is relevant to the canonical scene representation in ATS.  Giraffe's ability to handle complex scenes and variations across videos is important for the robustness and generalizability of the proposed ATS framework.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Maxime Oquab", "paper_title": "DINOv2: Learning Robust Visual Features Without Supervision", "reason": "This paper provides a powerful, self-supervised approach for learning visual features, which is directly used in ATS for neural localization and featuremetric losses. The robustness and generalizability of DINOv2 features are key to the success of ATS's registration method.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Joon Sung Park", "paper_title": "Generative Agents: Interactive Simulacra of Human Behavior", "reason": "This paper focuses on generative agents, which directly relates to the goal of ATS. The approach of creating interactive simulations of human behavior provides insights into the design and evaluation of interactive agent behavior models, crucial for determining the success of ATS's simulator.", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "Georgios Pavlakos", "paper_title": "Sitcoms3D: Reconstructing Both the Scene and Human Parameters", "reason": "This paper presents a method for reconstructing both the scene and human parameters from video, which is relevant to ATS's goal of building a 4D representation.  The methods used for scene and parameter reconstruction are valuable references for ATS's approach to aligning videos and capturing the motion of both the agent and the observer.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "Naureen Mahmood", "paper_title": "AMASS: Archive of Motion Capture as Surface Shapes", "reason": "This paper provides a large-scale motion capture dataset that serves as a benchmark for evaluating motion generation models, offering a direct comparison point for ATS.  The quality and diversity of the dataset are crucial for measuring the effectiveness of ATS's behavior generation module in capturing realistic agent motion.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Shunsuke Saito", "paper_title": "Scanimate: Weakly Supervised Learning of Skinned Clothed Avatar Networks", "reason": "This paper introduces a method for learning skinned clothed avatar networks, a key component of 3D agent modeling in ATS.  The approach to weakly supervised learning is highly relevant to the design of ATS, as it tackles the challenges of learning from limited and noisy data obtained from casual video recordings.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Yang Song", "paper_title": "Score-Based Generative Modeling Through Stochastic Differential Equations", "reason": "This paper introduces score-based generative modeling, a powerful technique used in ATS for behavior generation. The use of score functions for generating diverse and realistic behavior models is highly relevant to ATS's approach to learning interactive behavior and simulating agent actions in various scenarios.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Chonghyuk Song", "paper_title": "Total-Recon: Deformable Scene Reconstruction for Embodied View Synthesis", "reason": "This paper directly addresses the problem of reconstructing 3D scenes from video data, a significant challenge that ATS also tackles.  TotalRecon's methods for deformable scene reconstruction are valuable for comparison and offer insights into potential improvements for ATS's 4D reconstruction method.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Sanjana Srivastava", "paper_title": "Behavior: Benchmark for Everyday Household Activities in Virtual, Interactive, and Ecological Environments", "reason": "This paper introduces the Behavior benchmark dataset which is highly relevant to the experimental evaluation of ATS.  This benchmark provides a standard evaluation framework for interactive agent behavior models, crucial for assessing the performance and generalizability of the ATS model across various scenarios and environments.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Guy Tevet", "paper_title": "Human Motion Diffusion as a Generative Prior", "reason": "This paper utilizes diffusion models for human motion generation, offering valuable insights into the design of ATS's behavior generation model. The use of diffusion models for generating diverse and realistic motions aligns with ATS's approach to learning interactive behaviors and simulating agent actions.", "section_number": 4}]}