[{"figure_path": "2410.16259/tables/table_7_0.html", "caption": "Table 1: Evaluation of Camera Registration.", "description": "The table evaluates the performance of camera registration using different methods by comparing the rotation and translation errors.", "section": "4.1 4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/tables/table_8_0.html", "caption": "Table 3: Evaluation of 4D Reconstruction. SV: Single-video. MV: Multi-video.", "description": "This table shows the quantitative results of 4D reconstruction comparing the proposed method to TotalRecon on several metrics, including depth accuracy and LPIPS.", "section": "4.1 4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/tables/table_8_1.html", "caption": "Table 4: End-to-end Evaluation of Interactive Behavior Prediction. We report results of predicting goal, path, orientation, and joint angles, using K = 16 samples across L = 12 trials. The metrics are minimum average displacement error (minADE) with standard deviations (±σ). The lower the better and the best results are in bold.", "description": "Table 4 presents a quantitative evaluation of the interactive behavior prediction model, showing the minimum average displacement error for goal, path, orientation, and joint angle prediction.", "section": "4.2 INTERACTIVE AGENT BEHAVIOR PREDICTION"}, {"figure_path": "2410.16259/tables/table_8_2.html", "caption": "Table 5: Evaluation of Spatial Control. We evaluate goal-conditioned path generation and path-conditoned full body motion generation respectively.", "description": "Table 5 presents a quantitative evaluation of the model's ability to generate paths and full body motions conditioned on either goals or paths, comparing its performance to existing methods.", "section": "4.2 INTERACTIVE AGENT BEHAVIOR PREDICTION"}, {"figure_path": "2410.16259/tables/table_17_0.html", "caption": "Table 6: Table of Notation.", "description": "This table lists the notations and descriptions of symbols used throughout the paper.", "section": "3.1 4D REPRESENTATION: AGENT, SCENE, AND OBSERVER"}, {"figure_path": "2410.16259/tables/table_17_1.html", "caption": "Table 7: Summary of inputs and outputs at different stages of the method.", "description": "This table summarizes the inputs and outputs at each stage of the proposed method for learning interactive behavior models from casual longitudinal videos.", "section": "4.1 4D RECONSTRUCTION OF AGENT & ENVIRONMENT"}]