[{"figure_path": "2410.13674/charts/charts_10_0.png", "caption": "Figure 3: Ablation study of CLIPScore Thresholds (a,c) & Curriculum Strategies (b,d) on ImageNet-LT and iWildCam. The error bar reports the standard deviation of each experiment.", "description": "The ablation study results on two classification tasks demonstrate that the selection of the CLIPScore threshold should be carefully aligned with the generation quality inherent to the task-at-hand.", "section": "6 Ablation Study and Analysis"}, {"figure_path": "2410.13674/charts/charts_13_0.png", "caption": "Figure 4: CLIP Cosine similarity score on ImageNet-LT computed between: (a) Synthetic image - original real images. (b) Synthetic image - defined text prompt.", "description": "The chart displays the cosine similarity scores between synthetic images and real images, as well as between synthetic images and their corresponding text prompts, across different image guidance levels.", "section": "A.1.2 ImageNet-LT Synthetic Generation"}, {"figure_path": "2410.13674/charts/charts_13_1.png", "caption": "Figure 4: CLIP Cosine similarity score on ImageNet-LT computed between: (a) Synthetic image - original real images. (b) Synthetic image - defined text prompt.", "description": "The violin plot shows the cosine similarity scores between synthetic images and their corresponding real images or text prompts, varying across different image guidance levels.", "section": "A.1.2 ImageNet-LT Synthetic Generation"}, {"figure_path": "2410.13674/charts/charts_15_0.png", "caption": "Figure 4: CLIP Cosine similarity score on ImageNet-LT computed between: (a) Synthetic image - original real images. (b) Synthetic image - defined text prompt.", "description": "The chart visualizes the cosine similarity scores computed using CLIP between synthetic images and both their corresponding real images and text prompts across various image guidance levels.", "section": "A.1.2 ImageNet-LT Synthetic Generation"}, {"figure_path": "2410.13674/charts/charts_15_1.png", "caption": "Figure 4: CLIP Cosine similarity score on ImageNet-LT computed between: (a) Synthetic image - original real images. (b) Synthetic image - defined text prompt.", "description": "The violin plot visualizes the cosine similarity scores between synthetic images and real images (a) and between synthetic images and text prompts (b) at different image guidance levels.", "section": "A.1.2 ImageNet-LT Synthetic Generation"}, {"figure_path": "2410.13674/charts/charts_23_0.png", "caption": "Figure 12: Effect of Image Guidance (mixing syn+real). All-level experiments use the synthesis samples from all guidance scales selected for each task. 0.5 refers to only using synthetic data with guidance level λ = 0.5 for fine-tuning. Left: results on iWildCam. Right: results on ImageNet-LT", "description": "The chart displays the effect of various image guidance levels on the performance of the model for both iWildCam and ImageNet-LT datasets, comparing the results of using only one guidance level versus all guidance levels.", "section": "5.2 Learning from Low-quality Data"}]