[{"figure_path": "2410.13458/tables/table_2_0.html", "caption": "Table 1: Comparison of MEDINST to several datasets in biomedical field.", "description": "Table 1 compares MEDINST with other biomedical datasets, highlighting key differences in features like the presence of task instructions, multi-task datasets, examples, and the number of tasks and samples.", "section": "1 Introduction"}, {"figure_path": "2410.13458/tables/table_4_1.html", "caption": "Table 2: Dataset statistics across various categories.", "description": "The table presents a summary of the MEDINST dataset, showing the number of datasets, instructions, and tasks within each of the 12 categories.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_8_1.html", "caption": "Table 4: Multiple-choice accuracy evaluation on MMLU-Medicine, a subset of MMLU benchmark. The subjects used are anatomy (An), clinical knowledge (CK), college biology (CB), college medicine (CM), medical genetics (MG) and professional medicine (PM).", "description": "Table 4 presents the multiple-choice accuracy of various models on six medical subtasks of the MMLU benchmark, comparing their performance across different medical subjects.", "section": "4.4 Evaluation on Public English Benchmarks"}, {"figure_path": "2410.13458/tables/table_13_0.html", "caption": "Table 1: Comparison of MEDINST to several datasets in biomedical field.", "description": "Table 1 compares MEDINST with other datasets in the biomedical field across several criteria, such as the presence of task instructions and multi-task datasets.", "section": "1 Introduction"}, {"figure_path": "2410.13458/tables/table_14_0.html", "caption": "Table 11: Dataset collection.", "description": "Table 11 lists all the datasets employed in MEDINST, categorized by task and showing the number of training, development, and test samples.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_15_0.html", "caption": "Table 11: Dataset collection.", "description": "Table 11 presents the dataset employed in MEDINST, showing the train, dev, and test set sizes for each task.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_16_0.html", "caption": "Table 3: Test results of various models on MEDINST32. † indicates that the training sets of LLaMA3-MI includes the corresponding training sets of the datasets used by MEDINST32, whereas other models have not seen the MEDINST32 dataset. ↓ represents that a lower score is better, while for other metrics, a higher score is better. The best and second-best results for each row are highlighted in bold and underlined, respectively. For the baselines, we use a few-shot prompt, providing two examples in the instruction. For the fine-tuned models, we use a zero-shot prompt.", "description": "Table 3 presents the evaluation results of various models on the MEDINST32 benchmark, highlighting the performance of different models across various difficulty levels of tasks.", "section": "4.2 Results"}, {"figure_path": "2410.13458/tables/table_16_1.html", "caption": "Table 1: Comparison of MEDINST to several datasets in biomedical field.", "description": "Table 1 compares MEDINST to other biomedical datasets based on the presence of task instructions, multi-task datasets, examples, public availability, number of tasks, number of instructions, number of annotated task types, and average task definition length.", "section": "1 Introduction"}, {"figure_path": "2410.13458/tables/table_17_0.html", "caption": "Table 11: Dataset collection.", "description": "Table 11 shows the dataset statistics, including the number of training, development, and test samples for each task in the MEDINST dataset.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_18_0.html", "caption": "Table 11: Dataset collection.", "description": "This table lists all the datasets employed in MEDINST, showing the task, train, dev, and test set sizes for each.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_19_0.html", "caption": "Table 11: Dataset collection.", "description": "This table presents the 133 biomedical NLP tasks included in the MEDINST dataset, categorized by task type, and shows the number of training, development, and test samples for each task.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}, {"figure_path": "2410.13458/tables/table_20_0.html", "caption": "Table 11: Dataset collection.", "description": "The table presents the dataset collection details of MEDINST, showing the task type, and the number of training, development, and test samples for each dataset.", "section": "3 MEDINST: Meta Dataset of Biomedical Instructions"}]