[{"figure_path": "2410.18978/charts/charts_15_0.png", "caption": "Figure S1: Ablations on diffusion feature for point tracking at test time, experiments conducted on DAVIS-7 (left) and UCF101-7 (right).", "description": "The chart displays the FID and FVD scores on DAVIS-7 dataset for different 3D-UNet decoder feature indices used for point tracking.", "section": "B MORE DETAILED ABLATION RESULTS"}, {"figure_path": "2410.18978/charts/charts_15_1.png", "caption": "Figure S1: Ablations on diffusion feature for point tracking at test time, experiments conducted on DAVIS-7 (left) and UCF101-7 (right).", "description": "The chart displays the FID and FVD scores on DAVIS-7 and UCF101-7 datasets for different feature indices used in point tracking within the 3D-UNet decoder.", "section": "B MORE DETAILED ABLATION RESULTS"}, {"figure_path": "2410.18978/charts/charts_15_2.png", "caption": "Figure S2: Ablations on the start and end diffusion steps for correspondence guidance, experiments conducted on DAVIS-7 (left) and UCF101-7 (right). We use a total sampling step of 30.", "description": "The chart shows the FID and FVD scores on DAVIS-7 dataset for different ranges of diffusion steps used for correspondence guidance during video frame interpolation.", "section": "B MORE DETAILED ABLATION RESULTS"}, {"figure_path": "2410.18978/charts/charts_15_3.png", "caption": "Figure S2: Ablations on the start and end diffusion steps for correspondence guidance, experiments conducted on DAVIS-7 (left) and UCF101-7 (right). We use a total sampling step of 30.", "description": "The chart displays the FID and FVD scores on DAVIS-7 and UCF101-7 datasets for different start and end diffusion steps used for correspondence guidance during video frame interpolation.", "section": "B MORE DETAILED ABLATION RESULTS"}, {"figure_path": "2410.18978/charts/charts_16_0.png", "caption": "Figure S3: Ablations on the number of trajectories for guidance during sampling, experiments conducted on DAVIS-7 (left) and UCF101-7 (right).", "description": "The chart displays the FID and FVD scores on DAVIS-7 dataset for different numbers of trajectories used for guidance during sampling.", "section": "B MORE DETAILED ABLATION RESULTS"}, {"figure_path": "2410.18978/charts/charts_16_1.png", "caption": "Figure S3: Ablations on the number of trajectories for guidance during sampling, experiments conducted on DAVIS-7 (left) and UCF101-7 (right).", "description": "The chart displays the impact of varying the number of trajectories used for guidance on FID and FVD scores for DAVIS-7 and UCF101-7 datasets.", "section": "B MORE DETAILED ABLATION RESULTS"}]