{"references": [{" publication_date": "2023", "fullname_first_author": "Shunyu Yao", "paper_title": "WebShop: Towards scalable real-world web interaction with grounded language agents", "reason": "This paper introduces WebShop, a benchmark specifically designed for evaluating e-commerce tasks.  This is highly relevant to the current study, which also focuses on the challenges of complex web navigation tasks. WebShop's focus on realistic e-commerce scenarios allows for a more accurate evaluation of the proposed WMA agents' performance in this domain, making it a highly relevant reference for comparison and benchmarking.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Xiang Deng", "paper_title": "Mind2Web: Towards a generalist agent for the web", "reason": "Mind2Web is a recently introduced benchmark that evaluates the capabilities of web agents on a wider variety of tasks than previous benchmarks.  Its emphasis on generalizability and diversity makes it a crucial benchmark to demonstrate the WMA approach's effectiveness in diverse web navigation tasks, therefore it is a highly relevant reference for evaluating and showcasing the capabilities of the proposed WMA agents.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Shuyan Zhou", "paper_title": "WebArena: A realistic web environment for building autonomous agents", "reason": "WebArena is a state-of-the-art benchmark for evaluating web agents' performance in realistic scenarios.  It offers a diverse set of challenges that test various aspects of web navigation. The study's use of WebArena as a primary benchmark makes it crucial to demonstrate the WMA agent's performance and compare it with other state-of-the-art approaches.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Tianlin Shi", "paper_title": "World of bits: An open-domain platform for web-based agents", "reason": "World of bits is one of the earliest benchmarks for evaluating web agents. While more limited in scope than newer benchmarks, it provides a historical perspective on the progress in the field and the challenges faced by early web agents.  Its inclusion helps contextualize the advancements made by the current state-of-the-art methods and highlights the significant improvement in benchmark complexity and realism.", "section_number": 2}, {" publication_date": "2018", "fullname_first_author": "Evan Zheran Liu", "paper_title": "Reinforcement learning on web interfaces using workflow-guided exploration", "reason": "This paper explores the use of reinforcement learning (RL) in web navigation, which is highly relevant to the context of this work. The approach of workflow-guided exploration is a useful comparison to the current proposed WMA method.  Its inclusion demonstrates the broader context of existing research and provides context for understanding the advantages of the WMA approach.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Hyungjoo Chae", "paper_title": "Coffee-gym: An environment for evaluating and improving natural language feedback on erroneous code", "reason": "While focused on code generation, this paper's emphasis on natural language feedback is valuable because the study evaluates the use of natural language for improved reasoning. This is relevant because it indicates how feedback, similar to the simulated feedback in the WMA approach, can improve the performance of LLMs. The inclusion of this paper adds more context regarding the use of natural language and feedback to improve LLM performance.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Tuomas Haarnoja", "paper_title": "Reinforcement learning with deep energy-based policies", "reason": "This paper explores the application of deep energy-based policies in reinforcement learning, which is relevant to the use of value functions in the proposed WMA web agents. This inclusion provides valuable context and demonstrates how similar techniques are used in the RL community for effective policy optimization and reinforcement learning.", "section_number": 4}, {" publication_date": "2018", "fullname_first_author": "Andreas Doerr", "paper_title": "Probabilistic recurrent state-space models", "reason": "This paper introduces probabilistic recurrent state-space models, a relevant technique for modeling environment dynamics in RL.  This is particularly relevant to the current work because it discusses modeling the evolution of the environment's state over time, similar to how the proposed WMA agent simulates the next state of the webpage.", "section_number": 4}, {" publication_date": "2019", "fullname_first_author": "Danijar Hafner", "paper_title": "Dream to control: Learning behaviors by latent imagination", "reason": "DreamerV2 is a particularly relevant example of a world model architecture, demonstrating how latent imagination can be used to learn behaviors in a more efficient manner. The use of latent representations in DreamerV2 provides valuable insights into methods for reducing computational costs and maintaining accuracy in simulating environmental dynamics, directly informing the proposed transition-focused observation abstraction.", "section_number": 4}, {" publication_date": "2019", "fullname_first_author": "Danijar Hafner", "paper_title": "Learning latent dynamics for planning from pixels", "reason": "This paper introduces a method for learning latent dynamics for planning directly from pixel observations, a crucial concept relevant to the current work. The focus on learning latent representations (rather than raw observations) is directly relevant to the design choices in the WMA agent's transition-focused observation abstraction, which aims to reduce computational cost and improve training efficiency.", "section_number": 4}, {" publication_date": "2020", "fullname_first_author": "Danijar Hafner", "paper_title": "Mastering atari with discrete world models", "reason": "This work shows successful application of world models in mastering Atari games, highlighting the potential of using world models to improve agent performance in complex environments.  This is relevant to the current work because it demonstrates the feasibility and effectiveness of integrating world models into RL agents, providing valuable context and support for the proposed WMA approach.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Jing Yu Koh", "paper_title": "Tree search agent", "reason": "The Tree search agent is a state-of-the-art web agent that serves as a strong baseline for comparison. The direct comparison with the tree-search method showcases the efficiency and performance gains of the proposed WMA agent, further highlighting its importance and effectiveness.  Thus, it's a critical reference for evaluating the WMA agent's performance.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Paloma Sodhi", "paper_title": "Heap: Hierarchical policies for web actions using llms", "reason": "This paper focuses on hierarchical policies for web actions, which is relevant to the organization and planning aspects of complex web navigation tasks.  Hierarchical policies are often used to manage the complexity of long-horizon tasks, making this a relevant reference for understanding how to address the limitations of LLMs in such tasks.  The methods and techniques explored are relevant to the WMA's approach.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Xuezhi Wang", "paper_title": "Self-consistency improves chain of thought reasoning in language models", "reason": "This paper demonstrates that self-consistency can significantly improve reasoning in LLMs, highlighting the importance of improving the internal consistency and reliability of LLMs for better performance.  This is relevant because the WMA agent's world model also aims to improve the decision-making process of LLMs by enhancing their understanding of environmental dynamics and the consequences of actions.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Aman Madaan", "paper_title": "Self-refine: Iterative refinement with self-feedback", "reason": "This paper introduces self-refinement as a technique for improving LLM-based agents.  This technique is directly relevant to the section that explores combining self-refinement with the proposed WMA agent, providing context and showcasing the potential benefits of using this method in conjunction with world models.", "section_number": 6}, {" publication_date": "1954", "fullname_first_author": "Ward Edwards", "paper_title": "The theory of decision making", "reason": "This seminal paper provides a foundational understanding of human decision-making, which is crucial for the current work.  The concept of a \"world model\" is strongly tied to human decision-making processes, and this paper's inclusion helps establish the theoretical basis for the proposed WMA agent's approach and its connection to the human ability to consider consequences before acting.", "section_number": 1}, {" publication_date": "1990", "fullname_first_author": "Richard S. Sutton", "paper_title": "Dyna, an integrated architecture for learning, planning, and reacting", "reason": "This foundational paper in reinforcement learning introduces the Dyna architecture, which incorporates planning using a world model. The Dyna architecture's concept of planning with a world model is directly relevant to the proposed WMA approach and is a fundamental concept in reinforcement learning, thereby providing valuable historical context and theoretical grounding.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Izzeddin Gur", "paper_title": "A real-world webagent with planning, long context understanding, and program synthesis", "reason": "This paper presents a strong baseline method that uses LLMs for web navigation tasks.  Comparing the proposed WMA agent to this state-of-the-art approach further highlights the benefits of incorporating world models, especially for tasks requiring complex planning and reasoning in long-horizon environments.  Thus, it's a crucial reference for comparison and demonstrating improvements.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Paloma Sodhi", "paper_title": "Heap: Hierarchical policies for web actions using llms", "reason": "This paper presents an approach to hierarchical policies that are particularly effective for managing the complexity of long-horizon tasks.  This is important because the WMA agent is designed to handle the complexity of long-horizon web navigation tasks, and understanding hierarchical policies provides valuable context for how to improve the efficiency of planning and execution.  Thus, it offers a relevant comparison to the WMA approach.", "section_number": 5}]}