[{"figure_path": "2410.13232/tables/table_7_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the success rates of various web agents on the WebArena benchmark, comparing their performance with and without policy optimization using different LLMs.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_7_1.html", "caption": "Table 2: Domain-specific performance of agents using GPT-40-mini as policy models", "description": "Table 2 presents the domain-specific performance of agents using GPT-40-mini as policy models, showing the success rate across various domains within the WebArena benchmark and the relative performance gains achieved through policy optimization with world models.", "section": "5 Experiments"}, {"figure_path": "2410.13232/tables/table_8_0.html", "caption": "Table 3: Success rate on Mind2Web tests using GPT-3.5-Turbo as policy models. EA = element accuracy; EF = element filtering; AF₁ = action F₁; * = results from the original paper.", "description": "Table 3 presents a comparison of the success rates of various methods on the Mind2Web benchmark, highlighting the performance improvements achieved by incorporating the world model.", "section": "5.2 Main Results"}, {"figure_path": "2410.13232/tables/table_9_0.html", "caption": "Table 4: Head-to-head comparison of Tree search agent (results are from Koh et al. (2024)) and ours regarding (i) SR and (ii) API cost, and (iii) inference time. We use GPT-40 for policy models.", "description": "Table 4 compares the performance of the proposed WMA web agent and the Tree search agent in terms of success rate, API cost, and inference time on the WebArena benchmark.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_9_1.html", "caption": "Table 5: Results of the ablation study in WebArena.", "description": "Table 5 presents the ablation study results on WebArena, showing the impact of different components of the proposed World-Model-Augmented (WMA) web agent on success rates across various domains.", "section": "5 Experiments"}, {"figure_path": "2410.13232/tables/table_9_2.html", "caption": "Table 6: Performance with different value functions.", "description": "The table compares the performance of two different value functions, one fine-tuned and another using GPT-40-mini, in terms of success rate (SR) on the WebArena benchmark.", "section": "5.2 Main Results"}, {"figure_path": "2410.13232/tables/table_10_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the success rate of different web agents on the WebArena benchmark, comparing performance with and without policy optimization using world models.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_15_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "This table presents the success rates of various web agents on the WebArena benchmark, comparing performance with and without policy optimization, and showing the relative gains achieved.", "section": "5 Experiments"}, {"figure_path": "2410.13232/tables/table_23_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the success rates of various web agents on the WebArena benchmark, comparing their performance with and without policy optimization using world models.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_24_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the performance of various web agents on the WebArena benchmark, comparing their success rates with and without policy optimization, and showing the relative performance gains achieved through policy optimization.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_25_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents a comparison of different web agent methods on the WebArena benchmark, showing their success rates with and without policy optimization, and the relative performance improvement achieved through policy optimization.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_26_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the performance of various web agents on the WebArena benchmark, showing improvements achieved through policy optimization with world models.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_27_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents the success rate of different web agents on the WebArena benchmark, comparing their performance with and without policy optimization using world models.", "section": "5 Experiments"}, {"figure_path": "2410.13232/tables/table_28_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "Table 1 presents a comparison of various web agents' performance on the WebArena benchmark, highlighting the relative improvement achieved through policy optimization with and without the proposed world model.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_29_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "This table presents the performance comparison of different web agents on the WebArena benchmark, showing their success rates with and without policy optimization, and the relative performance gains.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_30_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "This table presents the success rates of different web agents on the WebArena benchmark, comparing their performance with and without policy optimization, and showing the relative performance gains achieved through policy optimization.", "section": "5 EXPERIMENTS"}, {"figure_path": "2410.13232/tables/table_31_0.html", "caption": "Table 1: Agent performance in WebArena. Δ: relative performance gains from policy optimization.", "description": "This table presents the success rates of different web agents on the WebArena benchmark, comparing their performance with and without policy optimization, and shows relative performance gains achieved by incorporating the policy optimization.", "section": "5 EXPERIMENTS"}]