{"references": [{" publication_date": "2017", "fullname_first_author": "David Silver", "paper_title": "Mastering the game of go without human knowledge", "reason": "This paper is a seminal work in reinforcement learning, demonstrating the power of deep reinforcement learning to achieve superhuman performance in a complex game.  Its impact extends beyond game playing, influencing various fields, including robotics, and is directly relevant to the advancements in general-purpose robotic policies discussed in this paper.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Alec Ramesh", "paper_title": "Zero-shot text-to-image generation", "reason": "This paper showcases the significant progress in large-scale generative models and their ability to perform zero-shot tasks.  The ability to generate images from text has applications in robotics for task planning and visualization which is relevant to this paper's focus on improving robotic policies.", "section_number": 1}, {" publication_date": "2020", "fullname_first_author": "Tom Brown", "paper_title": "Language models are few-shot learners", "reason": "This paper highlights the remarkable capabilities of large language models to perform well on various tasks with few-shot learning. This is important to this paper's work as it underscores the potential of combining generalist policies with value functions for improved performance. The few-shot learning capability is analogous to the goal of steering a pre-trained policy with a value function without extensive fine-tuning.", "section_number": 1}, {" publication_date": "2020", "fullname_first_author": "Jared Kaplan", "paper_title": "Scaling laws for neural language models", "reason": "This paper presents scaling laws for neural language models, which is relevant to the progress in large language models and their applications in robotics. The scaling laws can help guide the development of better and larger models for robotic tasks, which is related to the improvement of general-purpose robotic policies.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Rohan Bommasani", "paper_title": "On the opportunities and risks of foundation models", "reason": "This work offers a comprehensive analysis of foundation models, including their potential benefits and risks.  The discussion of foundation models is directly relevant to the study of generalist robotic policies, which are analogous to foundation models in the context of robotics.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Open X-Embodiment Collaboration", "paper_title": "Open X-Embodiment: Robotic learning datasets and RT-X models", "reason": "This paper introduces a significant dataset and a model which are essential components of this paper's experimental setup. The Open X-Embodiment dataset is used for training and evaluating the robotic policies. The RT-X model is used as one of the baselines and compared with the V-GPS method.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Alexey Brohan", "paper_title": "RT-2: Vision-language-action models transfer web knowledge to robotic control", "reason": "This paper demonstrates the effectiveness of vision-language-action models in robotics and directly relates to this paper's work on general-purpose robotic policies.  The authors present a state-of-the-art approach that leverages the knowledge from web data to control robotic actions. This is relevant as the current paper also deals with improving the performance of similar models for robotic tasks.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Octo Model Team", "paper_title": "Octo: An open-source generalist robot policy", "reason": "This paper is highly important because it provides the generalist robot policy (Octo) that this paper uses as a baseline for comparison.  The Octo policy's performance is improved through the use of value functions, providing a direct validation of the V-GPS method.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Kevin Black", "paper_title": "Zero-shot robotic manipulation with pretrained image-editing diffusion models", "reason": "This paper directly tackles the problem of imprecise manipulation in robotic policies, similar to this paper's focus on the limitations of generalist robotic policies.  It demonstrates how image-editing diffusion models can improve robotic performance on unseen tasks, establishing a direct relationship to this paper's aim of improving the robustness and precision of these policies.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Xuanlin Li", "paper_title": "Evaluating real-world robot manipulation policies in simulation", "reason": "This paper is critical for the experimental validation of this paper's method. The SIMPLER environment discussed in this paper is specifically designed for real-to-sim evaluation of robotic policies. This paper provides a strong validation environment for the proposed methodology.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Aviral Kumar", "paper_title": "Pre-training for robots: Offline rl enables learning new tasks from a handful of trials", "reason": "This paper demonstrates the effectiveness of offline reinforcement learning in robotics, which is directly related to this paper's use of offline RL for training the value function. The techniques and methodologies used in this previous work directly inform this paper's approach, making it a highly important reference.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Michael Kim", "paper_title": "OpenVLA: An open-source vision-language-action model", "reason": "This paper provides the OpenVLA model used as one of the baselines in this paper's experiments.  OpenVLA is a state-of-the-art vision-language-action model, and its comparison with V-GPS highlights the effectiveness of the proposed approach across different policy architectures.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Homer Walke", "paper_title": "Bridgedata v2: A dataset for robot learning at scale", "reason": "This paper provides the Bridge V2 dataset, a crucial component of the dataset used to train the value function in the proposed method.  The characteristics and size of Bridge V2 directly influence the quality and performance of the value function, affecting the overall results of the proposed V-GPS method.", "section_number": 6}, {" publication_date": "2023", "fullname_first_author": "Anusha Maddukuri", "paper_title": "Open X-Embodiment: Robotic learning datasets and RT-X models", "reason": "The Open X-Embodiment dataset, highlighted in this paper, is the foundation for the training and evaluation of many state-of-the-art generalist robot policies, including those used in this paper.  The quality and diversity of the dataset significantly influence the performance of both the baseline policies and the V-GPS method.", "section_number": 6}, {" publication_date": "2022", "fullname_first_author": "Felix Ebert", "paper_title": "Bridge data: Boosting generalization of robotic skills with cross-domain datasets", "reason": "This paper is important because it discusses the creation of the Bridge dataset, which forms a key part of the dataset used for pre-training the value function within this paper. The quality and characteristics of this dataset directly impact the performance of the value function and consequently the effectiveness of the proposed V-GPS approach.", "section_number": 6}, {" publication_date": "2024", "fullname_first_author": "Xuanlin Li", "paper_title": "Evaluating real-world robot manipulation policies in simulation", "reason": "This paper presents the SIMPLER simulation environment used for evaluating the performance of the proposed method. SIMPLER is designed to closely reflect real-world scenarios which is very important for evaluating robotic policies.  The accuracy and reliability of the SIMPLER results are crucial for assessing the validity and impact of V-GPS.", "section_number": 6}, {" publication_date": "2017", "fullname_first_author": "Ashish Vaswani", "paper_title": "Attention is all you need", "reason": "This paper introduces the Transformer architecture, which is the basis of many of the generalist robotic policies used in this paper.  The Transformer's influence on the field of deep learning, and specifically its role in state-of-the-art robotic policies, is significant.  The performance gains from V-GPS rely on the effectiveness of the baseline Transformer-based policies.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Tianhao Zhao", "paper_title": "Learning fine-grained bimanual manipulation with low-cost hardware", "reason": "This work directly addresses the issue of precise manipulation, which is a key challenge that this paper aims to address.  The techniques and findings from this paper are directly relevant to this paper's study of improving the precision and robustness of generalist robotic policies.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Cheolhyeon Chi", "paper_title": "Diffusion policy: Visuomotor policy learning via action diffusion", "reason": "This work is highly relevant to the core idea of this paper. It introduces a novel approach called diffusion policy that focuses on enhancing the precision and robustness of robotic manipulation tasks, which is one of the main aims of the current paper. The techniques of this diffusion model is directly related to the work of improving the generalist robotic policies.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Sergey Levine", "paper_title": "Offline reinforcement learning: Tutorial, review, and perspectives on open problems", "reason": "This paper provides a comprehensive overview of offline reinforcement learning, which is the foundation of the value function training in this paper's method.  The techniques and challenges of offline RL are directly related to this paper's value function training procedure, and this tutorial paper provides background knowledge to understand these techniques.", "section_number": 2}]}