[{"figure_path": "2410.16268/tables/table_1_0.html", "caption": "Table 1: Performance comparison on SA-V (Ravi et al., 2024) and LVOS v2 (Hong et al., 2024) datasets between SAM 2 and SAM2Long across all model sizes. † We report the re-produced performance of SAM 2 using its open-source code and checkpoint.", "description": "Table 1 presents a comparison of the performance of SAM2 and SAM2Long across various model sizes on the SA-V and LVOS v2 datasets, showing consistent improvements by SAM2Long.", "section": "4.2 Main Results"}, {"figure_path": "2410.16268/tables/table_8_0.html", "caption": "Table 1: Performance comparison on SA-V (Ravi et al., 2024) and LVOS v2 (Hong et al., 2024) datasets between SAM 2 and SAM2Long across all model sizes. † We report the re-produced performance of SAM 2 using its open-source code and checkpoint.", "description": "Table 1 shows a comparison of the performance of SAM2 and SAM2Long across different model sizes on the SA-V and LVOS v2 datasets, highlighting the consistent improvement achieved by SAM2Long.", "section": "4.2 Main Results"}, {"figure_path": "2410.16268/tables/table_8_1.html", "caption": "Table 2: Performance comparison with the state-of-the-arts methods on SA-V dataset.", "description": "Table 2 presents a comparison of the performance of SAM2Long against other state-of-the-art video object segmentation methods on the SA-V dataset, showcasing its superior performance.", "section": "4.2 Main Results"}, {"figure_path": "2410.16268/tables/table_9_0.html", "caption": "Table 1: Performance comparison on SA-V (Ravi et al., 2024) and LVOS v2 (Hong et al., 2024) datasets between SAM 2 and SAM2Long across all model sizes. † We report the re-produced performance of SAM 2 using its open-source code and checkpoint.", "description": "Table 1 presents a comparison of the performance of SAM2 and SAM2Long across various model sizes on the SA-V and LVOS v2 datasets, showing consistent improvements of SAM2Long over SAM2.", "section": "4.2 MAIN RESULTS"}, {"figure_path": "2410.16268/tables/table_9_1.html", "caption": "Table 4: The performance comparisons between SAM 2 and SAM2Long on other VOS benchmarks. All experiments use SAM2.1-Large model.", "description": "Table 4 presents the performance comparison of SAM 2 and SAM2Long on three additional video object segmentation datasets: MOSE, VOST, and PUMAVOS.", "section": "4.2 Main Results"}, {"figure_path": "2410.16268/tables/table_10_0.html", "caption": "Table 5. Ablation on number of pathways P.", "description": "Table 5 shows the ablation study on the number of memory pathways (P) in SAM2Long, demonstrating that increasing the number of pathways improves performance, but beyond three pathways, the improvements become marginal.", "section": "4.3 ABLATION STUDY"}, {"figure_path": "2410.16268/tables/table_10_1.html", "caption": "Table 7: Ablation on uncertainty threshold conf.", "description": "Table 7 shows the ablation study on the uncertainty threshold (conf) in SAM2Long, demonstrating the impact of different threshold values on the overall performance.", "section": "4.3 ABLATION STUDY"}, {"figure_path": "2410.16268/tables/table_10_2.html", "caption": "Table 6: Ablation on IoU threshold \\(\\delta_{iou}\\).", "description": "Table 6 shows the ablation study on the impact of different Intersection over Union (IoU) thresholds on the performance of the SAM2Long model.", "section": "4.3 ABLATION STUDY"}, {"figure_path": "2410.16268/tables/table_10_3.html", "caption": "Table 8: Ablation on modulation [Wlow, Whigh].", "description": "Table 8 shows the ablation study on the effect of modulating the attention weights for memory entries using different ranges.", "section": "4.3 ABLATION STUDY"}]