[{"figure_path": "2410.18084/figures/figures_1_0.png", "caption": "Figure 1: Dynamic LiDAR scene generation from DynamicCity. We introduce a new LiDAR generation model that generates diverse 4D scenes of large spatial scales (80 × 80 × 6.4 meter³) and long sequential modeling (up to 128 frames), enabling a diverse set of downstream applications. For more examples, kindly refer to our Project Page: https://dynamic-city.github.io.", "description": "Figure 1 illustrates DynamicCity's capability to generate diverse large-scale and long-sequential 4D LiDAR scenes from various driving scenarios.", "section": "Introduction"}, {"figure_path": "2410.18084/figures/figures_4_0.png", "caption": "Figure 2: Pipeline of dynamic LiDAR scene generation. Our DynamicCity framework consists of two key procedures: (a) Encoding HexPlane with an VAE architecture (cf. Sec. 4.1), and (b) 4D Scene Generation with HexPlane DiT (cf. Sec. 4.2).", "description": "The figure illustrates the two-stage pipeline of DynamicCity for dynamic LiDAR scene generation, including HexPlane encoding with a VAE and HexPlane diffusion with DiT.", "section": "4 OUR APPROACH"}, {"figure_path": "2410.18084/figures/figures_5_0.png", "caption": "Figure 3: VAE for Encoding 4D LIDAR Scenes. We use HexPlane H as the 4D representation. fo and go are convolution-based networks with downsampling and upsampling operations, respectively. h(.) denotes the projection network based on transformer modules.", "description": "The figure illustrates the VAE architecture used in DynamicCity for encoding 4D LiDAR scenes into compact HexPlane representations.", "section": "4.1 VAE FOR 4D LIDAR SCENES"}, {"figure_path": "2410.18084/figures/figures_6_0.png", "caption": "Figure 2: Pipeline of dynamic LiDAR scene generation. Our DynamicCity framework consists of two key procedures: (a) Encoding HexPlane with an VAE architecture (cf. Sec. 4.1), and (b) 4D Scene Generation with HexPlane DiT (cf. Sec. 4.2).", "description": "The figure illustrates the two-stage pipeline of DynamicCity for dynamic LiDAR scene generation, showing the VAE for HexPlane encoding and the DiT for HexPlane-based 4D scene generation.", "section": "4 OUR APPROACH"}, {"figure_path": "2410.18084/figures/figures_6_1.png", "caption": "Figure 5: Condition Injection for DiT", "description": "The figure illustrates how numeric and image conditions are injected into the DiT for conditional generation of HexPlane.", "section": "4.2 Diffusion Transformer for HexPlane"}, {"figure_path": "2410.18084/figures/figures_8_0.png", "caption": "Figure 6: Dynamic Scene Generation Results. We provide unconditional generation scenes from the 1st, 8th, and 16th frames on Occ3D-Waymo (Left) and CarlaSC (Right), respectively. Kindly refer to the Appendix for complete sequential scenes and longer temporal modeling examples.", "description": "Figure 6 shows example unconditional generation results from DynamicCity on Occ3D-Waymo and CarlaSC datasets, showcasing the model's ability to generate realistic dynamic scenes across different time steps.", "section": "5.2 4D SCENE RECONSTRUCTION & GENERATION"}, {"figure_path": "2410.18084/figures/figures_9_0.png", "caption": "Figure 7: Dynamic Scene Generation Applications. We demonstrate the capability of our model on a diverse set of downstream tasks. We show the 1st, 8th, and 16th frames for simplicity. Kindly refer to the Appendix for complete sequential scenes and longer temporal modeling examples.", "description": "The figure showcases various downstream applications of DynamicCity, including command-driven, layout-conditioned, and trajectory-guided generation, as well as dynamic object inpainting.", "section": "5.3 ABLATION STUDIES"}, {"figure_path": "2410.18084/figures/figures_20_0.png", "caption": "Figure 8: Unconditional Dynamic Scene Generation Results. We provide qualitative examples of a total of 16 consectutive frames generated by DynamicCity on the Occ3D-Waymo (Tian et al., 2023) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "Figure 8 shows 16 consecutive frames of an unconditional dynamic scene generated by DynamicCity on the Occ3D-Waymo dataset, showcasing the model's ability to generate realistic and detailed dynamic scenes.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_21_0.png", "caption": "Figure 8: Unconditional Dynamic Scene Generation Results. We provide qualitative examples of a total of 16 consectutive frames generated by DynamicCity on the Occ3D-Waymo (Tian et al., 2023) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "Figure 8 shows 16 consecutive frames of an unconditional dynamic scene generated by DynamicCity on the Occ3D-Waymo dataset.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_22_0.png", "caption": "Figure 10: HexPlane-Guided Generation Results. We provide qualitative examples of a total of 64 consectutive frames generated by DynamicCity on the Occ3D-Waymo (Tian et al., 2023) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "Figure 10 shows 64 consecutive frames generated by DynamicCity, demonstrating the model's ability to generate long, temporally consistent sequences of 4D LiDAR data conditioned on HexPlane.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_23_0.png", "caption": "Figure 1: Dynamic LiDAR scene generation from DynamicCity. We introduce a new LiDAR generation model that generates diverse 4D scenes of large spatial scales (80 × 80 × 6.4 meter³) and long sequential modeling (up to 128 frames), enabling a diverse set of downstream applications. For more examples, kindly refer to our Project Page: https://dynamic-city.github.io.", "description": "Figure 1 shows example LiDAR scene generation results from the DynamicCity model, highlighting its ability to generate diverse and large-scale 4D scenes.", "section": "INTRODUCTION"}, {"figure_path": "2410.18084/figures/figures_24_0.png", "caption": "Figure 12: Command-Guided Scene Generation Results. We provide qualitative examples of a total of 16 consectutive frames generated under the command RIGHT by DynamicCity on the CarlaSC (Wilson et al., 2022) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "This figure shows qualitative examples of 16 consecutive frames generated by DynamicCity under the command RIGHT, demonstrating the model's ability to control the ego vehicle's motion and the scene's relative motion based on movement trends.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_25_0.png", "caption": "Figure 8: Unconditional Dynamic Scene Generation Results. We provide qualitative examples of a total of 16 consectutive frames generated by DynamicCity on the Occ3D-Waymo (Tian et al., 2023) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "Figure 8 shows 16 consecutive frames of an unconditonally generated dynamic LiDAR scene from the Occ3D-Waymo dataset showcasing the model's ability to generate realistic and detailed dynamic scenes.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_26_0.png", "caption": "Figure 14: Dynamic Inpainting Results. We provide qualitative examples of a total of 16 consecutive frames generated by DynamicCity on the CarlaSC (Wilson et al., 2022) dataset. Best viewed in colors and zoomed-in for additional details.", "description": "Figure 14 shows the results of dynamic inpainting on 16 consecutive frames from the CarlaSC dataset, demonstrating the model's ability to seamlessly regenerate masked regions while maintaining consistency with the surrounding scene.", "section": "C Additional Qualitative Results"}, {"figure_path": "2410.18084/figures/figures_27_0.png", "caption": "Figure 6: Dynamic Scene Generation Results. We provide unconditional generation scenes from the 1st, 8th, and 16th frames on Occ3D-Waymo (Left) and CarlaSC (Right), respectively. Kindly refer to the Appendix for complete sequential scenes and longer temporal modeling examples.", "description": "Figure 6 shows the unconditional generation results of DynamicCity on Occ3D-Waymo and CarlaSC datasets, illustrating the model's ability to generate realistic and detailed dynamic scenes.", "section": "5.2 4D SCENE RECONSTRUCTION & GENERATION"}]