{"references": [{" publication_date": "2022", "fullname_first_author": "K. Gatterman", "paper_title": "Who Won the Election? Explaining News Coverage of Election Results in Multi-Party Systems", "reason": "This paper is highly relevant to the current research because it investigates how news coverage of election results influences public opinion, providing a strong theoretical foundation for understanding media manipulation in the context of elections. It is essential to the paper as it examines the power dynamics of media and their influence on political outcomes.  The study of media manipulation techniques is directly relevant to the paper's investigation of Chinese diaspora media's role in shaping public opinion surrounding European elections.", "section_number": 7}, {" publication_date": "2021", "fullname_first_author": "M. Schliebs", "paper_title": "China's Public Diplomacy Operations: Understanding Engagement and Inauthentic Amplification of PRC Diplomats on Facebook and Twitter", "reason": "This paper directly addresses the topic of Chinese public diplomacy and its use of social media, offering valuable insights into the methods and strategies employed by the PRC to influence public opinion. Its discussion of inauthentic amplification techniques provides a strong context for understanding potential manipulation within ethnic Chinese diaspora media, making it a crucial reference for the current work.", "section_number": 7}, {" publication_date": "2024", "fullname_first_author": "M. Thunø", "paper_title": "The Initial Digitalization of Chinese Diplomacy (2019-2021): Establishing Global Communication Networks on Twitter", "reason": "This research delves into the digital strategies of Chinese diplomacy, contributing important contextual information for understanding how the PRC leverages digital platforms to promote its narratives. This provides a crucial framework for assessing how similar strategies might be deployed within ethnic Chinese diaspora media in Europe, making it a key reference for the study.", "section_number": 7}, {" publication_date": "2022", "fullname_first_author": "V. Brussee", "paper_title": "Authoritarian Design: How the Digital Architecture on China's Sina Weibo Facilitate Information Control", "reason": "This paper's focus on information control within China's digital architecture provides critical insight into potential methods of manipulating information flow, especially in the context of ethnic Chinese diaspora media.  The architectural design of such digital platforms is crucial to understanding how the PRC may strategically manage information and influence public perception, making it an important contribution to the current study.", "section_number": 7}, {" publication_date": "2023", "fullname_first_author": "K. Chan", "paper_title": "<Redirecting> the Diaspora: China's United Front Work and the Hyperlink Networks of Diasporic Chinese Websites in Cyberspace", "reason": "This study directly examines the role of Chinese diaspora media within the broader context of China's United Front Work, providing a crucial framework for understanding the potential for influence and manipulation within this specific media landscape. The focus on hyperlink networks offers important insights into the strategic dissemination of information through this media, making this paper highly relevant to the current study.", "section_number": 7}, {" publication_date": "2018", "fullname_first_author": "A. T. J. Barron", "paper_title": "Individuals, Institutions, and Innovation in the Debates of the French Revolution", "reason": "This paper introduces the methodology of using information-theoretic measures of novelty and resonance to analyze information dynamics in complex cultural systems, which is directly applicable to the current work. The paper provides a theoretical foundation and practical application example for quantifying information flow and change, making it crucial to the study's methods.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "K. L. Nielbo", "paper_title": "Trend Reservoir Detection: Minimal Persistence and Resonant Behavior of Trends in Social Media", "reason": "This paper introduces the concept of \"trend reservoirs\" and how they relate to information dynamics, a key area of investigation in this study. The analysis of trend reservoirs utilizes novelty and resonance, providing a relevant framework for understanding the dynamics of information flow, thus making it critical to the study.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "K. L. Nielbo", "paper_title": "News Information Decoupling: An Information Signature of Catastrophes in Legacy News Media", "reason": "This study provides a comparative analysis of information dynamics during times of crisis, drawing parallels to the potential impact of major political events on Chinese diaspora media.  It illustrates how information dynamics can be understood during significant political transitions or crises. Its use of novelty and resonance metrics is directly relevant to this research.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "K. L. Nielbo", "paper_title": "When No News is Bad News – Detection of Negative Events from News Media Content", "reason": "This paper enhances the understanding of information dynamics during times of crisis, providing relevant insights into the impact of major events (such as elections) on Chinese diaspora media.  The paper investigates the impact of news events on the way news spreads and is discussed, providing context for the analysis of news.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "K. L. Nielbo", "paper_title": "Pandemic News Information Uncertainty -News Dynamics Mirror Differential Response Strategies to COVID-19", "reason": "This study employs novelty and resonance metrics to analyze information dynamics during the COVID-19 pandemic, providing another practical example and demonstration of the methodology.  The focus on information uncertainty and responses to a crisis is directly relevant to understanding the information flows in Chinese diaspora media during times of uncertainty.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "M. Wevers", "paper_title": "Event Flow – How Events Shaped the Flow of the News, 1950-1995", "reason": "This research provides a historical perspective on information dynamics related to significant events, contextualizing the present work. The long-term study of news media and information flow aids in understanding the larger context of how information spreads over time, and how this relates to the current work. The use of novelty and resonance analysis makes this highly relevant.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "R. B. Baglini", "paper_title": "Emodynamics: Detecting and Characterizing Pandemic Sentiment Change Points on Danish Twitter", "reason": "This study demonstrates the practical application of analyzing sentiment changes through information dynamics, which is directly relevant to the current project.  The methodology of identifying sentiment change points can be adapted to analyze topic changes within Chinese diaspora media, providing a strong methodological foundation for this research.", "section_number": 2}, {" publication_date": "2003", "fullname_first_author": "D. M. Blei", "paper_title": "Latent Dirichlet Allocation", "reason": "This foundational paper introduces Latent Dirichlet Allocation (LDA), a widely used topic modeling technique. Understanding LDA's strengths and limitations is crucial for evaluating the proposed KeyNMF model and for understanding how novelty and resonance are typically calculated in topic modeling. It's fundamental to the background of topic modeling methods.", "section_number": 2}, {" publication_date": "2012", "fullname_first_author": "D. M. Blei", "paper_title": "Probabilistic Topic Models", "reason": "This paper provides a comprehensive overview of probabilistic topic models, which forms the basis for understanding the theoretical underpinnings of KeyNMF.  The paper helps in understanding various topic models, their capabilities and limitations, and thus contributes to better assessing the advantages of KeyNMF.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "M. Kardos", "paper_title": "S³ – Semantic Signal Separation", "reason": "This paper introduces a novel semantic signal separation method (S3), providing a strong methodological foundation for the current research.  The paper is highly relevant due to its emphasis on semantic coherence and its suitability for studying information dynamics in complex systems, especially its use of diverse metrics.", "section_number": 3}, {" publication_date": "2009", "fullname_first_author": "H. M. Wallach", "paper_title": "Rethinking LDA: Why Priors Matter", "reason": "This paper critically evaluates the limitations of LDA, highlighting the importance of prior selection in topic modeling.  This helps in providing context and rationale for the use of KeyNMF, highlighting its advantages over LDA in terms of dealing with data scarcity and contextual information.", "section_number": 2}, {" publication_date": "2010", "fullname_first_author": "R. Řehůřek", "paper_title": "Software Framework for Topic Modelling with Large Corpora", "reason": "This paper introduces a software framework for topic modeling with large corpora, demonstrating the practical challenges involved and providing a baseline for comparison with KeyNMF. This helps in understanding the practical considerations for topic modeling and makes this paper a crucial part of the study.", "section_number": 2}, {" publication_date": "2011", "fullname_first_author": "F. Pedregosa", "paper_title": "Scikit-Learn: Machine Learning in Python", "reason": "This paper describes scikit-learn, a widely used machine learning library in Python. The use of scikit-learn in the current study is key as it underscores the reproducibility and accessibility of the research methodology, showing the practical application of machine learning in the field. Thus, this paper is highly important.", "section_number": 3}, {" publication_date": "2016", "fullname_first_author": "Z. Qin", "paper_title": "Topic modeling of chinese language beyond a bag-of-words", "reason": "This paper explores topic modeling specifically for the Chinese language, providing essential insights into challenges associated with processing and modeling Chinese text, which helps to justify and contextualize KeyNMF's focus on Chinese language corpora.  It tackles the issues of Chinese topic modeling, making it essential to the research context.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "N. Reimers", "paper_title": "Sentence-BERT: Sentence Embeddings using Siamese BERT-Networks", "reason": "This highly influential paper introduces Sentence-BERT, the embedding model used in this work. The impact of Sentence-BERT is crucial to understanding how text embeddings are generated for analysis, and thus this is a vital resource for the understanding of the current study.", "section_number": 3}, {" publication_date": "2021", "fullname_first_author": "F. Bianchi", "paper_title": "Pre-Training is a Hot Topic: Contextualized Document Embeddings Improve Topic Coherence", "reason": "This paper highlights the advantages of using pre-trained contextualized embeddings for improved topic coherence, providing further justification for the use of similar techniques in KeyNMF.  The paper focuses on contextualized embeddings, making it essential for understanding the current work.", "section_number": 3}, {" publication_date": "2021", "fullname_first_author": "F. Bianchi", "paper_title": "Cross-lingual Contextualized Topic Models with Zero-shot Learning", "reason": "This paper explores cross-lingual contextual topic models, demonstrating the feasibility and benefits of using pre-trained language models for cross-lingual topic modeling. This adds to the research in KeyNMF as it explains the application of pre-trained language models for improving the model’s ability to work with diverse languages.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "M. Grootendorst", "paper_title": "BERTopic: Neural Topic Modeling with a Class-Based TF-IDF Procedure", "reason": "This paper introduces BERTopic, a widely used state-of-the-art topic modeling technique. Comparing KeyNMF with BERTopic is essential for evaluating its performance and for highlighting its advantages over established methods, especially in cases with data scarcity. This adds to the overall understanding of topic modelling methods.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "D. Angelov", "paper_title": "Top2Vec: Distributed Representations of Topics", "reason": "Top2Vec is a prominent topic modeling method, and comparing KeyNMF's performance with Top2Vec provides a benchmark for evaluating the effectiveness of the new model. Its distributed representations of topics make it a valuable comparison point and provide a way to assess the accuracy and value of KeyNMF’s approach.", "section_number": 3}, {" publication_date": "2018", "fullname_first_author": "M. Belford", "paper_title": "Stability of Topic Modeling via Matrix Factorization", "reason": "This paper discusses the stability of topic modeling techniques via matrix factorization, which provides important theoretical support and justification for KeyNMF's use of Non-negative Matrix Factorization (NMF). The focus on stability aids in understanding the strengths and weaknesses of various topic modeling methods.", "section_number": 3}, {" publication_date": "2011", "fullname_first_author": "A. Lefèvre", "paper_title": "Online Algorithms for Nonnegative Matrix Factorization with the Itakura-Saito Divergence", "reason": "This paper provides an important algorithmic foundation for KeyNMF's use of NMF. The optimization techniques presented enhance the understanding of KeyNMF’s inner workings, aiding in interpreting its results and demonstrating its efficiency. Thus, this paper is relevant to the methodology of the research.", "section_number": 3}, {" publication_date": "2009", "fullname_first_author": "A. Cichocki", "paper_title": "Fast Local Algorithms for Large Scale Nonnegative Matrix and Tensor Factorizations", "reason": "This paper focuses on algorithms for large-scale nonnegative matrix and tensor factorization, which is crucial to the efficiency and scalability of KeyNMF.   The efficient algorithms presented are highly relevant due to the large dataset used in this research, making this paper a valuable contribution to the understanding of the methodology used.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "M. Grootendorst", "paper_title": "KeyBERT: Minimal Keyword Extraction with BERT", "reason": "KeyBERT is used for keyword extraction in KeyNMF, making this paper highly relevant to the proposed method.  Understanding KeyBERT's functionality is essential for evaluating the accuracy and performance of the keyword extraction phase of KeyNMF and contributes to the overall methodology.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "N. Reimers", "paper_title": "Making Monolingual Sentence Embeddings Multilingual using Knowledge Distillation", "reason": "This paper explains the multilingual sentence embedding model used in the current study.  Understanding this model is crucial to interpreting the embedding process and its implications for the analysis of information dynamics. It is fundamental to the embedding stage of the current work.", "section_number": 5}, {" publication_date": "2003", "fullname_first_author": "H. Pöttker", "paper_title": "News and Its Communicative Quality: the Inverted Pyramid – When and Why Did It Appear?", "reason": "This paper discusses the inverted pyramid structure in journalism and its implications for how information is presented and perceived. The inverted pyramid model is directly relevant as it affects how information is extracted and analyzed.  It aids in understanding the potential impact of how news is presented on the overall analysis.", "section_number": 5}]}