{"references": [{" publication_date": "2022", "fullname_first_author": "Robin Rombach", "paper_title": "High-resolution image synthesis with latent diffusion models", "reason": "This paper is foundational to the work as it introduces latent diffusion models, a core technology used in text-to-image generation. The advancements in high-resolution image synthesis directly impact the ability to control visual concepts and components in the generated images. The proposed MagicTailor framework builds upon the advancements made in latent diffusion models.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Nataniel Ruiz", "paper_title": "DreamBooth: Fine tuning text-to-image diffusion models for subject-driven generation", "reason": "DreamBooth is a highly influential personalization method for text-to-image diffusion models. It directly relates to the current research as it focuses on adapting the T2I model to specific subjects. Understanding its strengths and limitations is crucial for developing MagicTailor which further advances personalization techniques by offering fine-grained control over components.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Chitwan Saharia", "paper_title": "Photorealistic text-to-image diffusion models with deep language understanding", "reason": "This paper is highly relevant as it represents a significant advancement in text-to-image diffusion models, improving the quality and realism of generated images.  The deep language understanding aspect is also relevant to the current research, particularly in relation to how well the model understands and incorporates complex textual prompts that specify the concept and its component.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Edward J Hu", "paper_title": "Lora: Low-rank adaptation of large language models", "reason": "This paper introduces LoRA, a low-rank adaptation technique that is frequently used for efficient fine-tuning of large language models. Its application to the personalization of text-to-image diffusion models is directly relevant to the current research, demonstrating the potential for efficient fine-tuning with precise control over components.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Rinon Gal", "paper_title": "An image is worth one word: Personalizing text-to-image generation using textual inversion", "reason": "This paper is highly relevant because it is one of the pioneering works on personalization in text-to-image generation using textual inversion. It serves as a benchmark for comparing the performance of MagicTailor which extends the capability of personalization by focusing on component-level control.  Understanding the limitations of this method is crucial for motivating and developing MagicTailor.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Nupur Kumari", "paper_title": "Multi-concept customization of text-to-image diffusion", "reason": "This paper addresses the challenge of handling multiple concepts in text-to-image generation, an important factor considered in the current research. While it doesn't directly address component-level control, understanding techniques for integrating multiple concepts is relevant because a concept can be understood as an assemblage of components.  Comparison with this method provides context for the novelty and advancement offered by MagicTailor.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Omri Avrahami", "paper_title": "Break-a-scene: Extracting multiple concepts from a single image", "reason": "This work tackles the problem of extracting multiple concepts from a single image. This directly relates to the task of component-controllable personalization in the current paper, as separating and controlling individual components within an image is a key challenge that is also addressed in the present work. Comparison with Break-a-Scene helps contextualize the novelty of MagicTailor's approach.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Mehdi Safaee", "paper_title": "Clic: Concept learning in context", "reason": "This paper is directly relevant as it also aims to improve the controllability of text-to-image generation, though with a different approach. Comparing MagicTailor to this method provides insight into the different strategies available and highlights the advantages of the current approach in achieving component-level control within a concept.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Devansh Arpit", "paper_title": "A closer look at memorization in deep networks", "reason": "This paper is highly relevant to the current work because it discusses the phenomenon of memorization in deep neural networks. The techniques used in MagicTailor, such as Dynamic Masked Degradation, are designed to mitigate the issue of memorization in the context of visual semantics, directly addressing challenges highlighted in this foundational paper.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Jonathan Ho", "paper_title": "Denoising diffusion probabilistic models", "reason": "This paper is highly relevant as it introduces denoising diffusion probabilistic models (DDPMs), a core technology utilized in the current work for text-to-image generation.  The advancements made in DDPMs directly impact the ability to generate high-quality images and to further enable fine-grained control over the visual concepts and components.  The proposed MagicTailor framework leverages the advancements from this foundational paper.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "Ilya Loshchilov", "paper_title": "Decoupled weight decay regularization", "reason": "This paper introduces decoupled weight decay regularization, an optimization technique frequently used in training deep neural networks. It is directly relevant to the current work as the proposed MagicTailor framework leverages this technique for efficient fine-tuning of the T2I model, improving both the efficiency and performance of the personalization process.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "Antti Tarvainen", "paper_title": "Mean teachers are better role models: Weight-averaged consistency targets improve semi-supervised deep learning results", "reason": "This paper introduces the concept of using exponential moving average (EMA) to stabilize the training process, which is directly relevant to the MagicTailor's use of momentum denoising U-Net to maintain previously learned knowledge while focusing on current training samples. The use of EMA in the context of DS-Bal is crucial for maintaining balance between the concept and component while preventing catastrophic forgetting during fine-tuning.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Meisam Razaviyayn", "paper_title": "Nonconvex min-max optimization: Applications, challenges, and recent theoretical advances", "reason": "This paper provides a comprehensive overview of nonconvex min-max optimization, a technique used in the MagicTailor framework to solve the challenging problem of semantic imbalance. By formally introducing the concepts and discussing various approaches within this area, the paper helps to provide a deeper understanding of the theoretical underpinnings behind the chosen method and to validate its applicability to the specific problem.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Stephanie Fu", "paper_title": "Dreamsim: Learning new dimensions of human visual similarity using synthetic data", "reason": "This paper is important because it provides a new metric, DreamSim, specifically designed to assess the similarity of images generated by different methods,  It is used to quantitatively evaluate the performance of MagicTailor which is a crucial component of the overall methodology. Using DreamSim ensures that the evaluation considers the human perception of visual similarity, making the results more meaningful and robust.", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Alec Radford", "paper_title": "Learning transferable visual models from natural language supervision", "reason": "CLIP is foundational to many text-to-image models and plays a crucial role in the evaluation of MagicTailor. Using CLIP metrics, specifically CLIP-I, allows for quantitative evaluation of the identity fidelity of the generated images. This ensures that the generated images accurately represent the intended visual concepts and components, a key aspect of component-controllable personalization.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Maxime Oquab", "paper_title": "Dinov2: Learning robust visual features without supervision", "reason": "This paper introduces DINO, a powerful self-supervised learning technique for learning visual features without human annotations. Using DINO as a metric for assessing the image quality and identity fidelity of generated images adds further robustness to the overall evaluation of MagicTailor.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Jiale Xu", "paper_title": "Instantmesh: Efficient 3d mesh generation from a single image with sparse-view large reconstruction models", "reason": "This paper describes InstantMesh, a tool that generates 3D meshes from a single image. It is used in the paper to show an additional application of MagicTailor which highlights its flexibility and utility.  The successful collaboration demonstrates the wide applicability of the proposed method.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Lvmin Zhang", "paper_title": "Adding conditional control to text-to-image diffusion models", "reason": "This paper explores methods for adding conditional control to text-to-image diffusion models, which is directly relevant to the current research because component-controllable personalization requires a high degree of controllability in image generation.  Comparison with this work highlights the advancements made by MagicTailor in terms of fine-grained control over components.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Peng Xing", "paper_title": "Csgo: Content-style composition in text-to-image generation", "reason": "This paper presents CSGO, a generative model that allows for flexible composition of content and style in images.  Its integration with MagicTailor is shown as an example application, highlighting the versatility and compatibility of the MagicTailor framework. This showcases its potential to be used in a wide variety of generative tasks.", "section_number": 4}]}