[{"figure_path": "2410.14208/figures/figures_2_0.png", "caption": "Figure 1: Data synthesis methods with standard teacher (data synthesizer) and student (target) setups.", "description": "The figure illustrates four different data synthesis methods: Self-Instruct, Self-Reward, LLM2LLM, and Montessori-Instruct, highlighting their respective processes and components.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.14208/figures/figures_4_0.png", "caption": "Figure 2: Student-Preference-Guided teacher optimization in Montessori-Instruct.", "description": "This figure illustrates the process of Montessori-Instruct, showing how local data influence is collected from a student model, used to construct a preference dataset, and then used to guide the optimization of a teacher model to generate training data.", "section": "3 MONTESSORI-INSTRUCT"}, {"figure_path": "2410.14208/figures/figures_9_0.png", "caption": "Figure 4: Head-to-head win rates for evaluating 8B models among the Self-Instruct baseline and three successive iterations updated using Montessori-Instruct. Left: Win rates of iterations compared to Self-Instruct; Right: Win rates compared between different iterations.", "description": "The figure shows the head-to-head win rates of different iterations of Montessori-Instruct against Self-Instruct and between different iterations.", "section": "5 EVALUATION RESULTS"}, {"figure_path": "2410.14208/figures/figures_16_0.png", "caption": "Figure 2: Student-Preference-Guided teacher optimization in Montessori-Instruct.", "description": "This figure illustrates the process of student-preference-guided teacher optimization in the Montessori-Instruct framework, showing how local data influence is collected and used to optimize the teacher model.", "section": "3 MONTESSORI-INSTRUCT"}, {"figure_path": "2410.14208/figures/figures_18_0.png", "caption": "Figure 6: The most common root verbs (inner circle) and their top direct noun objects (outer circle) in generated instructions.", "description": "The figure is a pair of word clouds showing the most common root verbs and their corresponding noun objects in instructions generated by Self-Instruct and Montessori-Instruct, illustrating differences in the complexity and informativeness of the generated instructions.", "section": "5.5 Case Study"}, {"figure_path": "2410.14208/figures/figures_18_1.png", "caption": "Figure 6: The most common root verbs (inner circle) and their top 4 direct noun objects (outer circle) in generated instructions", "description": "The figure is a word cloud showing the most frequent root verbs and their corresponding noun objects in instructions generated by Self-Instruct and Montessori-Instruct, highlighting differences in instruction complexity and informativeness.", "section": "5.5 CASE STUDY"}, {"figure_path": "2410.14208/figures/figures_19_0.png", "caption": "Figure 6: The most common root verbs (inner circle) and their top 4 direct noun objects (outer circle) in generated instructions.", "description": "The figure shows a comparison of the most common root verbs and their direct noun objects used in instructions generated by Self-Instruct and Montessori-Instruct, illustrating the shift in instruction complexity and focus.", "section": "5.5 CASE STUDY"}, {"figure_path": "2410.14208/figures/figures_20_0.png", "caption": "Figure 2: Student-Preference-Guided teacher optimization in Montessori-Instruct.", "description": "The figure illustrates the process of Montessori-Instruct, showing how local data influence is collected to guide teacher optimization, leading to the generation of student-preference-aligned synthetic data.", "section": "3 MONTESSORI-INSTRUCT"}]