[{"figure_path": "2410.13925/charts/charts_3_0.png", "caption": "Fig. 2: The Height/Width distribution of the original ImageNet [1] dataset.", "description": "The chart displays the distribution of image heights and widths in the ImageNet dataset.", "section": "II. RELATED WORKS"}, {"figure_path": "2410.13925/charts/charts_8_0.png", "caption": "Fig. 7: Effect of classifier-free guidance scale on FID score for ImageNet-256 × 256 and ImageNet-512 × 512 experiments with (a) FiTv2-XL/2 and (b) FiTv2-3B/2 models. (a) For FiTv2-XL/2 model, the optimal performance is achieved with CFG=1.5 for 256 × 256 resolution and CFG=1.65 for 512x 512 resolution. (b) For FiTv2-3B/2 model, the optimal performance is observed with CFG=1.5 for 256 × 256 resolution and CFG=1.6 for 512 × 512 resolution.", "description": "The chart displays the impact of classifier-free guidance (CFG) scale on the FID score for FiTv2 models at different resolutions (256x256 and 512x512).", "section": "V. Experiments"}, {"figure_path": "2410.13925/charts/charts_11_0.png", "caption": "Fig. 8: Effect of scaling FiTv2 model. All the images are sampled without using CFG. We demonstrate FID over training iterations (a) and training GFLOPs (b) of our FiTv2 model of three sizes. Scaling our FiTv2 model yields better quantitative and qualitative performance.", "description": "The chart displays the impact of training steps and GFLOPs on the FID score for three different sizes of the FiTv2 model, demonstrating improved performance with increased scale.", "section": "V. Experiments"}, {"figure_path": "2410.13925/charts/charts_12_0.png", "caption": "Fig. 10: Comparision of FID and CLIP-L score across different CFG scales for two text-to-image models: FiTv2-XL/2 and SiT-XL/2. FiTv2-XL/2 significantly outperforms SiT-XL/2 in terms of FID score and CLIP-L score.", "description": "The chart compares the FID and CLIP-L scores of FiTv2-XL/2 and SiT-XL/2 models at various classifier-free guidance (CFG) scales for text-to-image generation.", "section": "VI. EXPERIMENTS"}]