{"references": [{" publication_date": "2017", "fullname_first_author": "Angela Dai", "paper_title": "ScanNet: Richly-Annotated 3D Reconstructions of Indoor Scenes", "reason": "This paper introduced ScanNet, a widely used benchmark dataset for indoor 3D scene understanding.  Its comprehensive annotations and large scale (1513 scans) make it a crucial foundation for evaluating many 3D semantic segmentation models and techniques.  The current research builds upon the ScanNet dataset to evaluate the performance of models trained on their newly generated ARKit LabelMaker dataset, making it a critically important reference.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Angela Dai", "paper_title": "ScanNet: Richly-Annotated 3D Reconstructions of Indoor Scenes", "reason": "ScanNet is a foundational dataset for 3D scene understanding, providing a benchmark for evaluating the performance of various models.  The current work directly compares the performance of models trained with its ARKitScenes LabelMaker dataset against models trained on ScanNet, highlighting its importance as a standard.", "section_number": 4}, {" publication_date": "2017", "fullname_first_author": "Iro Armeni", "paper_title": "3D Semantic Parsing of Large-Scale Indoor Spaces", "reason": "This paper introduced the Stanford 3D Indoor Spaces (S3DIS) dataset, which is one of the most popular and widely used datasets for 3D indoor semantic segmentation.  The fact that the authors' dataset is compared against this dataset highlights the relative importance of the S3DIS dataset as a benchmark dataset for this area of research.", "section_number": 2}, {" publication_date": "2018", "fullname_first_author": "Binh-Son Hua", "paper_title": "Point-wise Convolutional Neural Network", "reason": "Point-wise Convolutional Neural Networks (PointCNNs) represent an important class of 3D semantic segmentation models, enabling operations directly on point clouds.  This paper introduces the PointCNN architecture, which is a key component in understanding the landscape of related works in 3D semantic segmentation and forms part of the context for the current study.", "section_number": 2}, {" publication_date": "2018", "fullname_first_author": "Loic Landrieu", "paper_title": "Large-scale Point Cloud Semantic Segmentation with Superpoint Graphs", "reason": "This work significantly advanced the field of large-scale point cloud semantic segmentation by introducing superpoint graphs.  This model is cited because of its relevance to the authors' focus on large-scale dataset, and its use in this context reflects the overall trend in 3D scene understanding towards handling large-scale data.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "Christopher Choy", "paper_title": "4D Spatio-Temporal ConvNets: Minkowski Convolutional Neural Networks", "reason": "This work introduced Minkowski Convolutional Neural Networks (MinkowskiNet), a highly influential architecture for 3D semantic segmentation.  MinkowskiNet forms the basis of one of the core models used in the current study, which makes the reference critical for understanding the context and significance of the experimental methodology.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "Hugues Thomas", "paper_title": "KPConv: Flexible and Deformable Convolution for Point Clouds", "reason": "The paper introduced KPConv, a significant advancement in point cloud processing, focusing on efficient and flexible convolution operations. This is a key component in the field of 3D semantic segmentation and its mention highlights that this is one of the core models used in this research area.", "section_number": 2}, {" publication_date": "2019", "fullname_first_author": "Julian Straub", "paper_title": "The Replica dataset: A digital replica of indoor spaces", "reason": "This work presented the Replica dataset, a high-quality 3D scene dataset which is useful for studying indoor scenes, and as a result, is compared to the authors' own dataset.  Its inclusion is important because it helps contextualize the scale and quality of the authors’ dataset in relation to existing work.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Gilad Baruch", "paper_title": "Arkitscenes: A diverse real-world dataset for 3d indoor scene understanding using mobile rgb-d data", "reason": "This paper introduced the ARKitScenes dataset, which serves as the foundation for the current research's large-scale 3D semantic segmentation dataset.  ARKitScenes provides the underlying data for the dataset creation in the current work, and this is one of the most important aspects of the study.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Alexey Nekrasov", "paper_title": "Mix3D: Out-of-Context Data Augmentation for 3D Scenes", "reason": "This paper proposed Mix3D, a data augmentation technique for 3D semantic segmentation.  The authors compare the performance of their dataset against models using Mix3D augmentation, highlighting its relevance as a state-of-the-art method in the field and illustrating a core comparison point used in the current work.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Xin Lai", "paper_title": "Stratified Transformer for 3D Point Cloud Segmentation", "reason": "This work introduced the Stratified Transformer, a significant advancement in 3D point cloud segmentation models.  The fact that this model is mentioned and compared to highlights its importance in establishing the context of 3D semantic segmentation models in relation to the authors' work.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "David Rozenberszki", "paper_title": "Language-Grounded Indoor 3D Semantic Segmentation in the Wild", "reason": "This paper introduced a significant dataset for the study of 3D semantic segmentation.  The use of this dataset enables the comparison of the authors' approach to state-of-the-art models and establishes an important benchmark dataset for this research area.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Robin Rombach", "paper_title": "High-resolution image synthesis with latent diffusion models", "reason": "This paper introduced high-resolution image synthesis using latent diffusion models, highlighting significant advancements in 2D image generation. The introduction contrasts the success in 2D image generation with the challenges faced in 3D scene understanding, providing crucial context for the motivation of this research.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Alexander Kirillov", "paper_title": "Segment anything", "reason": "This paper introduced the Segment Anything Model (SAM), a powerful 2D segmentation model that has been integrated into the improved LabelMaker pipeline.  Its integration is a key element of the proposed methodology, which directly improves the quality of the annotations generated and is thus a very important contribution to this work.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Shilong Liu", "paper_title": "Grounding dino: Marrying dino with grounded pre-training for open-set object detection", "reason": "This paper introduced the Grounding DINO model, which is a crucial component of the Grounded-SAM model used in the LabelMakerV2 pipeline. This improves the quality of annotations significantly, so this work is highly relevant to the methodology.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Alexey Nekrasov", "paper_title": "Mix3D: Out-of-Context Data Augmentation for 3D Scenes", "reason": "Mix3D is a data augmentation technique used for comparison in evaluating the proposed dataset's effectiveness in improving the performance of semantic segmentation models.  The comparison to this widely used method helps establish the relative performance gain achieved using the newly introduced dataset.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Li Jiang", "paper_title": "Self-supervised pre-training with masked shape prediction for 3d scene understanding", "reason": "This paper explores self-supervised pre-training for 3D scene understanding, providing an alternative approach to the supervised method used by the authors.  The comparison highlights that the authors' large-scale, automatically generated, real-world dataset significantly outperforms this method. This contrast demonstrates the power of large-scale, directly supervised learning with real-world data.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Xiaoyang Wu", "paper_title": "Point transformer v3: Simpler, faster, stronger", "reason": "This work presents Point Transformer V3 (PTv3), a state-of-the-art 3D semantic segmentation model, which is used as a baseline for evaluating the proposed dataset. The use of this model underscores its importance in the field and provides a strong benchmark for comparing the effectiveness of the new dataset.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Silvan Weder", "paper_title": "LabelMaker: Automatic Semantic Label Generation from RGB-D Trajectories", "reason": "This paper introduced the original LabelMaker pipeline, which is then extended and improved upon in the current work.  The current work builds directly upon this earlier work, extending its capabilities and significantly expanding its scope, highlighting its foundational role in this work.", "section_number": 2}]}