[{"figure_path": "2410.18975/figures/figures_1_0.png", "caption": "Figure 1: An example of UNBOUNDED. We follow the life of Archibus, the user's custom wizard character. The user can interact with the generative game using natural language, and Archibus' hunger, energy and fun meters update accordingly. A spontaneous and unconstrained story unfolds while the user playing, and the character can explore new environments with a myriad of possible actions and unexpected interactions. The game runs in interactive speeds, refreshing every second.", "description": "The figure shows a screenshot sequence illustrating UNBOUNDED's gameplay loop, where a user interacts with a virtual wizard character using natural language, leading to dynamic story progression and visual changes reflecting character's changing states.", "section": "ABSTRACT"}, {"figure_path": "2410.18975/figures/figures_3_0.png", "caption": "Figure 2: Example of UNBOUNDED. Based on an initial user input, UNBOUNDED sets up game simulation environments, and generates character actions in the environments. Users can interact with the character with natural language instructions, exploring the game with unlimited options.", "description": "Figure 2 shows an example of UNBOUNDED, illustrating how user instructions trigger game events and character actions within dynamically generated environments.", "section": "1 Introduction"}, {"figure_path": "2410.18975/figures/figures_4_0.png", "caption": "Figure 3: Generative game examples of UNBOUNDED. The user can insert a custom character into the game, engage with the character through natural language instructions, bring the character to different environments, and interact with it to maintain a healthy state under the games' mechanics.", "description": "Figure 3 shows various examples of UNBOUNDED showcasing different characters in diverse environments generated through natural language instructions.", "section": "3 METHOD"}, {"figure_path": "2410.18975/figures/figures_5_0.png", "caption": "Figure 4: (a) Our overall image generation method. We achieve real-time image generation with LCM LORA, maintain character consistency with DreamBooth LoRAs, and introduce a regional IP-Adapter (shown in (c)) for improved environment and character consistency. (b) Our proposed dynamic mask genreation separating the environment and character conditioning, preventing interference between the two.", "description": "Figure 4 illustrates the overall image generation method of UNBOUNDED, highlighting the use of LCM LoRA, DreamBooth LoRAs, and a regional IP-Adapter with a dynamic mask to achieve real-time generation while maintaining character and environment consistency.", "section": "3.2 REGIONAL IP-ADAPTER WITH BLOCK DROP FOR ENVIRONMENT CONSISTENCY"}, {"figure_path": "2410.18975/figures/figures_7_0.png", "caption": "Figure 6: Overview of our user-simulation data collection process for LLM distillation. (a) We begin by collecting diverse topic and character data, filtered using ROUGE-L for diversity. (b) The World LLM and User LLM interact to generate user-simulation data through multi-round exchanges.", "description": "The figure illustrates the two-stage process of collecting user-simulation data for LLM distillation, involving topic and character data collection and user-LLM interaction with the world-LLM.", "section": "3.3.2 FRAMEWORK FOR SMALL LLM DISTILLATION"}]