{"references": [{" publication_date": "1986", "fullname_first_author": "James P. Carse", "paper_title": "Finite and Infinite Games: A Vision of Life as Play and Possibility", "reason": "This book introduces the fundamental concepts of finite and infinite games, which provides the theoretical framework for the entire research.  The distinction between finite and infinite games is central to understanding UNBOUNDED's design philosophy and the novelty of its approach, creating a generative infinite game as opposed to a finite one with pre-defined rules and boundaries. The authors' argument builds directly upon Carse's work, making this a foundational reference for the paper.", "section_number": 1}, {" publication_date": "2020", "fullname_first_author": "Tom B Brown", "paper_title": "Language models are few-shot learners", "reason": "This paper introduces the concept of few-shot learning in large language models. The capabilities of LLMs to learn from only a few examples are crucial for the dynamic generation of game mechanics, narratives, and character interactions, as UNBOUNDED's specialized LLM effectively learns real-time game interactions from relatively limited data.  This work establishes the foundational abilities of LLMs on which the UNBOUNDED system relies.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Mathilde Caron", "paper_title": "Emerging properties in self-supervised vision transformers", "reason": "This paper introduces DINO, a self-supervised learning method for vision transformers, which UNBOUNDED uses for image similarity assessment in evaluating image generation. This technique plays a critical role in quantifying the consistency of character and environment generation and evaluating UNBOUNDED's performance relative to other state-of-the-art methods. The quantitative results heavily rely on the comparison with DINO, underscoring its significance.", "section_number": 5}, {" publication_date": "2021", "fullname_first_author": "Alec Radford", "paper_title": "Learning transferable visual models from natural language supervision", "reason": "This paper introduces CLIP, which is fundamentally used in UNBOUNDED for evaluating the semantic alignment of generated images with text prompts.  CLIP is central to evaluating whether the generated visuals accurately reflect the textual instructions given to the system, and is a primary metric in the quantitative analysis comparing UNBOUNDED with other methods.  The results heavily depend on the accuracy and reliability of CLIP.", "section_number": 5}, {" publication_date": "2023", "fullname_first_author": "Stephanie Fu", "paper_title": "Dreamsim: Learning new dimensions of human visual similarity using synthetic data", "reason": "This paper introduces DreamSim, a metric used for measuring the visual similarity between images in UNBOUNDED's evaluation.  DreamSim provides another aspect of visual consistency assessment in addition to CLIP and DINO, which enhances the completeness of the quantitative analysis.  DreamSim's role is key in evaluating the character consistency and environment consistency of the generated images.", "section_number": 5}, {" publication_date": "2022", "fullname_first_author": "Rinon Gal", "paper_title": "An image is worth one word: Personalizing text-to-image generation using textual inversion", "reason": "This paper introduces Textual Inversion, a technique used to personalize text-to-image generation models. The approach relates to UNBOUNDED's character personalization using DreamBooth, and shows a previous step of using textual descriptions for image customization. While not directly used, this work showcases the related field of personalized image generation, which is relevant to understanding the context and related works in the paper.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Yuan Gong", "paper_title": "Talecrafter: Interactive story visualization with multiple characters", "reason": "Talecrafter is another relevant work on interactive storytelling, offering additional background information to enhance the explanation of UNBOUNDED's design decisions in relation to prior research within the domain. Although not directly compared, Talecrafter's features illustrate what related work has been done within interactive story generation with multiple characters.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Edward J Hu", "paper_title": "Lora: Low-rank adaptation of large language models", "reason": "This paper introduces LoRA, a technique for efficient fine-tuning of large language models.  UNBOUNDED leverages LoRA for customizing the base diffusion model with character-specific information, improving efficiency without needing to retrain the entire model from scratch. LoRA is central to maintaining the fast inference speed necessary for real-time game interaction.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Nupur Kumari", "paper_title": "Multi-concept customization of text-to-image diffusion", "reason": "This paper presents a method for multi-concept customization in text-to-image diffusion, related to UNBOUNDED's approach of conditioning on both characters and environments. It provides more context in the related work for customizing image generation, showcasing a similar goal of controlling different aspects within a single image but through a different approach.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Yuheng Li", "paper_title": "Gligen: Open-set grounded text-to-image generation", "reason": "This paper presents GLIGEN, a method for generating open-set grounded images from text, showcasing a related approach to UNBOUNDED's method of generating images conditioned on both characters and environments.  It provides valuable context within the related work for open-ended text-to-image generation, especially considering the open-ended nature of UNBOUNDED's gameplay.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Zhen Li", "paper_title": "Photomaker: Customizing realistic human photos via stacked id embedding", "reason": "This paper introduces Photomaker, a method that enhances the consistency of generating human faces across different images. UNBOUNDED's focus on character consistency aligns closely with the challenges addressed by Photomaker, demonstrating a related area of research within visual generation and highlighting the importance of ensuring character consistency in interactive applications.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Shilong Liu", "paper_title": "Grounding dino: Marrying dino with grounded pre-training for open-set object detection", "reason": "This paper introduces Grounding-DINO, a method for detecting objects in images. This is used in UNBOUNDED's evaluation to ensure the presence of the character within the generated image. This metric is crucial for evaluating visual consistency and addresses a key requirement of UNBOUNDED's gameplay, guaranteeing the character appears in the scene.", "section_number": 5}, {" publication_date": "2016", "fullname_first_author": "Ilya Loshchilov", "paper_title": "Sgdr: Stochastic gradient descent with warm restarts", "reason": "This paper introduces the concept of warm restarts within stochastic gradient descent. This optimization technique is directly used during the training of UNBOUNDED's distilled LLM.  The use of a cosine annealing learning rate scheduler in UNBOUNDED shows a clear application of this technique, contributing to its successful and efficient training of the smaller, faster LLM for real-time performance.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Andreas Lugmayr", "paper_title": "Repaint: Inpainting using denoising diffusion probabilistic models", "reason": "Repaint is a relevant work on image inpainting that provides context to UNBOUNDED's approach of generating consistent character and environmental visuals, particularly addressing the challenges of image reconstruction and consistency. Understanding the state-of-the-art in image inpainting helps understand the novelty of the proposed image generation techniques in UNBOUNDED.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Simian Luo", "paper_title": "Latent consistency models: Synthesizing high-resolution images with few-step inference", "reason": "This paper introduces Latent Consistency Models (LCMs), which are central to UNBOUNDED's ability to achieve real-time image generation. By using LCMs, UNBOUNDED is able to generate high-resolution images with only two diffusion steps, which is crucial for achieving the desired real-time interactivity of the game.  The efficiency of LCMs significantly influences UNBOUNDED's performance and is therefore crucial to the overall system.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Dustin Podell", "paper_title": "Sdxl: Improving latent diffusion models for high-resolution image synthesis", "reason": "This paper introduces SDXL, the underlying diffusion model used in UNBOUNDED for image generation. The choice of SDXL is important because it directly affects the quality and efficiency of image generation, particularly the speed and visual consistency of the output images. The choice of SDXL is a key technical decision that directly impacts the success of UNBOUNDED.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Nataniel Ruiz", "paper_title": "Dreambooth: Fine tuning text-to-image diffusion models for subject-driven generation", "reason": "This paper introduces DreamBooth, which is used in UNBOUNDED for character personalization. DreamBooth is directly applied for creating consistent character appearances across different game scenarios.  This technique's effectiveness significantly influences the quality and consistency of character representation, a crucial component of UNBOUNDED's gameplay.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "Gyungin Shin", "paper_title": "Reco: Retrieve and co-segment for zero-shot transfer", "reason": "Reco is a method related to UNBOUNDED's regional IP-adapter in conditioning the image generation.  This paper presents a way of conditioning text and image together, which provides insights into the related methods used in UNBOUNDED and helps explain the design decisions made in the IP-adapter module.  It contextualizes the technical approach and the challenges in aligning text and image generation in UNBOUNDED.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Gemma Team", "paper_title": "Gemma: Open models based on gemini research and technology", "reason": "This paper introduces Gemma-2B, the base LLM on which the UNBOUNDED game engine is built upon after distillation. The use of Gemma-2B is a key technical decision that directly influences the speed, performance, and scalability of the language model.  The choice of the LLM significantly affects UNBOUNDED's ability to process real-time interactions and generate dynamic content efficiently.", "section_number": 3}]}