[{"figure_path": "2410.15002/charts/charts_8_0.png", "caption": "Figure 5: Human Face and Art Style imitation graphs for SD1.1 using the Celebrities and Classical art style sets. The x-axis is the sorted image frequencies in the training dataset, and the y-axis is the imitation score (averaged over the five image generation prompts) for each concept, sorted in increasing order of frequency. Concepts with zero image frequencies are shaded with light gray. We show the mean imitation score and its variance over the five image generation prompts. The red vertical line indicates the imitation threshold found by the change detection algorithm, and the horizontal green line represents the average imitation scores before and after the threshold.", "description": "The chart displays the relationship between the frequency of concepts (human faces and art styles) in the training dataset and the model's ability to imitate them, highlighting the imitation threshold identified by the change detection algorithm.", "section": "Results: The Imitation Threshold"}, {"figure_path": "2410.15002/charts/charts_20_0.png", "caption": "Figure 7: Average cosine similarity between the faces of the same people (blue colored) and of the faces of different people (red colored), measured across the reference images of the celebrities.", "description": "The histogram shows the distribution of average cosine similarity scores between face embeddings of the same person and different persons, used to determine the threshold for filtering images.", "section": "5.2 COMPUTING IMITATION SCORE"}, {"figure_path": "2410.15002/charts/charts_21_0.png", "caption": "Figure 9: The first filtering step involves determining the threshold to distinguish between art and non-art images from the pretraining images, for which we compare the similarity of the image's embedding to the embedding of the text \"an artwork\".", "description": "The chart displays histograms showing the distribution of cosine similarity scores between image embeddings and the text embedding of \"an artwork\", for both art and non-art images, used to determine the threshold for filtering non-art images from the pretraining dataset.", "section": "5.1 CONCEPT FREQUENCY"}, {"figure_path": "2410.15002/charts/charts_22_0.png", "caption": "Figure 12: The second filtering step involves determining the if an art work whose caption mentions an artist actually belongs to that artist or not.", "description": "The histogram shows the average cosine similarity between embeddings of art images of the same artist and art images of different artists for classical and modern artists.", "section": "5.2 COMPUTING IMITATION SCORE"}, {"figure_path": "2410.15002/charts/charts_22_1.png", "caption": "Figure 12: The second filtering step involves determining the if an art work whose caption mentions an artist actually belongs to that artist or not.", "description": "The figure shows the histograms of average cosine similarity between embeddings of images of the same artist and images of different artists for classical and modern artists, used to determine a threshold for filtering art images.", "section": "5.2 COMPUTING IMITATION SCORE"}, {"figure_path": "2410.15002/charts/charts_29_0.png", "caption": "Figure 33: False-match rate (FMR) of all the face embedding models across the six demographic groups. Amazon Rekognition and InsightFace have the lowest FMR values. Moreover, these two models have lowest disparity of FMR over the demographic groups.", "description": "The chart displays the false-match rates of eight different face recognition models across six demographic groups, showing that Amazon Rekognition and InsightFace have the lowest false-match rates and lowest disparity across groups.", "section": "K ABLATION EXPERIMENT WITH DIFFERENT FACE EMBEDDING MODELS"}, {"figure_path": "2410.15002/charts/charts_30_0.png", "caption": "Figure 34: True-match rate (TMR) of all the face embedding models across the six demographic groups. Amazon Rekognition model has the highest TMR values.", "description": "The chart displays the true-match rate (TMR) for six demographic groups across eight different face embedding models.", "section": "K ABLATION EXPERIMENT WITH DIFFERENT FACE EMBEDDING MODELS"}]