{"references": [{" publication_date": "2022", "fullname_first_author": "Christoph Schuhmann", "paper_title": "LAION-5B: An open large-scale dataset for training next generation image-text models", "reason": "This paper is foundational as it describes the LAION-5B dataset, a massive resource used to train many of the text-to-image models discussed in the paper.  The dataset's size and composition directly impact the likelihood of copyrighted material being included, which is a key factor in the imitation problem studied. The scale of LAION-5B underscores the challenges related to data curation and ethical considerations in training AI models.", "section_number": 1}, {" publication_date": "2023a", "fullname_first_author": "Gowthami Somepalli", "paper_title": "Diffusion art or digital forgery? investigating data replication in diffusion models", "reason": "This paper is highly relevant as it directly addresses the phenomenon of imitation in diffusion models. It demonstrates the ability of these models to memorize and reproduce images from their training data, highlighting the core issue investigated in the current paper.  The findings provide empirical evidence of the imitation problem, which is central to the current study's focus.", "section_number": 1}, {" publication_date": "2023a", "fullname_first_author": "Nicholas Carlini", "paper_title": "Extracting training data from diffusion models", "reason": "This paper is crucial as it demonstrates the ability to extract training data from diffusion models.  This reinforces the core concern of the current paper—that models can memorize and reproduce images from their training data—and provides further evidence of the ethical and legal issues associated with this behavior.  Understanding data extraction methods is essential for assessing and mitigating the risks of imitation.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Abeba Birhane", "paper_title": "Multimodal datasets: misogyny, pornography, and malignant stereotypes", "reason": "This paper highlights the potential biases and ethical concerns associated with large-scale datasets used for training AI models. This context is highly relevant to the current paper as it directly addresses the concerns about the presence of copyrighted and potentially offensive content within the datasets used for text-to-image generation.  The ethical implications of using such datasets underpin the problem of imitation and the need for defining the imitation threshold.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Joseph Saveri", "paper_title": "Stable diffusion litigation", "reason": "This reference is critical as it highlights the significant legal implications of imitation in text-to-image models. The lawsuit against Stability AI underscores the practical consequences of copyright infringement and the need for clearly defined guidelines regarding the use of training data and the resulting output of these models.  It emphasizes the real-world importance of addressing the problem that this paper investigates.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Aditya Ramesh", "paper_title": "Zero-shot text-to-image generation", "reason": "This paper is foundational as it describes the significant advancements in zero-shot text-to-image generation, a capability that directly relates to the core challenge in the current research.  The successful zero-shot generation highlights the power of large-scale datasets, but also underscores the increased likelihood of imitation due to the potential for models to learn and reproduce aspects from their training data.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Robin Rombach", "paper_title": "High-resolution image synthesis with latent diffusion models", "reason": "This paper is important as it details the architecture and workings of Stable Diffusion models, which are central to this paper's experimental setup. Understanding the underlying mechanisms of these models is crucial for understanding the processes that lead to image imitation, and for developing appropriate methods to measure and mitigate it.  The specifics of the architecture are highly relevant to assessing the imitation threshold.", "section_number": 2}, {" publication_date": "2015", "fullname_first_author": "Jascha Sohl-Dickstein", "paper_title": "Deep unsupervised learning using nonequilibrium thermodynamics", "reason": "This paper is important as it describes the foundational work on diffusion models, a key technology used in modern text-to-image synthesis. The paper's contribution to the development of diffusion models directly connects to the core technology driving the issue of imitation, providing valuable context for understanding the imitation mechanisms discussed in the current study.", "section_number": 2}, {" publication_date": "2009", "fullname_first_author": "Judea Pearl", "paper_title": "Causality", "reason": "This book is a seminal work on causality and provides the theoretical foundation for many approaches to causal inference, including those that may be adapted to study the imitation phenomenon in text-to-image models. The authors' approach to solving the imitation threshold problem implicitly uses causal inference, and this book provides the underlying theoretical framework.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "Gerrit J. J. van den Burg", "paper_title": "An evaluation of change point detection algorithms", "reason": "This paper is important because the authors use a change detection algorithm (PELT) to determine the imitation threshold in their proposed methodology.  Understanding the characteristics of this algorithm is crucial for correctly interpreting the results, assessing the validity of their approach, and appreciating its advantages and potential limitations.", "section_number": 5}, {" publication_date": "2018", "fullname_first_author": "Mehdi S. M. Sajjadi", "paper_title": "Assessing generative models via precision and recall", "reason": "This paper discusses metrics for evaluating generative models.  While not directly used in the current study's core methodology, these metrics provide a broader context for understanding the challenges in evaluating image similarity, which is a key component of the proposed MIMETIC2 methodology.  The discussion of these metrics is relevant for appreciating the challenges in designing appropriate evaluation metrics for this task.", "section_number": 5}, {" publication_date": "2022", "fullname_first_author": "Gowthami Somepalli", "paper_title": "Understanding and mitigating copying in diffusion models", "reason": "This paper directly addresses the issue of imitation in diffusion models and proposes mitigation strategies. This is directly relevant to the current paper as it provides further context on the problem of imitation and highlights various approaches to addressing this challenge. The understanding of mitigation techniques further contextualizes the importance of defining an imitation threshold.", "section_number": 7}, {" publication_date": "2020", "fullname_first_author": "Shawn Shan", "paper_title": "Fawkes: protecting privacy against unauthorized deep learning models", "reason": "This paper focuses on protecting privacy by adding noise to training images to hinder the ability of models to learn personal details from training data.  The methods presented in this paper are relevant to mitigating the imitation problem, demonstrating that data manipulation can significantly impact model behavior. The approach is also relevant as it demonstrates the importance of addressing privacy concerns in the context of AI model training and deployment.", "section_number": 7}, {" publication_date": "2024", "fullname_first_author": "Vishaal Udandarao", "paper_title": "No \"zero-shot\" without exponential data: Pretraining concept frequency determines multimodal model performance", "reason": "This paper demonstrates that performance of a model is highly related to concept frequency in the training data.  This directly supports the core idea of the current paper, that there is a relationship between concept frequency in training data and the ability of the model to imitate that concept.  The findings contribute to theoretical underpinnings for the research.", "section_number": 7}, {" publication_date": "2023", "fullname_first_author": "Stephen Casper", "paper_title": "Measuring the success of diffusion models at imitating human artists", "reason": "This paper demonstrates that diffusion models can imitate the styles of artists, further highlighting the core problem of imitation investigated in this study. The findings provide more empirical evidence of the imitation capability of these models and the potential legal and ethical challenges associated with this capability. The paper highlights specific implications related to art and copyright.", "section_number": 7}, {" publication_date": "2023", "fullname_first_author": "Harry H. Jiang", "paper_title": "Ai art and its impact on artists", "reason": "This paper examines the impact of AI-generated art on human artists, directly addressing the ethical and societal implications of imitation in text-to-image models. The legal and ethical challenges surrounding copyright infringement are critically relevant to the problem investigated in this paper, further emphasizing its importance.", "section_number": 7}, {" publication_date": "2023", "fullname_first_author": "Viktor Lakic", "paper_title": "Link-rot in web-sourced multimedia datasets", "reason": "This paper addresses the challenges of using web-scraped data for training AI models.  The issue of 'link rot'—where URLs become invalid over time—is directly relevant to the datasets often used to train text-to-image models. The paper highlights the practical challenges associated with data collection and maintenance, impacting data quality and reliability, which indirectly impacts the assessment of an imitation threshold.", "section_number": 7}, {" publication_date": "2024", "fullname_first_author": "Gowthami Somepalli", "paper_title": "Measuring style similarity in diffusion models", "reason": "This paper focuses on measuring style similarity in diffusion models, providing essential context to the current study.  The methods for measuring similarity in art styles are directly relevant to the methods used for evaluating the imitation score in the proposed MIMETIC2 methodology. The paper contributes to a better understanding of how to quantify artistic style and its similarity, a core aspect in evaluating imitation of art styles.", "section_number": 7}, {" publication_date": "2024", "fullname_first_author": "Yanai Elazar", "paper_title": "What's in my big data?", "reason": "This paper discusses methods for analyzing large datasets used in AI model training.  Understanding how to analyze the datasets for concept frequency, identify potential biases, and mitigate the impact of noise are all relevant to the current paper's approach, MIMETIC2. The techniques and observations discussed in this paper provide a valuable context for the methodology used in this study.", "section_number": 7}]}