[{"figure_path": "2410.14940/tables/table_16_0.html", "caption": "Table 1: The absolute percentage increase in Pass Rate (PR) across various internal capability evaluation sets after optimization with Baichuan Alignment. The abbreviations of 'IF', 'IP', 'FC', 'KQA' denote the Instruction Follow, Information Processing, Function Call, Knowledge Question Answer, respectively", "description": "Table 1 shows the absolute percentage increase in the Pass Rate across various internal capability evaluation sets after optimization with Baichuan Alignment.", "section": "5.1.2 Result and Discussion"}, {"figure_path": "2410.14940/tables/table_17_0.html", "caption": "Table 2: Comparison of Qwen2-Nova-72B with Other Models.: based on the same base model. underlined: results that were not found publicly and are derived from our own testing.", "description": "The table compares the performance of Qwen2-Nova-72B against other models across several open-source benchmarks.", "section": "5.2 Major Results and Discussion"}, {"figure_path": "2410.14940/tables/table_17_1.html", "caption": "Table 3: Comparison of Llama3-PBM-Nova-70B with Others.: based on the same base model. underlined: results that were not found publicly and are derived from our own testing.", "description": "Table 3 compares the performance of Llama3-PBM-Nova-70B against other models across several open-source benchmarks.", "section": "5.2 Open-Source Benchmarks"}, {"figure_path": "2410.14940/tables/table_18_0.html", "caption": "Table 4: The evaluation results of LLMs on CFBench and its splits.", "description": "The table presents a comprehensive evaluation of LLMs' constraint-following proficiency across three difficulty levels (Easy, Hard, Full) using three key metrics (CSR, ISR, PSR) on the CFBench benchmark.", "section": "5.3.1 CFBench"}, {"figure_path": "2410.14940/tables/table_19_0.html", "caption": "Table 5: The CSR score, an core evaluation metric in SysBench, is shown under various constraints.", "description": "The table compares the Constraint Satisfaction Rate (CSR) of several leading LLMs across different constraint types in the SysBench benchmark.", "section": "5.3.2 SysBench"}, {"figure_path": "2410.14940/tables/table_20_0.html", "caption": "Table 6: The evaluation results of LLMs on FB-Bench.", "description": "Table 6 presents the subset evaluation results of leading LLMs in FB-Bench, showing their performance in error correction and response maintenance.", "section": "5.3.3 FB-Bench"}, {"figure_path": "2410.14940/tables/table_24_0.html", "caption": "Table 2: Comparison of Qwen2-Nova-72B with Other Models.: based on the same base model.", "description": "Table 2 presents a comparative analysis of Qwen2-Nova-72B against other models across several authoritative open-source benchmarks, showing its superior performance compared to its base model and other LLMs.", "section": "5.2 Major Results and Discussion"}, {"figure_path": "2410.14940/tables/table_26_0.html", "caption": "Table 2: Comparison of Qwen2-Nova-72B with Other Models.: based on the same base model. underlined: results that were not found publicly and are derived from our own testing.", "description": "Table 2 presents a comparative analysis of Qwen2-Nova-72B against other models across several authoritative open-source benchmarks, showing its performance improvements compared to its base model and other leading LLMs.", "section": "5.2 Open-Source Benchmarks"}]