{"references": [{" publication_date": "2024", "fullname_first_author": "Bang An", "paper_title": "WAVES: Benchmarking the robustness of image watermarks", "reason": "This paper introduces WAVES, the first comprehensive benchmark for evaluating deep learning-based watermarking methods against image manipulations driven by large-scale generative models. While limited in scope compared to W-Bench, its introduction highlights the growing need for robust watermarking in the face of advanced image editing techniques.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Yoshua Bengio", "paper_title": "Estimating or propagating gradients through stochastic neurons for conditional computation", "reason": "This paper introduces the concept of estimating or propagating gradients through stochastic neurons, a technique relevant to training deep learning models with complex components like diffusion models used in image editing.  The straight-through estimator, based on this concept, is used in VINE for backpropagation through image editing models, making it a key influence on the method's implementation.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Andreas Blattmann", "paper_title": "Stable video diffusion: Scaling latent video diffusion models to large datasets", "reason": "This paper introduces Stable Video Diffusion, a method for generating high-quality videos.  The paper's focus on video generation makes it relevant to the Image-to-Video Generation aspect of W-Bench, where Stable Video Diffusion is used as one of the image editing models in the benchmark's evaluation.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Tim Brooks", "paper_title": "Instructpix2pix: Learning to follow image editing instructions", "reason": "This paper introduces InstructPix2Pix, a powerful image editing model used in W-Bench's evaluation.  InstructPix2Pix is particularly relevant as it represents the state-of-the-art in global image editing, which poses a significant challenge to watermark robustness. It is also used in the fine-tuning stage of VINE.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Tu Bui", "paper_title": "Trustmark: Universal watermarking for arbitrary resolution images", "reason": "This paper introduces TrustMark, a watermarking method that is evaluated in W-Bench.  TrustMark's performance is compared against VINE, highlighting the advancements made in terms of robustness and image quality. The method is also used to demonstrate resolution scaling in the paper.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Huiwen Chang", "paper_title": "Muse: Text-to-image generation via masked generative transformers", "reason": "This paper introduces MUSE, a text-to-image generation model. While not directly used in the benchmark, it represents a key advancement in the field of text-to-image generation models.  These models are fundamental to the image editing techniques considered in the paper, which makes this paper highly relevant to understanding the context of the research.", "section_number": 2}, {" publication_date": "2007", "fullname_first_author": "Ali Al-Haj", "paper_title": "Combined dwt-dct digital image watermarking", "reason": "This paper presents a classical watermarking method that uses Discrete Wavelet Transform (DWT) and Discrete Cosine Transform (DCT). This method serves as a baseline in W-Bench, allowing for a comparison with modern deep learning-based techniques. Its inclusion demonstrates the evolution of watermarking technology and helps establish a baseline for evaluating the effectiveness of modern techniques.", "section_number": 2}, {" publication_date": "2007", "fullname_first_author": "Ingemar Cox", "paper_title": "Digital watermarking and steganography", "reason": "This is a foundational textbook in the field of digital watermarking and steganography.  It provides a comprehensive overview of fundamental concepts, techniques, and applications.  It serves as a valuable background resource for understanding the broader context of watermarking research and the challenges addressed by this paper.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Han Fang", "paper_title": "Flow-based robust watermarking with invertible noise layer for black-box distortions", "reason": "This paper introduces a watermarking method that is robust to black-box distortions. The method is included in the W-Bench evaluation and is compared to VINE, highlighting the differences in performance. It also provides insights into existing robust watermarking techniques and their limitations.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Pierre Fernandez", "paper_title": "Watermarking images in self-supervised latent spaces", "reason": "This paper explores watermarking techniques in self-supervised latent spaces.  The techniques used are included in W-Bench's comparative analysis, offering a baseline for measuring the improvements made by VINE.  It further reflects the exploration of different watermarking approaches and their relative strengths and weaknesses.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Tim Brooks", "paper_title": "Instructpix2pix: Learning to follow image editing instructions", "reason": "This paper is highly relevant because InstructPix2Pix is used extensively in the experimental evaluation of W-Bench and as a key component in the fine-tuning process of VINE.  InstructPix2Pix's role as a leading image editing model highlights the challenging nature of robust watermarking against advanced image editing techniques.", "section_number": 4}, {" publication_date": "2020", "fullname_first_author": "Matthew Tancik", "paper_title": "Stegastamp: Invisible hyperlinks in physical photographs", "reason": "This paper presents StegaStamp, a watermarking technique that is evaluated in W-Bench.  StegaStamp is significant because it serves as one of the top-performing methods, offering a strong baseline for comparison against VINE.  It showcases existing approaches and their relative strengths and weaknesses.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Jonathan Ho", "paper_title": "Denoising diffusion probabilistic models", "reason": "This paper introduces denoising diffusion probabilistic models (DDPMs), which are the foundation of many modern generative models.  Its importance stems from the fact that DDPMs are used extensively in modern image editing techniques, making it essential to understanding the context of this paper's work on robust watermarking.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "Robin Rombach", "paper_title": "High-resolution image synthesis with latent diffusion models", "reason": "This paper introduces high-resolution image synthesis using latent diffusion models.  Its significance lies in the fact that it's a key technology underlying many of the advanced image editing techniques that are tested against in this paper's benchmark. Understanding these models is critical for comprehending the challenges faced by watermarking methods.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Chitwan Saharia", "paper_title": "Photorealistic text-to-image diffusion models with deep language understanding", "reason": "This paper introduces a photorealistic text-to-image diffusion model.  Similar to other text-to-image models, it's fundamental to many advanced image editing techniques. It's crucial for understanding the context of the research and the challenges presented by state-of-the-art image editing capabilities.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Xuanyu Zhang", "paper_title": "EditGuard: Versatile image watermarking for tamper localization and copyright protection", "reason": "This paper introduces EditGuard, a recently proposed watermarking method that is designed to be robust to image editing.  EditGuard is a strong contender in the field of robust watermarking and is specifically compared with VINE, making this paper vital for showcasing the relative performance of different methods and understanding the current state-of-the-art.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Zhuang Liu", "paper_title": "A convnet for the 2020s", "reason": "This paper introduces ConvNeXt, a powerful convolutional neural network architecture used in the decoder part of VINE. ConvNeXt's strong performance in image classification and other computer vision tasks makes it a suitable choice for watermark decoding, showcasing the importance of the architectural design choices in VINE's success.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Alina Kuznetsova", "paper_title": "The open images dataset v4: Unified image classification, object detection, and visual relationship detection at scale", "reason": "This paper introduces the Open Images dataset, which is used for training the VINE model.  The dataset's scale and diversity are crucial factors in the success of VINE.  The diversity of images in the dataset helps improve VINE's generalization capabilities and robustness.", "section_number": 4}, {" publication_date": "2018", "fullname_first_author": "Richard Zhang", "paper_title": "The unreasonable effectiveness of deep features as a perceptual metric", "reason": "This paper introduces LPIPS (Learned Perceptual Image Patch Similarity), a perceptual metric used extensively to assess image quality in various computer vision tasks, including watermarking.  Its relevance to this research stems from its use in evaluating the perceptual quality of watermarked images, especially in assessing the trade-off between watermark robustness and image quality.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "Yang Song", "paper_title": "Generative modeling by estimating gradients of the data distribution", "reason": "This paper introduces score-based generative modeling, a crucial technique for training diffusion models.  Diffusion models are central to many image editing techniques in the paper.  Understanding this technique is essential for understanding how image editing models work and for evaluating the performance of VINE, which uses a diffusion model in its design.", "section_number": 3}]}