[{"figure_path": "2410.14208/charts/charts_7_0.png", "caption": "Figure 3: Figures (a) and (b) illustrate the correlation between the teacher's learning process and the performance of the student trained on data synthesized by the intermediate teachers in Alpaca Eval and MT-Bench. Figure (c) depicts how the distribution of the local data influence of the teacher's synthetic data shifts as the teacher is progressively updated. Figure (d) presents the proportion of training data with positive local data influence during the student's training.", "description": "The chart shows the correlation between the teacher's learning progress and the student's performance, and the distribution of local data influence during the training process.", "section": "5.2 CORRELATION BETWEEN TEACHER'S LEARNING AND STUDENT'S PERFORMANCE"}, {"figure_path": "2410.14208/charts/charts_7_1.png", "caption": "Figure 3: Figures (a) and (b) illustrate the correlation between the teacher's learning process and the performance of the student trained on data synthesized by the intermediate teachers in Alpaca Eval and MT-Bench. Figure (c) depicts how the distribution of the local data influence of the teacher's synthetic data shifts as the teacher is progressively updated. Figure (d) presents the proportion of training data with positive local data influence during the student's training.", "description": "The chart displays the correlation between the teacher's learning progress and student performance, showing how the distribution of local data influence changes, and the proportion of positive influence during training.", "section": "5.2 CORRELATION BETWEEN TEACHER'S LEARNING AND STUDENT'S PERFORMANCE"}, {"figure_path": "2410.14208/charts/charts_7_2.png", "caption": "Figure 3: Figures (a) and (b) illustrate the correlation between the teacher's learning process and the performance of the student trained on data synthesized by the intermediate teachers in Alpaca Eval and MT-Bench. Figure (c) depicts how the distribution of the local data influence of the teacher's synthetic data shifts as the teacher is progressively updated. Figure (d) presents the proportion of training data with positive local data influence during the student's training.", "description": "Figure 3 shows the correlation between the teacher's learning process and student performance, the distribution shift of local data influence, and the proportion of training data with positive influence.", "section": "5.2 CORRELATION BETWEEN TEACHER'S LEARNING AND STUDENT'S PERFORMANCE"}, {"figure_path": "2410.14208/charts/charts_9_0.png", "caption": "Figure 5: Evaluation results of training four different student models using synthetic data generated by a teacher optimized for the data preferences of the 1.1B student.", "description": "The chart displays the performance of four different student language models trained on synthetic data generated by a teacher model optimized for a smaller student model's preferences, comparing their performance with a baseline model.", "section": "5 EVALUATION RESULTS"}, {"figure_path": "2410.14208/charts/charts_9_1.png", "caption": "Figure 6: The most common root verbs (inner circle) and their top 4 direct noun objects (outer circle) in generated instructions", "description": "The chart compares the frequency of root verbs and their corresponding noun objects used in instructions generated by Self-Instruct and Montessori-Instruct, highlighting differences in instruction style and complexity.", "section": "5.5 CASE STUDY"}, {"figure_path": "2410.14208/charts/charts_19_0.png", "caption": "Figure 11: Distribution of tokenized instructions generated by Self-Instruct and Montessori-Instruct", "description": "The chart displays the distribution of tokenized instruction lengths generated by Self-Instruct and Montessori-Instruct, showing that Montessori-Instruct produces longer instructions.", "section": "5 EVALUATION RESULTS"}, {"figure_path": "2410.14208/charts/charts_19_1.png", "caption": "Figure 12: Distribution of tokenized responses generated by Self-Instruct and Montessori-Instruct", "description": "The chart displays the distribution of tokenized response lengths generated by the Self-Instruct and Montessori-Instruct methods.", "section": "5 EVALUATION RESULTS"}, {"figure_path": "2410.14208/charts/charts_19_2.png", "caption": "Figure 12: Distribution of tokenized responses generated by Self-Instruct and Montessori-Instruct", "description": "The chart displays the distribution of tokenized response lengths generated by the Self-Instruct and Montessori-Instruct methods.", "section": "5 EVALUATION RESULTS"}]