[{"figure_path": "2410.18084/tables/table_7_0.html", "caption": "Table 1: Comparisons of 4D Scene Reconstruction. We report the mIoU scores of OccSora (Wang et al., 2024) and our DynamicCity framework on the CarlaSC, Occ3D-Waymo, and Occ3D-nuScenes datasets, respectively, under different resolutions and sequence lengths. Symbol † denotes score reported in the OccSora paper. Other scores are reproduced using the official code.", "description": "Table 1 compares the 4D scene reconstruction performance of the proposed DynamicCity model against OccSora across different datasets, resolutions, and sequence lengths, showing DynamicCity's superior performance.", "section": "5 Experiments"}, {"figure_path": "2410.18084/tables/table_7_1.html", "caption": "Table 2: Comparisons of 4D Scene Generation. We report the Inception Score (IS), Fréchet Inception Distance (FID), Kernel Inception Distance (KID), and the Precision (P) and Recall (R) rates of SemCity (Lee et al., 2024), OccSora (Wang et al., 2024), and our DynamicCity framework on the CarlaSC and Occ3D-Waymo datasets, respectively, in both the 2D and 3D spaces.", "description": "Table 2 compares the performance of three different methods (SemCity, OccSora, and DynamicCity) on 4D scene generation using Inception Score, Fréchet Inception Distance, Kernel Inception Distance, Precision, and Recall in both 2D and 3D spaces.", "section": "5 Experiments"}, {"figure_path": "2410.18084/tables/table_10_0.html", "caption": "Table 3: Ablation Study on VAE Network Structures. We report the mIoU scores, training time (second-per-iteration), and training-time memory consumption (VRAM) of different Encoder and Decoder configurations on CarlaSC and Occ3D-Waymo, respectively. Note that \"ESS\" denotes \"Expansion & Squeeze\". The best and second-best values are in bold and underlined.", "description": "The table presents an ablation study comparing different VAE network structures (encoders and decoders, with and without the proposed Expansion & Squeeze Strategy) across two datasets, measuring mIoU scores, training time, and VRAM usage.", "section": "A.3 Model Details"}, {"figure_path": "2410.18084/tables/table_10_1.html", "caption": "Table 4: Ablation Study on HexPlane Downsampling (D.S.) Rates. We report the compression ratios (C.R.), mIoU scores, training speed (seconds per iteration), and training-time memory consumption on CarlaSC and Occ3D-Waymo. The best and second-best values are in bold and underlined.", "description": "Table 4 shows the impact of different downsampling rates on the HexPlane's compression ratio, mIoU score, training speed, and VRAM usage for the VAE model on CarlaSC and Occ3D-Waymo datasets.", "section": "A.3 Model Details"}, {"figure_path": "2410.18084/tables/table_10_2.html", "caption": "Table 5: Ablation Study on Organizing HexPlane as Image Tokens. We report the Inception Score (IS), Fréchet Inception Distance (FID), Kernel Inception Distance (KID), and the Precision (P) and Recall (R) rates on CarlaSC. The best values are highlighted in bold.", "description": "Table 5 presents an ablation study comparing different methods of organizing HexPlanes as image tokens for 4D LiDAR generation, evaluating their performance using Inception Score, Fréchet Inception Distance, Kernel Inception Distance, Precision, and Recall metrics.", "section": "4.2 Diffusion Transformer for HexPlane"}, {"figure_path": "2410.18084/tables/table_15_0.html", "caption": "Table 1: Comparisons of 4D Scene Reconstruction. We report the mIoU scores of OccSora (Wang et al., 2024) and our DynamicCity framework on the CarlaSC, Occ3D-Waymo, and Occ3D-nuScenes datasets, respectively, under different resolutions and sequence lengths. Symbol † denotes score reported in the OccSora paper. Other scores are reproduced using the official code.", "description": "Table 1 compares the 4D scene reconstruction performance (mIoU) of DynamicCity against OccSora across three datasets with varying resolutions and sequence lengths.", "section": "5.2 4D SCENE RECONSTRUCTION & GENERATION"}]