[{"figure_path": "2410.18647/figures/figures_2_0.png", "caption": "Figure 1: Illustrations of all tasks. We derive the data scaling laws through extensive experiments on Pour Water and Mouse Arrangement, and further validate these findings on additional tasks, including Fold Towels and Unplug Charger.", "description": "The figure shows four different robotic manipulation tasks: Pour Water, Mouse Arrangement, Fold Towels, and Unplug Charger.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.18647/figures/figures_16_0.png", "caption": "Figure 12: Testing environments. These 8 environments are not included in the training data and are used across all tasks.", "description": "The figure shows eight unseen testing environments used to evaluate the generalization capabilities of the robotic policies across all four manipulation tasks.", "section": "A ENVIRONMENT AND OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_16_1.png", "caption": "Figure 12: Testing environments. These 8 environments are not included in the training data and are used across all tasks.", "description": "The figure shows eight unseen testing environments used to evaluate the generalization performance of the trained policies across all four tasks.", "section": "A.1 ENVIRONMENT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_17_0.png", "caption": "Figure 8: Training environments for Pour Water. We sample 12 environments from our collected training data. See Appendix D.1 for task details.", "description": "The figure shows 12 different environments used for training a robot to pour water.", "section": "A.1 Environment Visualizations"}, {"figure_path": "2410.18647/figures/figures_17_1.png", "caption": "Figure 8: Training environments for Pour Water. We sample 12 environments from our collected training data. See Appendix D.1 for task details.", "description": "The figure shows 12 different training environments used for the Pour Water task in the robotic manipulation experiment.", "section": "A.1 Environment Visualizations"}, {"figure_path": "2410.18647/figures/figures_17_2.png", "caption": "Figure 12: Testing environments. These 8 environments are not included in the training data and are used across all tasks.", "description": "The figure shows eight unseen testing environments used to evaluate the generalization performance of the robotic manipulation policies.", "section": "A ENVIRONMENT AND OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_18_0.png", "caption": "Figure 13: Objects for Pour Water. All of our experiments include a total of 64 training bottles and mugs, as well as 16 unseen testing bottles and mugs.", "description": "The figure shows the 64 training and 16 testing objects used in the Pour Water task of the robotic manipulation experiment.", "section": "A.2 OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_19_0.png", "caption": "Figure 14: Objects for Mouse Arrangement. All of our experiments include a total of 64 training mice and mouse pads, as well as 16 unseen testing mice and mouse pads.", "description": "The figure shows the 64 training and 16 testing mouse and mousepad pairs used in the experiments.", "section": "A.2 OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_20_0.png", "caption": "Figure 15: Objects for Fold Towels. All of our experiments include a total of 32 training towels, as well as 16 unseen testing towels.", "description": "The figure shows the 32 training towels and 16 unseen testing towels used in the Fold Towels task.", "section": "A ENVIRONMENT AND OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_21_0.png", "caption": "Figure 16: Objects for Unplug Charger. All of our experiments include a total of 32 training chargers and power strips, as well as 16 unseen testing chargers and power strips.", "description": "The figure shows the 32 training objects and 16 testing objects used for the Unplug Charger task in the experiment.", "section": "A.2 OBJECT VISUALIZATIONS"}, {"figure_path": "2410.18647/figures/figures_29_0.png", "caption": "Figure 18: UMI hand-held grippers. We do not install side mirrors on the grippers.", "description": "The figure shows four UMI hand-held grippers used in the data collection process of the paper.", "section": "F Hardware Setup"}, {"figure_path": "2410.18647/figures/figures_29_1.png", "caption": "Figure 19: Deployment hardware setup.", "description": "The figure shows the hardware setup used for the robotic manipulation experiments, including the robot arm, gripper, camera, and power supply.", "section": "F Hardware Setup"}]