[{"figure_path": "2410.16268/figures/figures_2_0.png", "caption": "Figure 1: Comparison of occlusion handling and long-term compatibility between SAM 2 and SAM2Long. (a) When an occlusion occurs, SAM 2 may lose track or follow the wrong object, leading to accumulated errors. In contrast, SAM2Long utilizes memory tree search to recover when the object reappears. (b) The per-frame J&F scores of the predicted masks are plotted at specific timestamps on the LVOS and SA-V datasets. SAM2Long demonstrates greater resilience to elapsed time compared to SAM 2, maintaining superior performance over longer periods.", "description": "Figure 1 compares the performance of SAM2 and SAM2Long on handling occlusions and maintaining long-term tracking accuracy in video object segmentation, demonstrating SAM2Long's superior resilience.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16268/figures/figures_5_0.png", "caption": "Figure 2: (a) The pipeline of constrained memory tree: At each time step t, we maintain multiple memory pathways, each containing a memory bank and a cumulative score Sp[t]. The input frame is processed through the mask decoder conditioned on the memory bank, generating three mask candidates for each pathway. The candidates with the highest updated cumulative scores Sp,k[t] are carried forward to the next time step. (b) Mask selection with uncertainty handling: When the maximum absolute occlusion score exceeds the threshold δconf (Certain), the high-scoring mask is selected. Otherwise (Uncertain), distinct mask candidates are picked to avoid incorrect convergence.", "description": "This figure illustrates the constrained tree memory structure and uncertainty handling mechanism used in SAM2Long for long-term video object segmentation.", "section": "3 METHOD"}, {"figure_path": "2410.16268/figures/figures_11_0.png", "caption": "Figure 3: Qualitative comparison between SAM 2 and SAM2Long, with GT (Ground Truth) provided for reference. A blue box is used to highlight incorrectly segmented objects, while a red box indicates missing objects. Best viewed when zoomed in.", "description": "Figure 3 presents a qualitative comparison of SAM2 and SAM2Long's video object segmentation performance, highlighting SAM2Long's improved accuracy and robustness in handling occlusions and reappearing objects.", "section": "4.4 VISUALIZATION"}]