{"references": [{" publication_date": "2021", "fullname_first_author": "John Jumper", "paper_title": "Highly accurate protein structure prediction with Alphafold", "reason": "This paper introduced AlphaFold, a revolutionary protein structure prediction model that achieved unprecedented accuracy.  It significantly advanced the field of protein structure prediction and has had a profound impact on various downstream applications, including drug discovery and protein engineering.  Its impact is evident in the numerous subsequent studies referencing it, underlining its importance in the field.", "section_number": 1}, {" publication_date": "2020", "fullname_first_author": "Jonathan Ho", "paper_title": "Denoising diffusion probabilistic models", "reason": "This foundational paper introduced the concept of denoising diffusion probabilistic models (DDPMs), a powerful class of generative models. DDPMs have since been adapted to many domains and show remarkable performance in generating high-quality samples. Its influence is apparent in the many subsequent papers that build upon its core principles.", "section_number": 1}, {" publication_date": "2019", "fullname_first_author": "Alexander Rives", "paper_title": "Biological structure and function emerge from scaling unsupervised learning to 250 million protein sequences", "reason": "This paper demonstrated the power of large-scale unsupervised learning in protein sequence representation. The work established the use of massive protein sequence datasets for pre-training language models, enabling subsequent improvements in various downstream tasks. The work's impact is reflected in the broad adoption of large-scale protein language models in the field.", "section_number": 1}, {" publication_date": "2024", "fullname_first_author": "Xinyou Wang", "paper_title": "Diffusion language models are versatile protein learners", "reason": "This paper introduces DPLM, a state-of-the-art discrete diffusion protein language model that serves as a foundation for the multimodal model DPLM-2.  DPLM’s success highlights the capabilities of discrete diffusion models in protein sequence generation and understanding, making it a crucial building block for the advanced capabilities of DPLM-2.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Jacob Austin", "paper_title": "Structured denoising diffusion models in discrete state-spaces", "reason": "This paper extended the denoising diffusion probabilistic model framework to discrete state-spaces, enabling its application to discrete data.  This was particularly impactful for the current study because it allowed the extension of diffusion models to protein sequences, which are inherently discrete data.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Sarah Alamdari", "paper_title": "Protein generation with evolutionary diffusion: sequence is all you need", "reason": "This paper proposed a novel protein sequence generation approach that uses evolutionary information and diffusion models.  The approach showcases the effectiveness of diffusion models in generating realistic protein sequences, serving as a notable example of the method's application in this domain.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Justas Dauparas", "paper_title": "Robust deep learning-based protein sequence design using proteinmpnn", "reason": "This work introduced ProteinMPNN, a powerful model for protein design. ProteinMPNN demonstrates the capabilities of deep learning in designing proteins with specific properties.  Its success highlights the potential of these methods for advanced protein engineering applications.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Andrew Campbell", "paper_title": "Generative flows on discrete state-spaces: Enabling multimodal flows with applications to protein co-design", "reason": "This paper is highly relevant because it directly addresses multimodal protein generation.  The use of normalizing flows for multimodal data showcases an alternative to diffusion models for this task, highlighting different approaches for handling this complex problem.", "section_number": 2}, {" publication_date": "2017", "fullname_first_author": "Aaron Van Den Oord", "paper_title": "Neural discrete representation learning", "reason": "This seminal paper introduced vector quantization-variational autoencoders (VQ-VAEs) and their application to image generation.  VQ-VAEs became a foundational technique for representing continuous data in a discrete form within language models, a key aspect in the development of DPLM-2's structure tokenizer.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Lijun Yu", "paper_title": "Language model beats diffusion-tokenizer is key to visual generation", "reason": "This paper introduced a lookup-free quantizer (LFQ), a crucial component of DPLM-2's structure tokenizer. The LFQ efficiently converts continuous structural data (3D coordinates) into a discrete representation, enabling seamless integration with the protein language model. Its efficiency is a major advantage of DPLM-2.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Tomas Hayes", "paper_title": "Simulating 500 million years of evolution with a language model", "reason": "This work is directly related as it represents a concurrent, independent effort in developing a multimodal protein generative model. Comparing and contrasting the approaches of ESM3 and DPLM-2 provides valuable insights into the strengths and limitations of different multimodal protein modeling strategies.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "Mihaly Varadi", "paper_title": "Alphafold protein structure database: massively expanding the structural coverage of protein-sequence space with high-accuracy models", "reason": "This paper provides a large-scale dataset of high-quality protein structures predicted using AlphaFold. The availability of this dataset greatly facilitated the training of DPLM-2 and improved its accuracy and generalization capabilities.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Helen M Berman", "paper_title": "The protein data bank", "reason": "This paper describes the Protein Data Bank (PDB), a crucial repository for experimentally determined protein structures. The PDB serves as a primary source of high-quality data for training and evaluating protein structure prediction models, including DPLM-2.", "section_number": 3}, {" publication_date": "2021", "fullname_first_author": "Wengong Jin", "paper_title": "Iterative refinement graph neural network for antibody sequence-structure co-design", "reason": "This paper is relevant because it also tackled the problem of jointly designing protein sequence and structure.  While using a different approach than DPLM-2, it demonstrates the growing interest in multimodal protein modeling. Comparing and contrasting the approaches yields insights into the benefits of using diffusion models.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Jason Yim", "paper_title": "Se (3) diffusion model with application to protein backbone generation", "reason": "This paper presents a strong baseline method for protein structure generation that is directly compared against DPLM-2 in the experimental section. The comparison highlights DPLM-2's superior performance in terms of generating high-quality structures.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Jason Yim", "paper_title": "Improved motif-scaffolding with se (3) flow matching", "reason": "This paper provides another related approach for protein design, specifically focusing on motif-scaffolding, a key application domain also considered in DPLM-2.  The results of DPLM-2 on this task directly compare to this approach, highlighting its superior performance.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Joseph L Watson", "paper_title": "De novo design of protein structure and function with rfdiffusion", "reason": "This paper presents a strong baseline method for protein structure generation, comparing its performance against DPLM-2. Its results highlight DPLM-2's advancement in generating protein structures.", "section_number": 4}, {" publication_date": "2022", "fullname_first_author": "Kevin E Wu", "paper_title": "Protein structure generation via folding diffusion", "reason": "This paper offers an alternative approach to protein structure generation using diffusion models, providing a contrasting technique to the DPLM-2 method and a valuable comparison point for assessing relative performance and methodology.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Jin Su", "paper_title": "Saprot: Protein language modeling with structure-aware vocabulary", "reason": "This paper is crucial for evaluating DPLM-2's performance on downstream tasks, providing state-of-the-art results against which DPLM-2 is benchmarked. The comparison highlights DPLM-2's strengths and weaknesses in integrating structural information for predictive purposes.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Zaixiang Zheng", "paper_title": "Structure-informed language models are protein designers", "reason": "This paper is closely related to the current work, and serves as an important comparison for understanding the advantages and limitations of different multimodal protein modeling approaches.  The results highlight specific strengths and weaknesses of both models, contributing to a deeper analysis of the DPLM-2 model.", "section_number": 4}]}