[{"figure_path": "2410.17434/charts/charts_2_0.png", "caption": "Figure 1 Effectiveness of our LongVU over commonly-used uniform sampling and dense sampling. Uniform sampling overlooks critical frames due to its sparse nature. Dense sampling may surpass the maximum context length, leading to truncation of tokens from targeted frames. In contrast, our method can adaptively conduct spatiotemporal compression, accommodating long video sequences while preserving more visual details.", "description": "The chart compares the effectiveness of LongVU against uniform and dense sampling methods for processing long videos, highlighting LongVU's adaptive spatiotemporal compression for better visual detail preservation.", "section": "1 Introduction"}, {"figure_path": "2410.17434/charts/charts_10_0.png", "caption": "Figure 4 We randomly sample hundreds of videos to demonstrate the frames/tokens level reduction rate. (a) The number of frames before/after temporal reduction based on DINOv2 features (Section 3.1). (b) The number of tokens before/after spatial token compression (Section 3.3).", "description": "The chart displays the number of frames and tokens before and after temporal and spatial reduction, respectively, demonstrating the effectiveness of the proposed compression method.", "section": "4.6 Spatiotemporal Compression Analysis"}, {"figure_path": "2410.17434/charts/charts_10_1.png", "caption": "Figure 7 Needle-In-A-Video-Haystack results. Our spatiotemporal adaptive token compression scheme improves the score for locating the needle frame.", "description": "The heatmap visualizes the performance of different models (with and without different components) on the needle-in-a-haystack task, showing the impact of the spatiotemporal compression strategy.", "section": "4.5 Ablation Studies"}, {"figure_path": "2410.17434/charts/charts_10_2.png", "caption": "Figure 7 Needle-In-A-Video-Haystack results. Our spatiotemporal adaptive token compression scheme improves the score for locating the needle frame.", "description": "The heatmap visualizes the performance of the needle-in-a-haystack task under different video lengths and compression strategies, showing improved performance with the proposed spatiotemporal adaptive token compression.", "section": "4.5 Ablation Studies"}, {"figure_path": "2410.17434/charts/charts_17_0.png", "caption": "Figure 7 Needle-In-A-Video-Haystack results. Our spatiotemporal adaptive token compression scheme improves the score for locating the needle frame.", "description": "The heatmap shows the performance of different methods for locating a needle frame in a video with varying lengths and depths.", "section": "4.5 Ablation Studies"}]