[{"figure_path": "2410.13218/charts/charts_7_0.png", "caption": "Figure 1: Detailed F1 scores of each label for CBT-CD and CBT-FC.", "description": "The radar chart visualizes the detailed F1 scores of each label for CBT-CD and CBT-FC across six different LLMs.", "section": "4.2 Results"}, {"figure_path": "2410.13218/charts/charts_7_1.png", "caption": "Figure 1: Detailed F1 scores of each label for CBT-CD and CBT-FC.", "description": "The radar chart visualizes the F1 scores achieved by six different LLMs across various labels in CBT-CD and CBT-FC datasets.", "section": "4.2 Results"}, {"figure_path": "2410.13218/charts/charts_8_0.png", "caption": "Figure 2: The overall pairwise comparison of different models vs. reference across difficulty level.", "description": "The chart displays the overall pairwise comparison scores of three different LLMs against human responses across three difficulty levels (beginner, intermediate, advanced) in the CBT-DP task.", "section": "5 Level III Experiments"}, {"figure_path": "2410.13218/charts/charts_24_0.png", "caption": "Figure 4: Detailed accuracies on different types of knowledge for CBT-QA and the F1 score of each label for CBT-PC.", "description": "The radar chart visualizes the performance of six large language models on different types of CBT knowledge questions and cognitive model understanding tasks.", "section": "4.2 Results"}, {"figure_path": "2410.13218/charts/charts_24_1.png", "caption": "Figure 4: Detailed accuracies on different types of knowledge for CBT-QA and the F1 score of each label for CBT-PC.", "description": "The radar chart visualizes the detailed performance of different LLMs on CBT-QA and CBT-PC, showcasing their accuracy on various knowledge types and F1 scores for each label.", "section": "4.2 Results"}, {"figure_path": "2410.13218/charts/charts_27_0.png", "caption": "Figure 5: The win-tie-loss comparison among different models on three difficulty levels.", "description": "The chart displays the win-tie-loss rates of three LLMs against human experts across different difficulty levels in the therapeutic response generation task.", "section": "F Win-tie-loss Analysis"}]