{"references": [{" publication_date": "2022", "fullname_first_author": "Achini Adikari", "paper_title": "Empathic conversational agents for real-time monitoring and co-facilitation of patient-centered healthcare", "reason": "This paper is highly relevant to the study's focus on AI-driven tools for mental health support because it directly addresses the use of conversational agents for real-time monitoring and co-facilitation of patient-centered healthcare.  Its exploration of empathetic conversations and the integration of AI in patient care aligns well with the study's objectives, making it a significant contribution to the related literature.", "section_number": 2}, {" publication_date": "2014", "fullname_first_author": "Aaron T Beck", "paper_title": "Advances in cognitive theory and therapy: The generic cognitive model", "reason": "This paper is crucial for understanding the theoretical underpinnings of CBT, which is the central focus of this study's benchmark.  The generic cognitive model presented in this work is fundamental to CBT practice and is directly referenced in the study's description of the CBT-BENCH benchmark's Level II tasks, making it an essential foundational resource for the research.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Judith S Beck", "paper_title": "Cognitive behavior therapy: Basics and beyond", "reason": "As a comprehensive text on CBT, this book provides a detailed overview of the principles and practices of CBT, including the cognitive model and its application in therapy. It's referenced throughout the study's description of CBT-BENCH and provides the theoretical foundation for understanding the benchmark's different levels, thus directly impacting the methodology and overall framework of the research.", "section_number": 3}, {" publication_date": "2022", "fullname_first_author": "James F Boswell", "paper_title": "Deliberate practice in cognitive behavioral therapy", "reason": "This paper introduces the deliberate practice methodology, which forms the basis of Level III in the CBT-BENCH benchmark. The methodology's application to assessing CBT proficiency in graduate students is highly relevant to evaluating LLMs in real-world CBT scenarios. Therefore, understanding this methodology is critical for evaluating the results of Level III experiments and understanding the overall design of the benchmark.", "section_number": 3}, {" publication_date": "2023a", "fullname_first_author": "Siyuan Chen", "paper_title": "LLM-empowered chatbots for psychiatrist and patient simulation: Application and evaluation", "reason": "This paper's focus on LLM-empowered chatbots for psychiatrist and patient simulation is closely related to the goals of CBT-BENCH.  The methodology employed in simulating therapeutic conversations provides insights into the challenges and potential of using LLMs in real-world clinical settings, making it a relevant reference for comparative analysis and understanding the limitations of current LLMs.", "section_number": 2}, {" publication_date": "2023b", "fullname_first_author": "Zhiyu Chen", "paper_title": "Empowering psychotherapy with large language models: Cognitive distortion detection through diagnosis of thought prompting", "reason": "This work directly addresses cognitive distortion detection using LLMs, which is a core component of Level II in CBT-BENCH. The approach presented in this paper is highly relevant to the study as it focuses on the development of methods for identifying and analyzing specific cognitive distortions, making it a key reference for comparative analysis and understanding the limitations of LLMs in this specific task.", "section_number": 2}, {" publication_date": "2023c", "fullname_first_author": "Zhiyu Chen", "paper_title": "Empowering psychotherapy with large language models: Cognitive distortion detection through diagnosis of thought prompting", "reason": "This paper is highly relevant to the study due to its focus on cognitive distortion detection using LLMs, a key component of Level II in CBT-BENCH. The proposed approach and the datasets used provide valuable insights and context for understanding the challenges and opportunities involved in utilizing LLMs for this specific task within the CBT framework.", "section_number": 2}, {" publication_date": "2018", "fullname_first_author": "Shuang Gao", "paper_title": "Machine learning in major depression: From classification to treatment outcome prediction", "reason": "This paper is highly relevant because of its exploration of machine learning in major depression, a mental health condition directly related to the field of CBT.  The focus on applying machine learning techniques for both classification and treatment outcome prediction provides valuable context for understanding how AI can be applied to mental health and contributes to the broader field's literature, informing the overall approach of this study.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Gemma Team", "paper_title": "Gemma 2: Improving open language models at a practical size", "reason": "This paper introduces Gemma-2-9B, one of the LLMs evaluated in this research.  Understanding the characteristics and performance of this specific model is crucial for interpreting the experimental results, comparing its performance to other LLMs, and providing a detailed analysis of its strengths and weaknesses within the context of the CBT-BENCH benchmark.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Llama Team", "paper_title": "The llama 3 herd of models", "reason": "This paper introduces several Llama models (Llama-3.1-8B, Llama-3.1-70B, Llama-3.1-405B) which are evaluated in this research.  Understanding the architectures and capabilities of these models is essential for interpreting the study's results on CBT knowledge, cognitive model understanding, and therapeutic response generation.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Willem Kuyken", "paper_title": "Collaborative case conceptualization: Working effectively with clients in cognitive-behavioral therapy", "reason": "This paper discusses collaborative case conceptualization, a core aspect of CBT practice that is highly relevant to the study's focus on cognitive model understanding. This work provides a theoretical framework and practical guidance for analyzing patients' cognitive structures, which is crucial for the design and evaluation of the CBT-BENCH benchmark's Level II tasks.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "June M Liu", "paper_title": "ChatCounselor: A large language models for mental health support", "reason": "This paper directly addresses the use of large language models (LLMs) for mental health support, providing valuable insights into the potential applications and challenges of using AI in this domain.  The design and evaluation of ChatCounselor offer insights that are relevant to the goals of the study and provide a context for understanding the current capabilities and limitations of AI in mental healthcare.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Ryan Louie", "paper_title": "Roleplay-doh: Enabling domain-experts to create LLM-simulated patients via eliciting and adhering to principles", "reason": "This paper's focus on enabling domain experts to create LLM-simulated patients is highly relevant to the methodology employed in this study.  The approach to creating simulated patient interactions provides insights into the challenges and opportunities of simulating real-world CBT scenarios using LLMs, which is a crucial aspect of the study's Level III evaluation.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Mounica Maddela", "paper_title": "Training models to generate, recognize, and reframe unhelpful thoughts", "reason": "This paper focuses on training models to generate, recognize, and reframe unhelpful thoughts, a task directly relevant to the cognitive model understanding aspect of the CBT-BENCH benchmark. The techniques and findings presented in this study offer valuable insights for understanding the challenges and opportunities involved in employing LLMs for such tasks within the context of CBT.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Saskia Senn", "paper_title": "Ensembles of bert for depression classification", "reason": "This study is highly relevant because of its focus on depression classification using BERT, a deep learning model.  Depression is a major mental health condition often addressed using CBT. Therefore, the findings and methodology used in this research provide valuable context for understanding the capabilities and limitations of deep learning models in mental health applications, particularly those related to CBT.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Ashish Sharma", "paper_title": "Towards facilitating empathetic conversations in online mental health support: A reinforcement learning approach", "reason": "This paper is highly relevant because it explores the use of reinforcement learning for creating empathetic conversations in online mental health support. This is closely related to the goals of CBT-BENCH, which aims to evaluate LLMs' abilities in generating effective therapeutic responses. The reinforcement learning approach offers a different perspective on achieving empathetic and effective communication, which adds valuable context to the study.", "section_number": 2}, {" publication_date": "2023a", "fullname_first_author": "Ashish Sharma", "paper_title": "Human-AI collaboration enables more empathic conversations in text-based peer-to-peer mental health support", "reason": "This paper directly addresses the use of AI in mental health support, specifically focusing on human-AI collaboration for creating more empathetic conversations.  The findings and methodology of this research are relevant to the evaluation of LLMs in CBT-BENCH, as they provide insights into the challenges and opportunities of using AI to improve the quality and effectiveness of mental health support.", "section_number": 2}, {" publication_date": "2023b", "fullname_first_author": "Ashish Sharma", "paper_title": "Cognitive reframing of negative thoughts through human-language model interaction", "reason": "This work is highly relevant to the study's focus on cognitive model understanding (Level II of CBT-BENCH). The research directly addresses cognitive reframing, a crucial aspect of CBT, and its evaluation using LLMs provides valuable insights into the capabilities and limitations of these models in performing this specific therapeutic technique.  This is directly applicable to the cognitive model understanding component of CBT-BENCH.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Ruiyi Wang", "paper_title": "Patient-ψ: Using large language models to simulate patients for training mental health professionals", "reason": "This paper's focus on using LLMs to simulate patients for training mental health professionals is highly relevant to the methodology of this study, specifically the use of deliberate practice (CBT-DP) in Level III of CBT-BENCH.  The approach of simulating patient interactions provides insights into the challenges and opportunities of evaluating LLMs in real-world clinical settings, offering valuable context for interpreting and analyzing the results of the study.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Kailai Yang", "paper_title": "Towards interpretable mental health analysis with large language models", "reason": "This paper's focus on interpretable mental health analysis using LLMs is highly relevant to this study, particularly regarding the cognitive model understanding component of CBT-BENCH. The emphasis on interpretability addresses a key limitation of current LLMs and offers valuable insights into how to improve the transparency and explainability of AI-driven tools for mental health.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Kailai Yang", "paper_title": "MentaL-LaMA: Interpretable mental health analysis on social media with large language models", "reason": "This paper directly addresses the application of large language models (LLMs) to mental health analysis, specifically focusing on social media data. The focus on interpretability and the use of social media data are relevant to the broader context of this study, providing additional insights into the challenges and opportunities of using AI for mental health.", "section_number": 2}]}