{"references": [{" publication_date": "2020", "fullname_first_author": "Ben Mildenhall", "paper_title": "Nerf: Representing scenes as neural radiance fields for view synthesis", "reason": "This paper introduced NeRF, a groundbreaking technique that revolutionized novel view synthesis by representing scenes as continuous 5D functions.  Its impact is undeniable, as it serves as the foundation for numerous subsequent works, including many of those cited in this paper, significantly shaping the field's direction.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Jonathan Barron", "paper_title": "Mip-nerf: A multiscale representation for anti-aliasing neural radiance fields", "reason": "This paper addressed the aliasing artifacts present in the original NeRF, significantly improving the rendering quality, especially for high-resolution images and complex scenes.  It demonstrated how to enhance NeRF with a multi-resolution representation to reduce aliasing and improve visual fidelity.", "section_number": 1}, {" publication_date": "2021", "fullname_first_author": "Alex Yu", "paper_title": "PixelNeRF: Neural radiance fields from one or few images", "reason": "This paper extended NeRF to work with fewer input images, improving robustness and practicality. The ability to generate high-quality novel views from a small number of images reduces data acquisition needs and increases the real-world applicability of NeRF methods.", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "Thomas Müller", "paper_title": "Instant neural graphics primitives with a multiresolution hash encoding", "reason": "This paper introduced a significant efficiency improvement to NeRF-like methods via improved data structures and rendering techniques.  Its impact lies in making NeRF-based techniques faster and more scalable for real-time applications and broader usage.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Bernhard Kerbl", "paper_title": "3D Gaussian splatting for real-time radiance field rendering", "reason": "This work introduced Gaussian Splatting, offering a novel way to represent 3D scenes that's more efficient than previous methods, especially for scenes with complex geometries. This paper's contribution is significant for its speed and quality improvements, accelerating the adoption of NeRF for real-time rendering.", "section_number": 1}, {" publication_date": "2024", "fullname_first_author": "Yicong Hong", "paper_title": "Lrm: Large reconstruction model for single image to 3d", "reason": "This is one of the most recent and relevant LRM approaches to be published. As such, it is highly impactful for showing state-of-the-art results and establishing benchmarks for future research, influencing subsequent approaches.", "section_number": 1}, {" publication_date": "1996", "fullname_first_author": "Paul E. Debevec", "paper_title": "Modeling and rendering architecture from photographs: A hybrid geometry- and image-based approach", "reason": "This foundational paper in image-based rendering (IBR) established many of the core concepts and techniques that still underpin many modern IBR methods. It was instrumental in shaping this branch of novel view synthesis and provides a base upon which subsequent advancements build.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Ben Mildenhall", "paper_title": "Nerf: Representing scenes as neural radiance fields for view synthesis", "reason": "This paper introduced NeRF, a groundbreaking technique that revolutionized novel view synthesis by representing scenes as continuous 5D functions.  Its impact is undeniable, as it serves as the foundation for numerous subsequent works, including many of those cited in this paper, significantly shaping the field's direction.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Jonathan Barron", "paper_title": "Mip-nerf: A multiscale representation for anti-aliasing neural radiance fields", "reason": "This paper addressed the aliasing artifacts present in the original NeRF, significantly improving the rendering quality, especially for high-resolution images and complex scenes.  It demonstrated how to enhance NeRF with a multi-resolution representation to reduce aliasing and improve visual fidelity.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Alex Yu", "paper_title": "MVSNeRF: Fast generalizable radiance field reconstruction from multi-view stereo", "reason": "This paper addressed the need for using a smaller set of images for creating a NeRF model, enhancing the usefulness and applicability of the model.  The method is faster and more efficient than previous models, leading to improvements in the field.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Anpei Chen", "paper_title": "Tensorf: Tensorial radiance fields", "reason": "This paper introduced a novel representation for neural radiance fields that offers improved efficiency and scalability.  The use of tensorial representations allows for more compact scene representations and faster rendering, making the approach highly relevant to the advancement of the field.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Thomas Müller", "paper_title": "Instant neural graphics primitives with a multiresolution hash encoding", "reason": "This paper introduced a significant efficiency improvement to NeRF-like methods via improved data structures and rendering techniques.  Its impact lies in making NeRF-based techniques faster and more scalable for real-time applications and broader usage.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Bernhard Kerbl", "paper_title": "3D Gaussian splatting for real-time radiance field rendering", "reason": "This work introduced Gaussian Splatting, offering a novel way to represent 3D scenes that's more efficient than previous methods, especially for scenes with complex geometries. This paper's contribution is significant for its speed and quality improvements, accelerating the adoption of NeRF for real-time rendering.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "David Charatan", "paper_title": "PixelSplat: 3D gaussian splats from image pairs for scalable generalizable 3d reconstruction", "reason": "This work builds upon the success of Gaussian splatting by proposing a new method that improves the efficiency and scalability of the original approach, making it particularly suitable for large-scale 3D reconstruction tasks. The improvements demonstrated make it a highly relevant paper to this work.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Yicong Hong", "paper_title": "Lrm: Large reconstruction model for single image to 3d", "reason": "This is one of the most recent and relevant LRM approaches to be published. As such, it is highly impactful for showing state-of-the-art results and establishing benchmarks for future research, influencing subsequent approaches.", "section_number": 2}, {" publication_date": "2016", "fullname_first_author": "Justin Johnson", "paper_title": "Perceptual losses for real-time style transfer and super-resolution", "reason": "This paper introduced the concept of using perceptual losses in neural network training, significantly impacting image synthesis and other computer vision tasks by enabling the generation of visually more appealing and realistic images.  Its influence extends beyond the direct scope of this paper as perceptual losses are now standard in many image generation models.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Tri Dao", "paper_title": "Flashattention-2: Faster attention with better parallelism and work partitioning", "reason": "This paper introduces significant optimizations to the attention mechanism, a core component of modern transformer networks.  The improvement in speed and efficiency directly impacts the scalability and performance of transformer-based models, which are central to the approach presented in this paper.", "section_number": 4}, {" publication_date": "2020", "fullname_first_author": "Alex Henry", "paper_title": "Query-key normalization for transformers", "reason": "This paper introduces Query-Key Normalization, a technique to improve the stability and performance of transformer-based networks.  Because transformer networks form the foundation of the architecture in this paper, the proposed normalization technique was directly relevant and impactful.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Kai Zhang", "paper_title": "Gs-lrm: Large reconstruction model for 3d gaussian splatting", "reason": "This paper is highly relevant because it introduces the GS-LRM model, one of the main baselines against which the proposed LVSM model is compared.  By directly comparing against GS-LRM, the paper demonstrates its own advancements in the field and its superiority.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Desai Xie", "paper_title": "Lrm-zero: Training large reconstruction models with synthesized data", "reason": "This paper introduces a new method to train large reconstruction models. As such, it is a relevant contribution to the field and serves to support and expand the existing work done in the field of large reconstruction models.", "section_number": 4}]}