{"references": [{" publication_date": "2023", "fullname_first_author": "Bernhard Kerbl", "paper_title": "3d gaussian splatting for real-time radiance field rendering", "reason": "This paper introduces 3D Gaussian Splatting (3DGS), the foundation upon which SpectroMotion is built.  Its novel approach to representing 3D scenes with Gaussians enables fast training and real-time rendering, significantly improving efficiency in novel-view synthesis, directly addressing a key challenge highlighted in the introduction.  The impact of 3DGS on the field, as well as its relevance to SpectroMotion's core methodology, makes it a crucial reference.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Yi-Hua Huang", "paper_title": "Sc-gs: Sparse-controlled gaussian splatting for editable dynamic scenes", "reason": "This paper directly addresses dynamic scene reconstruction using 3D Gaussian Splatting (3DGS), which is a key technical challenge that SpectroMotion aims to improve on.  It is closely related to SpectroMotion's approach, making it essential for understanding the evolution and limitations of previous techniques in handling dynamic scenes using 3DGS.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Guanjun Wu", "paper_title": "4d gaussian splatting for real-time dynamic scene rendering", "reason": "This paper tackles dynamic scene reconstruction with 4DGS, providing a direct comparison point for SpectroMotion's approach.  The quantitative and qualitative comparison with this method highlights SpectroMotion's improvements in accuracy and rendering quality, especially in handling specular surfaces.  Its close relationship to the core methodology of SpectroMotion makes it a very relevant contribution.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Yingwenqi Jiang", "paper_title": "Gaussianshader: 3d gaussian splatting with shading functions for reflective surfaces", "reason": "This work focuses on rendering reflective surfaces using 3D Gaussian Splatting.  The comparison with this paper demonstrates SpectroMotion's advancements in handling both dynamic scenes and specular surfaces, showcasing its superior capacity for realistic reflection rendering and resolution of dynamic objects.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Ruofan Liang", "paper_title": "Gs-ir: 3d gaussian splatting for inverse rendering", "reason": "This paper extends 3DGS to inverse rendering, which is closely related to the reconstruction problem addressed by SpectroMotion.  While not directly focusing on dynamic scenes, it serves as an essential reference for understanding the advancements of 3DGS and the challenges inherent in modeling complex lighting conditions that often feature specular reflections.  The comparative evaluation in the experiments section further highlights SpectroMotion's contributions.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Xiang Guo", "paper_title": "Forward flow for novel view synthesis of dynamic scenes", "reason": "This paper is a relevant contribution addressing dynamic scene reconstruction using a different approach.  Comparing and contrasting it with SpectroMotion helps illustrate the advantages and limitations of different techniques in handling dynamic scenes, particularly in terms of computational efficiency and accuracy of specular reflections.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Zhengqi Li", "paper_title": "Neural scene flow fields for space-time view synthesis of dynamic scenes", "reason": "This paper introduces a method for space-time view synthesis of dynamic scenes using neural scene flow fields, offering an alternative approach for handling dynamic content compared to SpectroMotion's method.  This comparison allows for a broader assessment of the relative strengths and weaknesses of different techniques in terms of their capacity to handle dynamic specular scenes.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Albert Pumarola", "paper_title": "D-nerf: Neural radiance fields for dynamic scenes", "reason": "This paper utilizes NeRFs for dynamic scenes and is an important reference for the field of dynamic scene reconstruction.  By comparing and contrasting with SpectroMotion, this paper reveals that Gaussian splatting may have a relative advantage in computational efficiency, and the proposed normal correction method successfully addresses challenges not fully addressed by NeRF-based methods.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Li Ma", "paper_title": "Specnerf: Gaussian directional encoding for specular reflections", "reason": "This paper is directly relevant as it focuses on the problem of handling specular reflections.  It is relevant to SpectroMotion's approach, especially since the proposed normal correction method directly addresses limitations encountered in other methods.  The comparison between these two methods emphasizes the superior efficiency of Gaussian splatting and its capacity for robust specular reconstruction in dynamic scenarios.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Zhiwen Yan", "paper_title": "Nerfds: Neural radiance fields for dynamic specular objects", "reason": "This work is one of the most relevant papers to SpectroMotion.  It deals with dynamic specular objects, directly addressing the central focus of SpectroMotion.  The comparison in the experimental results section highlights SpectroMotion's advantages over existing methods such as NeRF-DS in accurately reconstructing and rendering dynamic specular objects.", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Keunhong Park", "paper_title": "Hypernerf: A higher-dimensional representation for topologically varying neural radiance fields", "reason": "HyperNeRF is another significant contribution to dynamic scene reconstruction and is used as one of the benchmark methods for comparison.  This work helps assess SpectroMotion's performance in a broader context, highlighting its competitiveness against leading approaches in handling dynamic scenes.  The quantitative and qualitative comparison in the experiments section highlights the performance of SpectroMotion on this dataset.", "section_number": 4}, {" publication_date": "2020", "fullname_first_author": "Mark Boss", "paper_title": "Neural-pil: Neural pre-integrated lighting for reflectance decomposition", "reason": "This paper discusses neural pre-integrated lighting, a method for reflectance decomposition, which is closely related to SpectroMotion's handling of specular reflections.  This provides an important comparison for understanding techniques in modeling lighting effects, showcasing the unique strengths of SpectroMotion's method in accurately reproducing specular highlights, especially in complex dynamic scenes.", "section_number": 2}, {" publication_date": "1982", "fullname_first_author": "Robert L Cook", "paper_title": "A reflectance model for computer graphics", "reason": "This seminal paper introduces the Cook-Torrance reflectance model, a fundamental component of physically-based rendering (PBR).  SpectroMotion leverages PBR principles, making this paper a key foundational reference for understanding the theoretical background of the method, especially its accurate rendering of specular reflections.", "section_number": 3}, {" publication_date": "2013", "fullname_first_author": "Brian Karis", "paper_title": "Real shading in unreal engine 4", "reason": "This paper provides a practical implementation of physically-based rendering, which is directly relevant to SpectroMotion's approach.  It showcases real-world applications of PBR, grounding SpectroMotion's theoretical foundation in practical techniques for high-quality rendering of specular objects.", "section_number": 3}, {" publication_date": "2007", "fullname_first_author": "Bruce Walter", "paper_title": "Microfacet models for refraction through rough surfaces", "reason": "This paper introduces microfacet models for refraction through rough surfaces, a significant theoretical contribution to the field of rendering that helps understand the underlying mechanisms involved in handling specular reflections.  SpectroMotion benefits from this research by building on the foundation of accurate specular rendering, especially when dealing with complex surface interactions.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Jinyu Yang", "paper_title": "Track anything: Segment anything meets videos", "reason": "This work is utilized to create dynamic specular masks for the evaluation of SpectroMotion.  Using Track Anything enables a more precise evaluation of the method's performance in rendering dynamic specular objects, allowing for a more accurate assessment of its capabilities compared to other methods.  This direct application in the experimental setup renders this paper crucial.", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Benjamin Attal", "paper_title": "Törf: Time-of-flight radiance fields for dynamic scene view synthesis", "reason": "This paper presents a novel approach to dynamic scene reconstruction using time-of-flight data and radiance fields.  Its comparison with SpectroMotion highlights the differences and similarities between different methods in terms of their capabilities in handling dynamic scenes, showcasing the strengths of SpectroMotion.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Wenqi Xian", "paper_title": "Space-time neural irradiance fields for free-viewpoint video", "reason": "This paper explores the use of neural irradiance fields for free-viewpoint video synthesis of dynamic scenes, providing an alternative approach to the problem of dynamic scene reconstruction.  It is an important comparative reference for understanding different methods in the field and highlights the unique features of SpectroMotion's approach.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Jacob Munkberg", "paper_title": "Extracting Triangular 3D Models, Materials, and Lighting From Images", "reason": "This paper focuses on extracting 3D models, materials, and lighting information from images.  It provides a context for understanding the challenges of reconstructing complex scenes with specular reflections, showcasing the effectiveness of SpectroMotion's approach in handling specular surfaces and accurately extracting material properties.", "section_number": 2}]}