{"references": [{" publication_date": "2009", "fullname_first_author": "J. Deng", "paper_title": "Imagenet: A large-scale hierarchical image database", "reason": "This paper introduces ImageNet, a large-scale dataset that has been crucial in the development and benchmarking of many deep learning models.  Its impact on the field of computer vision is immense, and its influence is directly relevant to the paper's discussion of the challenges and opportunities presented by colonoscopy data, particularly in highlighting the differences between general-purpose image datasets and the complexities of medical images.", "section_number": 1}, {" publication_date": "2022", "fullname_first_author": "M. B. Wallace", "paper_title": "Impact of artificial intelligence on miss rate of colorectal neoplasia", "reason": "This paper directly supports the central claim of the study by presenting evidence of AI's significant impact on reducing the miss rate of colorectal neoplasia in colonoscopy. The 50% reduction mentioned in the introduction is derived from this study, making it a cornerstone of the paper's argument for the importance of AI in colonoscopy.", "section_number": 1}, {" publication_date": "2012", "fullname_first_author": "J. Bernal", "paper_title": "Towards automatic polyp detection with a polyp appearance model", "reason": "As one of the earliest works on colonoscopy image analysis using computer vision, this paper significantly contributes to the context of the study's review of existing models.  It highlights early approaches and lays the foundation for understanding the evolution of techniques in this field.", "section_number": 3}, {" publication_date": "2014", "fullname_first_author": "J. Silva", "paper_title": "Toward embedded detection of polyps in wce images for early diagnosis of colorectal cancer", "reason": "This paper is important as an early example of the application of computer vision techniques to colonoscopy for the task of polyp detection.  Its focus on early detection and its contribution to the dataset collection for the research field are highly relevant to the analysis in Section 3.", "section_number": 3}, {" publication_date": "2015", "fullname_first_author": "J. Bernal", "paper_title": "Wm-dova maps for accurate polyp highlighting in colonoscopy: Validation vs. saliency maps from physicians", "reason": "This paper's contribution to the development of accurate polyp detection methods in colonoscopy, and its incorporation of physician validation, adds a critical layer to the analysis of existing methodologies within Section 3. Its comparative approach and focus on accuracy are essential to the paper's overall evaluation of the current state-of-the-art.", "section_number": 3}, {" publication_date": "2015", "fullname_first_author": "N. Tajbakhsh", "paper_title": "Automated polyp detection in colonoscopy videos using shape and context information", "reason": "This work is significant due to its early exploration of automated polyp detection using video colonoscopy data.  Its methods and findings directly contribute to the broader discussion in Section 3 of the challenges and opportunities in using video data for advanced colonoscopy image analysis.", "section_number": 3}, {" publication_date": "2016", "fullname_first_author": "R. Zhang", "paper_title": "Automatic detection and classification of colorectal polyps by transferring low-level cnn features from nonmedical domain", "reason": "This paper's innovative approach of transferring features from a non-medical domain to the medical domain of colonoscopy is highly relevant to the study's focus on addressing the challenges in adapting general-purpose AI techniques to the unique characteristics of colonoscopy images. Its contribution to understanding transfer learning in this context is valuable.", "section_number": 3}, {" publication_date": "2016", "fullname_first_author": "P. Mesejo", "paper_title": "Computer-aided classification of gastrointestinal lesions in regular colonoscopy", "reason": "This paper represents a significant contribution to the field of computer-aided diagnosis in colonoscopy, focusing on the classification of gastrointestinal lesions. The methods and findings are highly relevant to the study's analysis of classification tasks and datasets in Section 3.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "Q. Angermann", "paper_title": "Towards real-time polyp detection in colonoscopy videos: Adapting still frame-based methodologies for video sequences analysis", "reason": "This paper directly addresses the challenges of real-time polyp detection in video colonoscopy, an important consideration for practical applications of AI in this field. Its approach of adapting still-image techniques to video data is highly relevant to the study's discussion of video-based datasets and methods.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "K. Pogorelov", "paper_title": "Kvasir: A multi-class image dataset for computer aided gastrointestinal disease detection", "reason": "The Kvasir dataset is a significant contribution to the field of computer-aided diagnosis in gastroenterology, providing a benchmark dataset for several gastrointestinal diseases.  Its relevance to the study lies in its contribution to the broader discussion of datasets in Section 3, and its use as a benchmark for model evaluation.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "K. Pogorelov", "paper_title": "Nerthus: A bowel preparation quality video dataset", "reason": "This paper's introduction of the Nerthus dataset is significant because it contributes video data specifically focusing on bowel preparation quality assessment in colonoscopy.  This specialized focus is highly relevant to the discussion on the diverse types of colonoscopy datasets in Section 3, particularly regarding the nuances of data collection and annotation.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "D. Vázquez", "paper_title": "A benchmark for endoluminal scene segmentation of colonoscopy images", "reason": "This paper introduces a benchmark for endoluminal scene segmentation, an essential task in colonoscopy image analysis.  Its contribution as a benchmark dataset is directly relevant to the study's discussion of segmentation tasks and datasets in Section 3.", "section_number": 3}, {" publication_date": "2017", "fullname_first_author": "A. Koulaouzidis", "paper_title": "Kid project: an internet-based digital video atlas of capsule endoscopy for research purposes", "reason": "This paper presents the KID project, which provides a valuable video dataset for capsule endoscopy research. Its relevance to this study is that it contributes to the discussion of video datasets in Section 3 and highlights the growing importance of video data in this field.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "I. N. Figueiredo", "paper_title": "Unsupervised segmentation of colonic polyps in narrow-band imaging data based on manifold representation of images and wasserstein distance", "reason": "This paper presents an innovative approach to polyp segmentation using unsupervised learning methods.  Its contribution to the discussion of unsupervised techniques in Section 3 is valuable, particularly in showing the exploration of different learning paradigms beyond fully supervised methods.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "P. N. Figueiredo", "paper_title": "Polyp detection with computer-aided diagnosis in white light colonoscopy: comparison of three different methods", "reason": "This paper focuses on polyp detection in white light colonoscopy, providing a direct comparison of different methods.  This comparative analysis is particularly relevant to the paper's discussion of existing techniques and datasets in Section 3, offering valuable insights into the performance and limitations of different approaches.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "T.-H. Hoang", "paper_title": "Enhancing endoscopic image classification with symptom localization and data augmentation", "reason": "This paper addresses the task of endoscopic image classification by incorporating symptom localization and data augmentation.  This multi-faceted approach is valuable in the context of the study's discussion of different task objectives and data challenges in Section 3.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "M. Cho", "paper_title": "Identification of cecum time-location in a colonoscopy video by deep learning analysis of colonoscope movement", "reason": "This paper's focus on identifying the cecum's location in colonoscopy videos highlights an important aspect of procedural understanding in colonoscopy. This detailed analysis is relevant to the paper's overall discussion on the challenges and potential of AI in colonoscopy.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "S. Ali", "paper_title": "Endoscopy artifact detection (ead 2019) challenge dataset", "reason": "This paper introduces a challenge dataset for endoscopy artifact detection, directly addressing the challenges of noisy data in colonoscopy image analysis.  Its contribution to the field's awareness of data quality issues and its role in benchmarking model performance are highly relevant to the study's discussion in Section 3.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "Y. Liu", "paper_title": "Photoshopping colonoscopy video frames", "reason": "This paper introduces a novel method for data augmentation in colonoscopy, using image manipulation techniques.  Its approach is relevant to the study's discussion of data augmentation strategies in Section 3, and highlights the exploration of innovative techniques to improve the quality and diversity of training data.", "section_number": 3}, {" publication_date": "2020", "fullname_first_author": "D. Jha", "paper_title": "Kvasir-seg: A segmented polyp dataset", "reason": "This paper introduces the Kvasir-SEG dataset, a valuable resource for polyp segmentation tasks.  Its contribution is significant because it directly supports the study's analysis of segmentation datasets and methods in Section 3, and helps in evaluating the performance of different segmentation models.", "section_number": 3}]}