[{"figure_path": "2410.17883/tables/table_7_0.html", "caption": "Table 1: Comparison of models in terms of average inference time and overall accuracy on the AitW and AndroidControl datasets. The table presents the size of each model, the average inference time (in seconds, lower is better), and the overall accuracy (higher is better) for both datasets.", "description": "Table 1 compares the performance of different models on two mobile app control datasets in terms of inference time and overall accuracy.", "section": "4 EXPERIMENTS"}, {"figure_path": "2410.17883/tables/table_8_0.html", "caption": "Table 1: Comparison of models in terms of average inference time and overall accuracy on the AitW and AndroidControl datasets. The table presents the size of each model, the average inference time (in seconds, lower is better), and the overall accuracy (higher is better) for both datasets.", "description": "Table 1 compares different models' average inference time and overall accuracy on two mobile phone control datasets.", "section": "4.1 EXPERIMENTAL SETUP"}, {"figure_path": "2410.17883/tables/table_9_0.html", "caption": "Table 3: Action-type, click-target, and text accuracies across module combinations on the AitW and AndroidControl datasets. LiMAC achieves the best action-type accuracy in both datasets and the best click-target accuracy in AitW, while our fine-tuned Florence2 excels at text prediction.", "description": "The table compares the performance of different model configurations (including LiMAC and various baselines) across two datasets, evaluating their action type accuracy, click target accuracy, and text accuracy.", "section": "4 EXPERIMENTS"}, {"figure_path": "2410.17883/tables/table_9_1.html", "caption": "Table 4: Evaluation of three ablated versions of LiMAC using different types of input, on AndroidControl. For actions that require text completion, we use the fine-tuned Florence2.", "description": "Table 4 presents the performance comparison of three ablated versions of LiMAC model, showing the impact of removing image or text embeddings and not fine-tuning CLIP on the overall accuracy.", "section": "4 EXPERIMENTS"}, {"figure_path": "2410.17883/tables/table_15_0.html", "caption": "Table 1: Comparison of models in terms of average inference time and overall accuracy on the AitW and AndroidControl datasets. The table presents the size of each model, the average inference time (in seconds, lower is better), and the overall accuracy (higher is better) for both datasets.", "description": "Table 1 compares various models' average inference time and overall accuracy on two mobile phone control datasets.", "section": "4.1 Experimental Setup"}]