[{"figure_path": "2410.16184/charts/charts_6_0.png", "caption": "Figure 2: Style-Substance Eval Matrix of sfairXC/FsfairX-LLaMA3-RM-v0.1 in Chat Domain", "description": "The Style-Substance Evaluation Matrix visualizes the performance of the sfairXC/FsfairX-LLaMA3-RM-v0.1 reward model in distinguishing between chosen and rejected responses across different styles (concise, detailed, markdown) in the Chat domain.", "section": "3.5 METRICS"}, {"figure_path": "2410.16184/charts/charts_8_0.png", "caption": "Figure 3: Scatter plot of correctness and verbosity scores of responses in RM-BENCH.", "description": "The scatter plot visualizes the correctness and verbosity scores of concise and detailed chosen and rejected responses in the RM-BENCH dataset across four domains.", "section": "4.3 MULTI-OBJECTIVE REWARD MODELS"}, {"figure_path": "2410.16184/charts/charts_9_0.png", "caption": "Figure 4: Line-chart of the policy model style-bias score and the reward model hard accuracy on RM-BENCH chat.", "description": "The chart shows the correlation between a reward model's performance on RM-BENCH's chat domain (Hard Accuracy) and the style bias of its corresponding policy model in a style-controlled setting.", "section": "5.1 STYLE-CONTROLLED CORRELATION"}, {"figure_path": "2410.16184/charts/charts_9_1.png", "caption": "Figure 5: Correlation between reward model perf. on RM-BENCH and policy model perf. on downstream tasks.", "description": "The chart displays the correlation between reward model performance on RM-BENCH and policy model performance on downstream tasks, showing a moderate positive correlation.", "section": "5.2 Downstream Task Correlation"}, {"figure_path": "2410.16184/charts/charts_16_0.png", "caption": "Figure 6: Correlation between the reward model performance on RM-BENCH and the policy model performance on Alpaca Eval.", "description": "The chart shows the correlation between reward model performance on RM-BENCH and policy model performance on a length-controlled evaluation from Alpaca Eval.", "section": "5.1 STYLE-CONTROLLED CORRELATION"}, {"figure_path": "2410.16184/charts/charts_16_1.png", "caption": "Figure 5: Correlation between reward model perf. on RM-BENCH and policy model perf. on downstream tasks.", "description": "The chart displays the correlation between reward model performance on RM-BENCH and policy model performance on downstream tasks, showing a moderate positive correlation.", "section": "Downstream Task Correlation"}, {"figure_path": "2410.16184/charts/charts_17_0.png", "caption": "Figure 8: Correlation between reward model performance on RM-BENCH and policy model performance with Best-of-N strategy, including code (left) and math (right).", "description": "The chart displays the correlation between reward model performance on RM-BENCH and the improvement in policy model performance using the Best-of-N strategy for code and math tasks.", "section": "H BEST-OF-N CORRELATION"}]