[{"figure_path": "2410.13674/tables/table_7_0.html", "caption": "Table 1: Accuracy (%) of long-tail classification on ImageNet-LT with base model ResNet-10. The best accuracy is highlighted in bold. † marks our reproduced results using the original paper provided code. BS refers to Balanced Softmax Loss(Ren et al., 2020). Baselines (LDMLR, CUDA) are defined in §5.1.", "description": "Table 1 presents the accuracy results of different methods on the ImageNet-LT dataset for long-tail classification, comparing baselines and the proposed DisCL method with various curriculum strategies.", "section": "5.1 Long-Tail Classification"}, {"figure_path": "2410.13674/tables/table_7_1.html", "caption": "Table 2: Accuracy (%) of long-tail classification on CIFAT-100-LT with base model ResNet-10. The best accuracy for classes of {many, medium, few} samples is highlighted in bold. Baselines are defined in §5.1.", "description": "Table 2 presents the accuracy of long-tail classification on CIFAR-100-LT dataset using different methods with various curriculum strategies, showing the impact of DisCL on model performance across different class cardinalities.", "section": "5.1 Long-Tail Classification"}, {"figure_path": "2410.13674/tables/table_8_0.html", "caption": "Table 3: Accuracy (%) of long-tail classification on iNaturalist2018 with base model ResNet-10. The best accuracy is highlighted in bold. Baselines are defined in §5.1.", "description": "Table 3 presents the accuracy of long-tail classification on the iNaturalist2018 dataset using different methods and curriculum strategies.", "section": "5.1 Long-Tail Classification"}, {"figure_path": "2410.13674/tables/table_8_1.html", "caption": "Table 5: In-distribution (ID) and out-of-distribution (OOD) macro F1 score of low-quality image learning on iWildCam with CLIP ViT-B/16 model. The best performance is highlighted in bold. † marks our reproduced results using the original paper provided code. Baselines are defined in §5.2.", "description": "Table 5 presents the in-distribution and out-of-distribution macro F1 scores for low-quality image learning on the iWildCam dataset, comparing different methods including the proposed DisCL approach.", "section": "5.2 Learning from Low-quality Data"}, {"figure_path": "2410.13674/tables/table_9_0.html", "caption": "Table 5: In-distribution (ID) and out-of-distribution (OOD) macro F1 score of low-quality image learning on iWildCam with CLIP ViT-B/16 model. The best performance is highlighted in bold. † marks our reproduced results using the original paper provided code. Baselines are defined in §5.2.", "description": "Table 5 presents the in-distribution and out-of-distribution macro F1 scores for low-quality image learning on the iWildCam dataset using various methods, including baselines and the proposed DisCL approach with different curriculum strategies.", "section": "5.2 Learning from Low-quality Data"}, {"figure_path": "2410.13674/tables/table_13_0.html", "caption": "Table 6: Statistics about Generated Synthetic Data. Irb refers to the imbalance ratio used to sample CIFAR100-LT dataset.", "description": "Table 6 presents the statistics of synthetic data generated for four different datasets used in the experiments, including the number of hard samples, image guidance scales, random seeds, and generated images before and after filtering.", "section": "A.1.1 Generation Settings and Statistics"}, {"figure_path": "2410.13674/tables/table_14_0.html", "caption": "Table 1: Accuracy (%) of long-tail classification on ImageNet-LT with base model ResNet-10. The best accuracy is highlighted in bold. † marks our reproduced results using the original paper provided code. BS refers to Balanced Softmax Loss(Ren et al., 2020). Baselines (LDMLR, CUDA) are defined in §5.1.", "description": "Table 1 shows the accuracy of different methods on the ImageNet-LT dataset for long-tail classification, comparing baselines and the proposed DisCL method with various curriculum strategies.", "section": "5.1 Long-Tail Classification"}, {"figure_path": "2410.13674/tables/table_16_0.html", "caption": "Table 1: Accuracy (%) of long-tail classification on ImageNet-LT with base model ResNet-10. The best accuracy is highlighted in bold. † marks our reproduced results using the original paper provided code. BS refers to Balanced Softmax Loss(Ren et al., 2020). Baselines (LDMLR, CUDA) are defined in §5.1.", "description": "Table 1 presents the accuracy results of different methods for long-tail classification on the ImageNet-LT dataset, comparing various curriculum learning strategies and baselines.", "section": "5.1 Long-Tail Classification"}, {"figure_path": "2410.13674/tables/table_18_0.html", "caption": "Table 8: Hyperparameters and their values", "description": "This table lists the hyperparameters used for synthetic data generation with diffusion models and curriculum learning.", "section": "A.4 Hyperparameters for Synthetic Generation and Model Training"}]