[{"figure_path": "2410.10812/tables/table_1_0.html", "caption": "Table 2: The performance of HART on MJHQ-30K, GenEval and DPG-Bench benchmarks. We compare HART with open-source diffusion models and autoregressive models. Results demonstrate that HART can achieve comparable performance to state-of-the-art diffusion models with <1B parameters, surpassing prior autoregressive models by a large margin.", "description": "Table 2 compares the performance of HART against state-of-the-art diffusion and autoregressive models on multiple image generation benchmarks, showing HART achieves comparable performance with fewer parameters.", "section": "4.2 Main Results"}, {"figure_path": "2410.10812/tables/table_8_0.html", "caption": "Table 2: The performance of HART on MJHQ-30K, GenEval and DPG-Bench benchmarks. We compare HART with open-source diffusion models and autoregressive models. Results demonstrate that HART can achieve comparable performance to state-of-the-art diffusion models with <1B parameters, surpassing prior autoregressive models by a large margin.", "description": "Table 2 compares the performance of HART against other open-source diffusion and autoregressive models on three benchmark datasets, showing that HART achieves comparable performance to state-of-the-art diffusion models with fewer parameters.", "section": "4.2 Main Results"}, {"figure_path": "2410.10812/tables/table_8_1.html", "caption": "Table 3: Compared to state-of-the-art diffusion models, HART achieves 5.0–9.6× higher throughput and 4.0–4.7× lower latency at 512×512 resolution. At 1024×1024 resolution, it demonstrates 4.5–7.7× higher throughput and 3.1–5.9× lower latency.", "description": "This table compares the efficiency of HART with state-of-the-art diffusion models in terms of latency, throughput and MACs at 512x512 and 1024x1024 resolutions.", "section": "3.3 EFFICIENCY ENHANCEMENTS"}, {"figure_path": "2410.10812/tables/table_8_2.html", "caption": "Table 2: The performance of HART on MJHQ-30K, GenEval and DPG-Bench benchmarks. We compare HART with open-source diffusion models and autoregressive models. Results demonstrate that HART can achieve comparable performance to state-of-the-art diffusion models with <1B parameters, surpassing prior autoregressive models by a large margin.", "description": "Table 2 compares the performance of HART with other autoregressive and diffusion models on various image generation benchmarks, showing HART achieves competitive results with significantly fewer parameters.", "section": "4.2 Main Results"}, {"figure_path": "2410.10812/tables/table_9_0.html", "caption": "Table 4: HART achieves better class-conditioned image generation results compared to MAR (Li et al., 2024b) with 10.7× lower MACs and 12.9× faster runtime. It also offers 7.8% FID reduction with 4% runtime overhead compared with VAR (Tian et al., 2024). Time: bs=64 on A100.", "description": "This table compares the performance of HART against other autoregressive models (VAR and MAR) on class-conditioned image generation, highlighting HART's superior efficiency and comparable FID (Fréchet Inception Distance).", "section": "4.2 Main Results"}, {"figure_path": "2410.10812/tables/table_9_1.html", "caption": "Table 4: HART achieves better class-conditioned image generation results compared to MAR (Li et al., 2024b) with 10.7× lower MACs and 12.9× faster runtime. It also offers 7.8% FID reduction with 4% runtime overhead compared with VAR (Tian et al., 2024). Time: bs=64 on A100.", "description": "Table 4 compares HART's class-conditional image generation performance against other autoregressive models (MAR and VAR) in terms of FID, Inception Score, parameters, number of steps, MACs and inference time.", "section": "4.2 Main Results"}, {"figure_path": "2410.10812/tables/table_9_2.html", "caption": "Table 5: HART learns residual tokens, which enhance conditioned image generation as evidenced by improvements in FID, inception score, and CLIP score. The HART-VAR results are obtained by omitting residual diffusion from the full HART model. Left: class-to-image, right: text-to-image, *: results obtained using the official VAR quantizer.", "description": "Table 5 shows the ablation study results of HART, demonstrating the impact of residual tokens and other design choices on image generation performance.", "section": "4.3 ABLATION STUDIES AND ANALYSIS"}]