[{"figure_path": "2410.18647/charts/charts_6_0.png", "caption": "Figure 2: Object generalization. Each curve corresponds to a different fraction of demonstrations used, with normalized scores shown as a function of the number of training objects.", "description": "The chart displays the relationship between a policy's object generalization performance and the number of training objects used, considering different fractions of available demonstrations.", "section": "4.1 RESULTS AND QUALITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_6_1.png", "caption": "Figure 2: Object generalization. Each curve corresponds to a different fraction of demonstrations used, with normalized scores shown as a function of the number of training objects.", "description": "The chart displays how a policy's ability to generalize to unseen objects changes as the number of training objects and the fraction of demonstrations used increases.", "section": "4.1 RESULTS AND QUALITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_7_0.png", "caption": "Figure 4: Generlization across environments and objects. Each curve corresponds to a different fraction of demonstrations used, with normalized scores shown as a function of the number of training environment-object pairs.", "description": "The chart displays the relationship between a policy's generalization ability and the number of training environment-object pairs, considering different fractions of used demonstrations.", "section": "4.1 RESULTS AND QUALITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_7_1.png", "caption": "Figure 5: Power-law relationship. Dashed lines represent power-law fits, with the equations provided in the legend. All axes are shown on a logarithmic scale. The correlation coefficient r indicates a power-law relationship between the policy generalization ability and the number of objects, environments, and environment-object pairs. See Appendix G.1 for data scaling laws on MSE.", "description": "The chart displays the power-law relationships between the policy's generalization ability and the number of training objects, environments, and environment-object pairs, showing how generalization scales approximately as a power law with the number of training instances across different data dimensions.", "section": "4.2 POWER-LAW FITTING AND QUANTITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_8_0.png", "caption": "Figure 6: Multiple objects per environment. Brighter colors indicate higher normalized scores.", "description": "The heatmap visualizes how the policy's normalized scores vary depending on the number of environments and the number of objects per environment.", "section": "4.3 EFFICIENT DATA COLLECTION STRATEGY"}, {"figure_path": "2410.18647/charts/charts_9_0.png", "caption": "Figure 7: Number of demonstrations. Left: In the setting where we collect the maximum number of demonstrations, we examine whether the policy's performance follows a power-law relationship with the total number of demonstrations. The correlation coefficients for Pour Water and Mouse Arrangement are -0.62 and -0.79, respectively, suggesting only a weak power-law relationship. Right: For varying environment-object pairs, the policy performance increases with the total number of demonstrations at first, and then reaches saturation.", "description": "The chart displays the relationship between the number of demonstrations and the policy's performance for object and environment generalization, showing saturation after a certain number of demonstrations.", "section": "4.1 RESULTS AND QUALITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_27_0.png", "caption": "Figure 17: Comparison between normalized score and MSE. Left: In the object generalization experiment, the inverse correlation between MSE and normalized score is weak. Right: In the generalization experiment across both environments and objects, the inverse correlation between MSE and normalized score is very strong. Correlation coefficients (Pearson's r and Spearman's ρ) are shown in the bottom right.", "description": "The chart compares two evaluation metrics, normalized score and MSE, for evaluating the generalization performance of robot policies in object generalization and generalization across both environments and objects, revealing the strength of correlation between them.", "section": "E.1 Comparison of Evaluation Metrics"}, {"figure_path": "2410.18647/charts/charts_30_0.png", "caption": "Figure 20: Data scaling laws on MSE. Dashed lines represent power-law fits, with the equations provided in the legend. All axes are shown on a logarithmic scale.", "description": "The chart shows the relationship between the mean squared error (MSE) and the number of training objects, environments, and environment-object pairs.", "section": "G.1 Data Scaling Laws on MSE"}, {"figure_path": "2410.18647/charts/charts_31_0.png", "caption": "Figure 21: Object generalization. Each curve corresponds to a different total numbers of demonstrations used, with normalized scores shown as a function of the number of training objects.", "description": "The chart displays the normalized scores of object generalization for Pour Water and Mouse Arrangement tasks, showing how performance varies with different numbers of training objects and data usage.", "section": "G.2 Keeping the Total Number of Demonstrations Constant"}, {"figure_path": "2410.18647/charts/charts_31_1.png", "caption": "Figure 21: Object generalization. Each curve corresponds to a different total numbers of demonstrations used, with normalized scores shown as a function of the number of training objects.", "description": "The chart displays the object generalization performance of the policies trained with varying amounts of data (2x, 4x, 8x, 16x, and 32x demonstrations) in relation to the number of training objects.", "section": "4.1 RESULTS AND QUALITATIVE ANALYSIS"}, {"figure_path": "2410.18647/charts/charts_31_2.png", "caption": "Figure 23: Generalization across environments and objects. Each curve corresponds to a different total numbers of demonstrations used, with normalized scores shown as a function of the number of training environment-object pairs.", "description": "The chart displays how the policy's generalization ability across environments and objects improves with increasing number of training environment-object pairs while keeping the total number of demonstrations relatively constant.", "section": "4.2 Power-law fitting and quantitative analysis"}]