[{"figure_path": "2410.18538/tables/table_8_0.html", "caption": "Table 1: Quantitative evaluation on SMITE-50 dataset. The results are presented for each category (Face, Horse, Car, Non-Text) having 10 reference image during training.", "description": "Table 1 presents a quantitative comparison of three methods (Baseline-I, GSAM2, and Ours) on the SMITE-50 dataset across four categories, evaluating their performance using F-measure and mIOU metrics.", "section": "5 RESULTS AND EXPERIMENTS"}, {"figure_path": "2410.18538/tables/table_9_1.html", "caption": "Table 1: Quantitative evaluation on SMITE-50 dataset. The results are presented for each category (Face, Horse, Car, Non-Text) having 10 reference image during training.", "description": "Table 1 presents a quantitative evaluation of the SMITE-50 dataset, showing the performance of different methods across various categories with 10 reference images during training.", "section": "5 RESULTS AND EXPERIMENTS"}, {"figure_path": "2410.18538/tables/table_16_0.html", "caption": "Table 1: Quantitative evaluation on SMITE-50 dataset. The results are presented for each category (Face, Horse, Car, Non-Text) having 10 reference image during training.", "description": "Table 1 presents a quantitative comparison of different methods on the SMITE-50 dataset, showing the F-measure and mIOU for each category with 10 reference images used during training.", "section": "5 RESULTS AND EXPERIMENTS"}, {"figure_path": "2410.18538/tables/table_17_0.html", "caption": "Table 1: Quantitative evaluation on SMITE-50 dataset. The results are presented for each category (Face, Horse, Car, Non-Text) having 10 reference image during training.", "description": "Table 1 presents a quantitative comparison of different methods' performance on the SMITE-50 dataset across four categories, using metrics such as F-measure and mIOU.", "section": "5 RESULTS AND EXPERIMENTS"}, {"figure_path": "2410.18538/tables/table_17_1.html", "caption": "Table 9: Image segmentation results for class horse. SMITE outperforms ReGAN, OPParts, SegDDPM, SegGPT and SLiMe on average and most of the parts. The first two rows show the supervised methods, for which we use the reported numbers in ReGAN. The middle two rows show the 1-sample setting, and the last four rows are the results of the 10-sample settings. * indicates the supervised methods.", "description": "Table 9 presents a quantitative comparison of SMITE's performance against other image segmentation methods on the \"horse\" class of the PASCAL-Part dataset, showing superior results for SMITE across various settings.", "section": "7.5 Image Segmentation Results"}, {"figure_path": "2410.18538/tables/table_19_0.html", "caption": "Table 8: Image segmentation results for class car SMITE consistently outperforms SLiMe. The first two rows show the supervised methods, for which we use the reported numbers in ReGAN. The second two rows show the methods with 1-sample setting and the last three rows refer to the 10-sample setting methods. * indicates the supervised methods.", "description": "Table 8 presents a quantitative comparison of image segmentation performance for the \"car\" class, evaluating various methods including SMITE, across different metrics and experimental settings.", "section": "5 RESULTS AND EXPERIMENTS"}, {"figure_path": "2410.18538/tables/table_19_1.html", "caption": "Table 9: Image segmentation results for class horse. SMITE outperforms ReGAN, OPParts, SegDDPM, SegGPT and SLiMe on average and most of the parts. The first two rows show the supervised methods, for which we use the reported numbers in ReGAN. The middle two rows show the 1-sample setting, and the last four rows are the results of the 10-sample settings. * indicates the supervised methods.", "description": "Table 9 presents a quantitative comparison of image segmentation performance on the class \"horse\", showing SMITE's superior performance compared to other methods under different training settings.", "section": "5 RESULTS AND EXPERIMENTS"}]