[{"figure_path": "2410.18362/tables/table_1_0.html", "caption": "Table 2: Main results on the WebSight-Test dataset.", "description": "Table 2 presents the performance comparison of different fine-tuning techniques on the WebSight-Test dataset, using metrics such as HTML Match, CW-SSIM, CLIP, and LLEM.", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_2_0.html", "caption": "Table 2: Main results on the WebSight-Test dataset.", "description": "Table 2 presents the performance comparison of different techniques on the WebSight-Test dataset using various metrics, including HTML-Match, CW-SSIM, CLIP, and LLEM.", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_3_0.html", "caption": "Table 1: Most frequent causes of failures.", "description": "The table shows the most frequent causes of failures in existing web MLLMs, categorized into seven common error types, each with a corresponding number of occurrences.", "section": "2.1 Training Data Mutation"}, {"figure_path": "2410.18362/tables/table_6_0.html", "caption": "Table 2: Main results on the WebSight-Test dataset.", "description": "Table 2 presents the performance comparison of different techniques on the WebSight-Test dataset, showing improvements achieved by WAFFLE across various metrics like HTML-Match, CW-SSIM, CLIP, and LLEM.", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_6_1.html", "caption": "Table 3: Main results on the Design2Code dataset.", "description": "Table 3 presents the performance comparison of various fine-tuning strategies on the Design2Code dataset across multiple metrics, including HTML-Match, CW-SSIM, CLIP, and Low-Level Element Matching (LLEM).", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_7_0.html", "caption": "Table 4: Ablation studies on the two test datasets. LLEM refers to the averaged Low-Level Element Matching.", "description": "Table 4 presents the performance comparison of different ablation models on two benchmark datasets, showing the impact of contrastive learning and structure-aware attention on various metrics.", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_7_1.html", "caption": "Table 5: Human evaluation on two datasets using VLM-WebSight as the backbone. The numbers are shown as \"xly (x+y)\", where x is the result on WebSight-Test and y is the result on Design2Code.", "description": "Table 5 presents human evaluation results on two datasets comparing four different techniques, showing WAFFLE's superior performance.", "section": "4.2 Ablation Studies"}, {"figure_path": "2410.18362/tables/table_7_2.html", "caption": "Table 5: Human evaluation on two datasets using VLM-WebSight as the backbone. The numbers are shown as \"xly (x+y)\", where x is the result on WebSight-Test and y is the result on Design2Code.", "description": "Table 5 presents human evaluation results on two datasets using VLM-WebSight, comparing the rankings of generated HTML code from four different techniques.", "section": "4.3 Structure-Aware Attention's Effect"}, {"figure_path": "2410.18362/tables/table_11_0.html", "caption": "Table 7: Specification for Mutation Rules to construct the Contrastive dataset.", "description": "This table shows the mutation rules used to mutate the HTML code and CSS styles for each element to create the contrastive learning dataset.", "section": "2.1 Training Data Mutation"}, {"figure_path": "2410.18362/tables/table_12_0.html", "caption": "Table 2: Main results on the WebSight-Test dataset.", "description": "Table 2 presents the performance comparison of different fine-tuning techniques on the WebSight-Test dataset, using metrics like HTML-Match, CW-SSIM, CLIP, and LLEM.", "section": "4 Results"}, {"figure_path": "2410.18362/tables/table_13_0.html", "caption": "Table 9: Distance (d) and similarity (sim) between each averaged image embeddings v² with the corresponding centroid c of the group of mutants, with Moondream2 backbone.", "description": "Table 9 shows the distance and similarity between each averaged image embedding and the centroid of its corresponding group of mutants, using the Moondream2 backbone.", "section": "4.2 Ablation Studies"}]