[{"figure_path": "2410.18745/charts/charts_3_0.png", "caption": "Figure 1: Position frequency distribution exhibits a pronounced left-skewed pattern across training data of varying lengths. Figure 1a illustrates the natural data length distribution of SlimPajama-627B where oversized data is truncated into multiple 2K sequences. Figure 1b presents the case with a uniform length distribution and the position frequency decline quadratically. Figure 1c demonstrates that when all data are concatenated into a 2K sequence, the position frequency decreases linearly with increasing position indices. The X-axis represents data length (shown in orange) and position indices (shown in blue). The left Y-axis indicates the frequency of each position, while the right Y-axis represents the number of data for each length.", "description": "The chart shows that the position frequency distribution is usually highly left-skewed across training data of varying lengths, indicating that the model is frequently exposed to small positions, while larger positions account for only a small proportion.", "section": "2 LEFT-SKEWED POSITION FREQUENCY DISTRIBUTION"}, {"figure_path": "2410.18745/charts/charts_4_0.png", "caption": "Figure 2: Analyzing effective context length of LLMs pretrained on SlimPajama with respect to training length, token consumption, and position frequency. In Figure 2b, we use the model effective length as the X-axis, and the Y-axis indicates the number of times the model was exposed to that specific position during training.", "description": "The chart displays the relationship between effective context length, consumed tokens, and position frequency in LLMs pretrained on SlimPajama dataset.", "section": "3 A PROBING EXPERIMENT ON POSITION FREQUENCY AND MODEL EFFECTIVE LENGTH"}, {"figure_path": "2410.18745/charts/charts_5_0.png", "caption": "Figure 3: Position frequency distribution for models trained with different training lengths after consuming 1T tokens. With the same number of tokens, training length has little effect on small relative positions. For example, the relative position 0 appears 4K times in both a single 4K sequence and two 2K sequences with the same total token count of 4K in each case.", "description": "The chart displays the position frequency distribution for models trained with different training lengths (2K and 4K) after consuming 1 trillion tokens, illustrating the impact of training length on the distribution of position indices.", "section": "3 A PROBING EXPERIMENT ON POSITION FREQUENCY AND MODEL EFFECTIVE LENGTH"}, {"figure_path": "2410.18745/charts/charts_6_0.png", "caption": "Figure 4: NIAH results for our pretrained model TinyLlama-1.3B (2K) and Llama3.1 (128K) where the X-axis means input context length and the Y-axis represents the document depth. In this figure, we clearly observe that for TinyLlama 2K and Llama3.1 128K, most poor-performing cases are concentrated in the lower-left triangle, indicating that the models are unable to gather distant needles.", "description": "The heatmaps show the performance of two LLMs on the Needle-in-a-Haystack task, revealing that their ability to retrieve distant needles significantly degrades as the distance between the query and the needle increases.", "section": "Limitations in Gathering Distant Inputs"}, {"figure_path": "2410.18745/charts/charts_6_1.png", "caption": "Figure 1: Position frequency distribution exhibits a pronounced left-skewed pattern across training data of varying lengths. Figure 1a illustrates the natural data length distribution of SlimPajama-627B where oversized data is truncated into multiple 2K sequences. Figure 1b presents the case with a uniform length distribution and the position frequency decline quadratically. Figure 1c demonstrates that when all data are concatenated into a 2K sequence, the position frequency decreases linearly with increasing position indices. The X-axis represents data length (shown in orange) and position indices (shown in blue). The left Y-axis indicates the frequency of each position, while the right Y-axis represents the number of data for each length.", "description": "The chart displays the left-skewed position frequency distribution across various training data lengths, highlighting the underrepresentation of long-distance positions.", "section": "2 LEFT-SKEWED POSITION FREQUENCY DISTRIBUTION"}, {"figure_path": "2410.18745/charts/charts_10_0.png", "caption": "Figure 7: Ablation study on the local window W and shifted offset S where L is the training length.", "description": "The ablation study shows the effect of local window size and shifted offset size on the performance of four different LLMs on the Needle-in-a-Haystack task.", "section": "4 SHIFTED ROTARY POSITION EMBEDDING"}, {"figure_path": "2410.18745/charts/charts_10_1.png", "caption": "Figure 7: Ablation study on the local window W and shifted offset S where L is the training length.", "description": "The chart displays the ablation study results on the local window size (W) and shifted offset size (S) parameters of STRING across four different LLMs with varying training lengths, showing how these parameters impact model performance on the Needle-in-a-Haystack task.", "section": "4 SHIFTED ROTARY POSITION EMBEDDING"}, {"figure_path": "2410.18745/charts/charts_18_0.png", "caption": "Figure 9: Efficiency Test of STRING and the standard Flash Attention based on Llama3.1 8B. All experiments are run on a single NVIDIA 80G A100 GPU.", "description": "The chart compares the inference time and GPU memory consumption of STRING and standard Flash Attention on Llama3.1 8B with varying input lengths.", "section": "A.3 EFFICIENCY TEST OF STRING"}]