[{"figure_path": "2410.16271/tables/table_7_0.html", "caption": "Table 1. Quantitative results on the LLFF [49] dataset. FrugalNeRF performs competitively with baseline methods in extreme few-shot settings, offering shorter training time without relying on externally learned priors. Integrating monocular depth regularization further improves quality while maintaining fast convergence. Results differ from SimpleNeRF's paper but match its supplementary document, as we evaluate full images without visibility masks.", "description": "Table 1 presents a quantitative comparison of FrugalNeRF against other state-of-the-art few-shot NeRF methods across different metrics (PSNR, SSIM, LPIPS) and training times, using various numbers of input views (2, 3, and 4).", "section": "4.1 Comparisons"}, {"figure_path": "2410.16271/tables/table_8_0.html", "caption": "Table 2. Quantitative results on the DTU [32] dataset. FrugalNeRF synthesizes better images than most of the other baselines under extreme few-shot settings but with shorter training time and does not rely on any externally learned priors. Additionally, integrating monocular depth model regularization further improves quality while maintaining fast convergence. We follow SparseNeRF [81] to remove the background when computing metrics.", "description": "Table 2 presents a quantitative comparison of FrugalNeRF against other state-of-the-art methods on the DTU dataset using various metrics such as PSNR, SSIM, and LPIPS across different numbers of input views.", "section": "4.1 Comparisons"}, {"figure_path": "2410.16271/tables/table_8_1.html", "caption": "Table 3. Comparison of a different number of scales on the LLFF dataset.", "description": "The table shows the effect of increasing the number of scales on the rendering quality and training time of the FrugalNeRF model.", "section": "4.2. Ablation Studies"}, {"figure_path": "2410.16271/tables/table_17_0.html", "caption": "Table 5. Comparison of the time complexity.", "description": "The table compares the computational efficiency (MFLOPs per pixel) of FrugalNeRF against several state-of-the-art methods.", "section": "4.1 Comparisons"}, {"figure_path": "2410.16271/tables/table_20_0.html", "caption": "Table 6. Quantitative results on the LLFF [48] dataset with two input views. The three rows show LPIPS, SSIM, and PSNR scores, respectively.", "description": "Table 6 presents a quantitative comparison of FrugalNeRF and other state-of-the-art methods on the LLFF dataset using two input views, evaluating performance using LPIPS, SSIM, and PSNR.", "section": "4.1 Comparisons"}, {"figure_path": "2410.16271/tables/table_22_1.html", "caption": "Table 1. Quantitative results on the LLFF [49] dataset. FrugalNeRF performs competitively with baseline methods in extreme few-shot settings, offering shorter training time without relying on externally learned priors. Integrating monocular depth regularization further improves quality while maintaining fast convergence. Results differ from SimpleNeRF's paper but match its supplementary document, as we evaluate full images without visibility masks.", "description": "Table 1 presents a quantitative comparison of FrugalNeRF against several state-of-the-art few-shot NeRF methods across different metrics (PSNR, SSIM, LPIPS) and training times, using various numbers of input views (2, 3, 4).", "section": "4.1 Comparisons"}, {"figure_path": "2410.16271/tables/table_23_0.html", "caption": "Table 13. Quantitative results on the RealEstate-10K [100] dataset with two input views. The three rows show LPIPS, SSIM, and PSNR scores, respectively.", "description": "Table 13 presents a quantitative comparison of FrugalNeRF against other state-of-the-art methods on the RealEstate-10K dataset using two input views, evaluating performance based on LPIPS, SSIM, and PSNR.", "section": "4. Experiments"}, {"figure_path": "2410.16271/tables/table_24_0.html", "caption": "Table 15. Quantitative results on the RealEstate-10K [100] dataset with four input views. The three rows show LPIPS, SSIM, and PSNR scores, respectively.", "description": "Table 15 presents a quantitative comparison of different methods' performance on the RealEstate-10K dataset using four input views, evaluating LPIPS, SSIM, and PSNR scores.", "section": "4. Experiments"}]