[{"figure_path": "2410.12788/figures/figures_3_0.png", "caption": "Figure 1: Overview of RAG pipeline, as well as examples based on rules, similarity, and PPL segmentation. The same background color represents being located in the same chunk.", "description": "The figure illustrates the RAG pipeline and compares three different text chunking methods based on rules, similarity, and perplexity.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.12788/figures/figures_4_0.png", "caption": "Figure 2: Overview of the entire process of Meta-Chunking. Each circle represents a complete sentence, and the sentence lengths are not consistent. The vertical lines indicate where to segment. The two sides at the bottom of the figure reveal Margin Sampling Chunking and Perplexity Chunking. Circles with the same background color represent a meta-chunk, which is dynamically combined to make the final chunk length meet user needs.", "description": "The figure illustrates the Meta-Chunking process, showing how margin sampling and perplexity methods dynamically combine sentences into chunks of varying lengths to maintain logical coherence.", "section": "2.1 Meta-Chunking"}, {"figure_path": "2410.12788/figures/figures_9_0.png", "caption": "Figure 2: Overview of the entire process of Meta-Chunking. Each circle represents a complete sentence, and the sentence lengths are not consistent. The vertical lines indicate where to segment. The two sides at the bottom of the figure reveal Margin Sampling Chunking and Perplexity Chunking. Circles with the same background color represent a meta-chunk, which is dynamically combined to make the final chunk length meet user needs.", "description": "The figure illustrates the process of Meta-Chunking, showing how sentences are grouped into meta-chunks and dynamically combined to achieve desired chunk sizes.", "section": "2.1 Meta-Chunking"}, {"figure_path": "2410.12788/figures/figures_9_1.png", "caption": "Figure 3: Performance of different methods on single-hop query in the CRUD QA dataset. ppl represents direct PPL Chunking, with a threshold of 0.5. comb. indicates PPL Chunking with dynamic combination, with a threshold of 0 when performing PPL Chunking. Precise chunk length results and performance of remaining multi-hop scenarios are included in Appendix A.3.", "description": "The figure shows the performance comparison of different text chunking methods on a single-hop query task from the CRUD QA dataset, highlighting the effectiveness of PPL Chunking with dynamic combination.", "section": "4.2 Analysis"}]