[{"figure_path": "2410.15633/charts/charts_9_0.png", "caption": "Figure 3: The comparison between samples with top 1% and least 1% scored by our method.", "description": "The radar chart compares the average scores of five aspects (coherence, necessity, helpfulness, faithfulness, and complexity) between the top 1% and bottom 1% of samples selected by the GATEAU method.", "section": "4.3 DISCUSSION"}, {"figure_path": "2410.15633/charts/charts_10_0.png", "caption": "Figure 4: Average score (%) under different context lengths on LongBench.", "description": "The chart displays the average scores achieved by different models across various context lengths on the LongBench benchmark, comparing the performance of models trained with different amounts of data selected by the proposed method and baselines.", "section": "4.2 IMPACT OF GATEAU"}, {"figure_path": "2410.15633/charts/charts_10_1.png", "caption": "Figure 5: Human evaluation in two settings.", "description": "The chart displays the results of a human evaluation comparing the performance of models trained with different percentages of the dataset in both real-world and limited short instruction data settings.", "section": "4.2 IMPACT OF GATEAU"}, {"figure_path": "2410.15633/charts/charts_22_0.png", "caption": "Figure 6: Results (%) on LongBench-Chat with different hyperparameter α in Eq. (6).", "description": "The bar chart displays the performance of the GATEAU-LLaMA-50% model on the LongBench-Chat benchmark across different values of the hyperparameter α in real-world and limited short instruction data settings.", "section": "D.3 PARAMETER STUDY"}, {"figure_path": "2410.15633/charts/charts_22_1.png", "caption": "Figure 6: Results (%) on LongBench-Chat with different hyperparameter α in Eq. (6).", "description": "The chart displays the performance of GATEAU-LLAMA-50% on LongBench-Chat under real-world and limited short instruction data settings with varying hyperparameter α values in equation 6.", "section": "D.3 PARAMETER STUDY"}]