[{"figure_path": "2410.15633/tables/table_6_1.html", "caption": "Table 2: Results (%) on LongBench in Limited Short Instruction Data Settings.", "description": "Table 2 presents the performance comparison of different models on the LongBench benchmark under limited short instruction data settings, showing the impact of various data selection methods on model capabilities.", "section": "4.2 IMPACT OF GATEAU"}, {"figure_path": "2410.15633/tables/table_7_1.html", "caption": "Table 4: Results (%) on MT-Bench in both Real-world and Limited Short Instruction Data Settings.", "description": "Table 4 presents the performance of various models on the MT-Bench benchmark, comparing results in real-world and limited short instruction data settings.", "section": "4.2 Impact of GATEAU"}, {"figure_path": "2410.15633/tables/table_9_0.html", "caption": "Table 5: Results (%) of ablation study and scalability test.", "description": "Table 5 presents the ablation study and scalability test results, showing the impact of removing key components of GATEAU and the effect of scaling up the model size.", "section": "4.2 IMPACT OF GATEAU"}, {"figure_path": "2410.15633/tables/table_17_0.html", "caption": "Table 1: Results (%) on LongBench in Real-world Settings. We use the ID to represent the dataset in LongBench, e.g., 1-1 is the ID of NarrativeQA dataset. More details can be found in Appendix C.2.", "description": "Table 1 presents the performance results of different models on the LongBench benchmark in real-world settings, comparing various data selection methods and their impact on instruction following and long context understanding.", "section": "4.1 EXPERIMENTAL SETUP"}, {"figure_path": "2410.15633/tables/table_18_0.html", "caption": "Table 7: Detailed results (%) of MT-Bench.", "description": "Table 7 presents a detailed breakdown of the MT-Bench results, showing the performance of various models across different tasks and settings.", "section": "4.2 IMPACT OF GATEAU"}, {"figure_path": "2410.15633/tables/table_21_0.html", "caption": "Table 8: Further exploration of Homologous Model's Guidance.", "description": "Table 8 presents the ablation study results on three benchmarks to further explore the impact of the Homologous Model's Guidance.", "section": "4.2 IMPACT OF GATEAU"}]