[{"figure_path": "2410.18977/charts/charts_6_0.png", "caption": "Figure 4: Motion editing via manipulating attention maps.", "description": "The figure illustrates three motion editing methods (motion de-emphasizing, in-place motion replacement, and motion sequence shifting) by manipulating attention maps.", "section": "Versatile Applications via Attention Manipulations"}, {"figure_path": "2410.18977/charts/charts_6_1.png", "caption": "Figure 4: Motion editing via manipulating attention maps.", "description": "The chart illustrates three motion editing methods (motion (de-)emphasizing, in-place motion replacement, motion sequence shifting) by manipulating attention maps.", "section": "4 Versatile Applications via Attention Manipulations"}, {"figure_path": "2410.18977/charts/charts_7_0.png", "caption": "Figure 5: Motion (de-)emphasizing. Different weights of \"jump\" (↑ or ↓) in \"a man jumps.\"", "description": "The chart visualizes the impact of modifying the weight of the word \"jump\" on the height of jumps in generated motion sequences.", "section": "5.2 Inference Only Motion Editing"}, {"figure_path": "2410.18977/charts/charts_9_0.png", "caption": "Figure 8: t-SNE visualization of different example-based generated results. Different colors imply different driven examples.", "description": "t-SNE visualization shows that diverse motions generated from the same example motion share similar motion textures, and different examples are well separated.", "section": "5 Experiments"}, {"figure_path": "2410.18977/charts/charts_10_0.png", "caption": "Figure 12: Action counting error rate comparison. Root trajectory (Traj.) vs. attention map (Ours). “σ” is the smoothing parameter.", "description": "The chart compares the error rates of action counting using root trajectory and attention map, showing that attention map-based counting is less sensitive to noise.", "section": "5.4 Action Counting from Attention Map"}, {"figure_path": "2410.18977/charts/charts_20_0.png", "caption": "Figure 14: Additional visualization results for different (de-)emphasizing weights. The self-attention maps show how varying the different weights (e.g., ↓ 0.05, ↓ 0.10, ↑ 0.33, and ↑ 1.00) affect the emphasis on motion.", "description": "The self-attention maps for different (de-)emphasizing weights show how varying weights affect motion emphasis.", "section": "A Supplemental Experiments"}, {"figure_path": "2410.18977/charts/charts_21_0.png", "caption": "Figure 15: The effect of varying w in classifier-free guidance on generated motions. While changing w influences the general alignment between the text \"a man jumps.\" and the generated motion, it does not provide precise control over finer details like jump height and frequency.", "description": "The chart displays the effect of varying classifier-free guidance weights (w) on the height of generated jumps, showing that while it affects overall alignment, it lacks fine-grained control over jump height and frequency.", "section": "A.2 What is the Difference between Motion (De-)emphasizing in MotionCLR and Adjusting Classifier-free Guidance Weights?"}, {"figure_path": "2410.18977/charts/charts_27_0.png", "caption": "Figure 20: Comparison between w/ vs. w/o grounded motion generation settings. The root height and motion visualization of the textual prompt “a person jumps four times”.", "description": "The chart compares the root height trajectory of a generated motion with and without temporal grounding, showing the improvement in aligning the generated motion with the textual prompt when temporal grounding is used.", "section": "A.8 Detailed Visualization Results of Grounded Motion Genration"}, {"figure_path": "2410.18977/charts/charts_34_0.png", "caption": "Figure 26: Empirical study of attention patterns. We use the example “a person walks stop and then jumps.” (a) Horizontal distance traveled by the person over time, highlighting distinct walking and jumping phases. (b) The vertical height changes of the person, indicating variations during walking and jumping actions. (c) The cross-attention map between timesteps and the described actions. Notice that “walk” and “jump” receive a stronger attention signal corresponding to the walk and jump segments. (d) The self-attention map, which clearly identifies repeated walking and jumping cycles, shows similar patterns in the sub-actions. (e) Visualization of the motion sequences, demonstrating the walking and jumping actions.", "description": "Figure 26 shows an empirical study of attention mechanisms by visualizing horizontal distance, vertical height, cross-attention, self-attention maps, and motion visualization of a \"person walks, stops, and then jumps\" example, highlighting distinct phases and patterns.", "section": "3.4 Empirical Evidence on Understanding Attention Mechanisms"}]