[{"figure_path": "2410.18798/figures/figures_2_0.png", "caption": "Figure 1: Error distribution of incorrect answers by MiniCPM-V2.5-Llama3 (Yao et al., 2024) on ChartQA test set (Masry et al., 2022), as judged by GPT-40. We present an example chart from ChartQA along with two error cases: one for recognition and one for reasoning. The \"Other Errors\" include question misunderstood errors, knowledge and hallucination errors, or refusal to answer.", "description": "The figure shows the error distribution of a language model on a chart question answering benchmark, highlighting the common error types of recognition and reasoning mistakes.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.18798/figures/figures_5_0.png", "caption": "Figure 2: Overview of the Code-as-Intermediary Translation (CIT) method for synthesizing multimodal instruction data. The process begins with 33 seed codes and generates plot codes across various chart types, topics, and complexity levels through the Self-Instruct and Evol-Instruct stages. The chart set and instruction set are constructed bi-directionally, and the final filtered data yields REACHQA, a dataset for distilling visual chart reasoning abilities from LLMs to MLLMs.", "description": "The figure illustrates the Code-as-Intermediary Translation (CIT) method used to create the REACHQA dataset, showing how seed codes are expanded, charts are generated, and instructions are created and filtered.", "section": "3 REACHQA: SYNTHESIZING CHART Q&A WITH CIT"}, {"figure_path": "2410.18798/figures/figures_10_0.png", "caption": "Figure 1: Error distribution of incorrect answers by MiniCPM-V2.5-Llama3 (Yao et al., 2024) on ChartQA test set (Masry et al., 2022), as judged by GPT-40. We present an example chart from ChartQA along with two error cases: one for recognition and one for reasoning. The \"Other Errors\" include question misunderstood errors, knowledge and hallucination errors, or refusal to answer.", "description": "The figure shows the error distribution of a language model on a chart question answering benchmark, highlighting the proportions of errors due to misrecognition and reasoning issues.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.18798/figures/figures_17_0.png", "caption": "Figure 6: Visualizations of different chart-related training datasets. As shown, REACHQA and ChartGemma exhibit higher chart richness compared to several other datasets. But the charts in ChartGemma require manual collection from multiple sources (Masry et al., 2024b).", "description": "Figure 6 presents a visual comparison of chart visualizations from various datasets, highlighting the increased complexity and diversity of charts in REACHQA compared to other datasets.", "section": "2 BACKGROUND"}, {"figure_path": "2410.18798/figures/figures_17_1.png", "caption": "Figure 6: Visualizations of different chart-related training datasets. As shown, REACHQA and ChartGemma exhibit higher chart richness compared to several other datasets. But the charts in ChartGemma require manual collection from multiple sources (Masry et al., 2024b).", "description": "Figure 6 shows visualizations of charts from various datasets, highlighting the increased visual complexity and diversity in REACHQA compared to other datasets.", "section": "2 BACKGROUND"}, {"figure_path": "2410.18798/figures/figures_17_2.png", "caption": "Figure 6: Visualizations of different chart-related training datasets. As shown, REACHQA and ChartGemma exhibit higher chart richness compared to several other datasets. But the charts in ChartGemma require manual collection from multiple sources (Masry et al., 2024b).", "description": "Figure 6 shows visualizations of charts from various chart datasets, highlighting the increased visual complexity and diversity in REACHQA compared to other datasets.", "section": "2 BACKGROUND"}, {"figure_path": "2410.18798/figures/figures_17_3.png", "caption": "Figure 6: Visualizations of different chart-related training datasets. As shown, REACHQA and ChartGemma exhibit higher chart richness compared to several other datasets. But the charts in ChartGemma require manual collection from multiple sources (Masry et al., 2024b).", "description": "Figure 6 presents visualizations of charts from various datasets, highlighting the increased visual complexity and diversity in REACHQA compared to others.", "section": "2 BACKGROUND"}]