{"references": [{" publication_date": "2023", "fullname_first_author": "Sina Alemohammad", "paper_title": "Self-consuming generative models go mad.", "reason": "This paper is highly relevant because it directly addresses the issue of model degradation caused by training on increasingly AI-generated data, a key concern that underpins the entire premise of the survey paper.  The study's findings about the negative impact of self-consuming on model abilities directly support the survey's focus on dataset quality and its implications for the reliability of AI detection models.", "section_number": 1}, {" publication_date": "2023", "fullname_first_author": "Ebtesam Almazrouei", "paper_title": "The falcon series of open language models.", "reason": "This paper describes a set of new language models which are used in multiple downstream tasks, including the task of AI-generated text detection. Having detailed information on the models' generation capabilities is crucial for evaluating the quality of datasets used in assessing these detectors.", "section_number": 1}, {" publication_date": "2024", "fullname_first_author": "Guangsheng Bao", "paper_title": "Fast-detectgpt: Efficient zero-shot detection of machine-generated text via conditional probability curvature.", "reason": "The paper presents a novel method for AI detection. The description of this method provides crucial background information on the state-of-the-art approaches which the survey paper employs and evaluates.  Understanding this method's strengths and weaknesses is important to understanding the paper's evaluation framework.", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Pengcheng He", "paper_title": "Debertav3: Improving deberta using electra-style pre-training with gradient-disentangled embedding sharing.", "reason": "This paper is highly relevant because it describes the DeBERTa model, which is a key component of the experimental approach in the survey.  The performance of the DeBERTa classifier is a central focus of the paper's evaluation, and the details about the model's capabilities are crucial for interpreting the results. ", "section_number": 4}, {" publication_date": "2021", "fullname_first_author": "Pengcheng He", "paper_title": "Deberta: Decoding-enhanced bert with disentangled attention.", "reason": "This paper describes the core DeBERTa model architecture used in the survey. Understanding its architectural details is crucial for assessing the findings and limitations of the experiments conducted with this model.", "section_number": 4}, {" publication_date": "2020", "fullname_first_author": "Daphne Ippolito", "paper_title": "Automatic detection of generated text is easiest when humans are fooled.", "reason": "This paper is crucial because it provides context and understanding of the inherent difficulties of AI-generated text detection, highlighting a key challenge for the survey. It directly supports the study's main argument about the need for robust evaluation methods.", "section_number": 2}, {" publication_date": "2020", "fullname_first_author": "Ganesh Jawahar", "paper_title": "Automatic detection of machine generated text: A critical survey.", "reason": "This paper is crucial background reading as it provides context, highlighting previous research on the topic and methodologies employed.  It helps frame the contributions of the current paper, showing how its approach builds upon and expands on the work of others.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Yury Kashnitsky", "paper_title": "Overview of the DAGPap22 shared task on detecting automatically generated scientific papers.", "reason": "This paper describes the DAGPap2022 dataset, one of the main datasets analysed in the survey.  It provides crucial context about the dataset's features and the task it was designed for, helping in understanding its implications in the overall evaluation.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Areg Mikael Sarvazyan", "paper_title": "Overview of autextification at iberlef 2023: Detection and attribution of machine-generated text in multiple domains.", "reason": "The paper presents the AuTexTification 2023 dataset, a significant dataset analysed in the survey. This background information about the dataset is essential to understanding the characteristics of this data and interpreting how its properties influence the survey's evaluation.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Areg Mikael Sarvazyan", "paper_title": "Overview of iberautextification at iberlef 2024: Detection and attribution of machine-generated text on languages of the iberian peninsula.", "reason": "This paper presents the IberAuTexTification 2024 dataset, which is central to the survey's empirical evaluation. The dataset's description is vital for understanding its characteristics and interpreting the impact of these characteristics on the survey's results.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Abinew Ali Ayele", "paper_title": "Overview of PAN 2024: Multi-Author Writing Style Analysis, Multilingual Text Detoxification, Oppositional Thinking Analysis, and Generative AI Authorship Verification.", "reason": "This paper is key because it presents the PAN 2024 dataset, which forms an important part of the empirical study.  Details about the dataset's composition and task are needed to properly evaluate the study's methodology and findings related to this particular dataset.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Yuxia Wang", "paper_title": "Semeval-2024 task 8: Multi-generator, multidomain, and multilingual black-box machine-generated text detection.", "reason": "This paper presents SemEval 2024 Task 8, a significant dataset central to the survey. The detail on the dataset's features is crucial to understanding the data and interpreting the findings from its use in the study.", "section_number": 3}, {" publication_date": "2019", "fullname_first_author": "Alec Radford", "paper_title": "Language models are unsupervised multitask learners.", "reason": "This is a highly influential paper introducing GPT-2, one of the models whose output is examined in the survey.  Understanding the strengths and weaknesses of GPT-2 is essential for interpreting the quality and characteristics of the data derived from it.", "section_number": 3}, {" publication_date": "2023", "fullname_first_author": "Sina Alemohammad", "paper_title": "Self-consuming generative models go mad.", "reason": "This paper highlights the potential problem of model degradation due to excessive reliance on AI-generated data for training. This is a key concern that directly relates to the survey's main argument on the quality of datasets. The self-consuming issue is a major problem which this paper addresses.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Xinlei He", "paper_title": "MGTBench: Benchmarking Machine-Generated Text Detection", "reason": "This paper introduces a new benchmark dataset for machine-generated text detection (MGTBench), which is analysed within the survey. The study uses it as an important dataset for empirical evaluation, meaning that its description is crucial to interpret the findings.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Yafu Li", "paper_title": "Mage: Machine-generated text detection in the wild.", "reason": "This paper introduces the MAGE dataset, which is used for evaluation in the study. Having a thorough description of the dataset is important for contextualizing the results and limitations of the survey's empirical analysis.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Yuxia Wang", "paper_title": "Multilingual e5 text embeddings: A technical report.", "reason": "This paper introduces a multilingual text embedding model which is used in the evaluation section. This paper is significant for interpreting the methodology of the survey and the limitations related to the choice of multilingual models for evaluation.", "section_number": 5}, {" publication_date": "2023", "fullname_first_author": "Eric Mitchell", "paper_title": "Detectgpt: zero-shot machine-generated text detection using probability curvature.", "reason": "This paper introduces the DetectGPT framework, a key model used in the survey's evaluation. Understanding this method is important for interpreting the evaluation methodology used in the survey and for analyzing the obtained results.", "section_number": 4}, {" publication_date": "2024", "fullname_first_author": "Abhimanyu Hans", "paper_title": "Spotting LLMs with binoculars: Zero-shot detection of machine-generated text.", "reason": "This paper introduces the Binoculars method, which is a key method in the study's experimental evaluation.  A thorough understanding of the method's capabilities is crucial to contextualizing the findings and conclusions of the survey.", "section_number": 4}, {" publication_date": "2023", "fullname_first_author": "Eduard Tulchinskii", "paper_title": "Intrinsic dimension estimation for robust detection of ai-generated texts.", "reason": "This paper is highly important because it introduces a novel method (Topological Time Series) that is central to the experimental design of the survey.  The description of this method is essential for interpreting the results of the study and understanding its implications for dataset evaluation.", "section_number": 4}]}