{"references": [{" publication_date": "2021", "fullname_first_author": "Jonathan T Barron", "paper_title": "Mip-nerf: A multiscale representation for anti-aliasing neural radiance fields", "reason": "This paper is foundational for the field of neural radiance fields (NeRFs), introducing the concept of multiscale representation for anti-aliasing, which significantly improves the quality of generated images.  The techniques presented in this paper have direct relevance to the topic of the current paper and serves as a key foundation for many of the advanced techniques and approaches developed in the field of novel view synthesis.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Jonathan T. Barron", "paper_title": "Mip-nerf 360: Unbounded anti-aliased neural radiance fields", "reason": "This paper extends the work of Mip-NeRF by enabling the generation of unbounded, anti-aliased neural radiance fields. The extension to unbounded scenes is crucial to the approach in the current paper because it makes it possible to improve the performance of the 3DGS algorithm in a broader range of scenarios, allowing it to be tested on data which has the quality of the original images and allows the study of its behavior on the datasets which are known to be very challenging for 3DGS.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Jonathan T. Barron", "paper_title": "Zip-nerf: Anti-aliased grid-based neural radiance fields", "reason": "This paper is significant for its introduction of anti-aliased grid-based neural radiance fields, which offers a different approach to generating high-quality images.  The authors of the current paper also use anti-aliasing, and this reference helps to contextualize and justify their choice of technique.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Andreas Blattmann", "paper_title": "Stable video diffusion: Scaling latent video diffusion models to large datasets", "reason": "This paper is highly relevant because it introduces a method for scaling latent video diffusion models to large datasets.  The current paper uses a video diffusion model, and understanding how to effectively scale these models to handle large datasets is critical for the overall performance of the 3DGS-Enhancer.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "David Charatan", "paper_title": "pixelsplat: 3d gaussian splats from image pairs for scalable generalizable 3d reconstruction", "reason": "This work focuses on creating 3D Gaussian splats from image pairs, which is directly relevant to the current work, which uses 3D Gaussian Splatting (3DGS) as a foundation.  The techniques described in this paper could serve as a useful comparison or inspiration for the current work.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Anpei Chen", "paper_title": "Tensorf: Tensorial radiance fields", "reason": "This paper introduces the concept of tensorial radiance fields, which are a more expressive and capable alternative to traditional radiance fields. This paper is a highly relevant reference because it introduces novel techniques that improve rendering performance. The techniques described here are also relevant to improving the quality of the renderings which the current paper focuses on.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Zilong Chen", "paper_title": "V3d: Video diffusion models are effective 3d generators", "reason": "This paper is highly relevant because it demonstrates that video diffusion models can be used to generate effective 3D models. This is directly relevant to the approach taken in the current paper, which leverages the power of video diffusion models to improve 3D Gaussian splatting, which greatly increases the efficacy of the model.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Sara Fridovich-Keil", "paper_title": "Plenoxels: Radiance fields without neural networks", "reason": "This paper introduces a novel approach to radiance fields that does not rely on neural networks, offering a potential alternative to the methods used in the current paper.  Exploring different approaches to radiance fields is valuable because it helps to understand the strengths and weaknesses of various techniques.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Guangcong", "paper_title": "Sparsenerf: Distilling depth ranking for few-shot novel view synthesis", "reason": "This paper introduces a novel method for few-shot novel view synthesis that addresses the challenges of generating high-quality renderings from limited input views. This is highly relevant because it also tackles the issues of limited input views and the need for high-quality rendering.", "section_number": 2}, {" publication_date": "2024", "fullname_first_author": "Yuwei Guo", "paper_title": "Animatediff: Animate your personalized text-to-image diffusion models without specific tuning", "reason": "This paper is relevant to the current paper because it explores the use of diffusion models for image generation. This is directly relevant to the approach taken in the current paper, which also leverages the power of diffusion models to enhance 3D Gaussian splatting.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Jonathan Ho", "paper_title": "Imagen video: High definition video generation with diffusion models", "reason": "This paper introduces a method for high-definition video generation using diffusion models, which is directly relevant to the current work, which also uses a video diffusion model. This paper is a highly relevant citation because it is a significant contribution to the field and provides useful techniques.", "section_number": 2}, {" publication_date": "2022", "fullname_first_author": "Jonathan Ho", "paper_title": "Video diffusion models", "reason": "This paper introduces the concept of video diffusion models, which are a powerful tool for video generation and manipulation.  The current paper uses a video diffusion model as a key component of its proposed 3DGS-Enhancer method, so this paper is extremely relevant as the foundational paper for that technique.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Xudong Huang", "paper_title": "Refsr-nerf: Towards high fidelity and super resolution view synthesis", "reason": "This paper focuses on improving the fidelity and resolution of view synthesis, which is the main goal of the current paper.  The techniques and approaches described in this paper may offer valuable insights and potential solutions to the challenges faced in this field of research.", "section_number": 2}, {" publication_date": "2021", "fullname_first_author": "Ajay Jain", "paper_title": "Putting nerf on a diet: Semantically consistent few-shot view synthesis", "reason": "This paper introduces a method for few-shot view synthesis that is both efficient and semantically consistent. This is highly relevant to the current paper because it also addresses the challenges of generating high-quality renderings from limited input views.  The techniques presented in this paper may inspire new solutions or approaches.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Yifan Jiang", "paper_title": "Alignerf: High-fidelity neural radiance fields via alignment-aware training", "reason": "This paper presents a method for generating high-fidelity neural radiance fields using alignment-aware training.  The alignment aspect is directly relevant to the problem of view consistency, which is a central challenge addressed in the current paper.  The techniques presented in this paper could also be useful.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Bernhard Kerbl", "paper_title": "3d gaussian splatting for real-time radiance field rendering", "reason": "This paper is the foundational paper for 3D Gaussian Splatting (3DGS), the method that the current paper aims to enhance. Understanding the fundamentals of 3DGS is crucial for evaluating the contributions and impact of the 3DGS-Enhancer method.", "section_number": 3}, {" publication_date": "2024", "fullname_first_author": "Jiahe Li", "paper_title": "DNGaussian: Optimizing sparse-view 3d gaussian radiance fields with global-local depth normalization", "reason": "This paper is highly relevant to the current work because it also focuses on optimizing sparse-view 3D Gaussian radiance fields.  The authors in this paper explore a different approach to optimization, offering insights into the challenges of this particular type of problem and potential techniques for solving it.", "section_number": 2}, {" publication_date": "2023", "fullname_first_author": "Lu Ling", "paper_title": "Dl3dv-10k: A large-scale scene dataset for deep learning-based 3d vision", "reason": "This paper introduces a large-scale scene dataset that is used to train and evaluate the 3DGS-Enhancer method.  Having access to a large, high-quality dataset is crucial for developing and evaluating novel view synthesis methods.  This paper helps to contextualize and justify the choice of dataset in the current paper.", "section_number": 5}, {" publication_date": "2022", "fullname_first_author": "Xiaoxiao Long", "paper_title": "Sparseneus: Fast generalizable neural surface reconstruction from sparse views", "reason": "This paper is highly relevant to the current paper because it introduces a method for fast and generalizable neural surface reconstruction from sparse views. This is directly relevant to the goal of the current paper, which is to enhance the performance of 3D Gaussian splatting in scenarios with sparse input views.", "section_number": 2}]}