[{"figure_path": "2410.16259/figures/figures_1_0.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent's ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure illustrates the Agent-to-Sim (ATS) framework, showing how 4D spacetime reconstruction from casual longitudinal videos enables learning and simulation of interactive agent behaviors.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_2_0.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent’s ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure illustrates the Agent-to-Sim (ATS) framework, showing how 4D spacetime reconstruction from casual longitudinal videos enables learning and simulation of interactive agent behaviors.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_2_1.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent’s ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure illustrates the Agent-to-Sim (ATS) framework, showing the 4D spacetime reconstruction from casual longitudinal videos and the interactive behavior simulator learned from it.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_2_2.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent's ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure shows the Agent-to-Sim (ATS) framework, illustrating the 4D spacetime reconstruction from longitudinal casual videos and the interactive behavior simulator that learns agent behaviors from this reconstruction.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_6_0.png", "caption": "Figure 2: Pipeline for behavior generation. We encode egocentric information into a perception code w, conditioned on which we generate fully body motion in a hierarchical fashion. We start by generating goals Z, then paths P and finally body poses G. Each node is represented by the gradient of its log distribution, trained with denoising objectives (Eq. 8). Given G, the full body motion of an agent can be computed via blend skinning (Eq. 3).", "description": "This figure illustrates the hierarchical pipeline used for generating the agent's behavior, which involves encoding egocentric information and generating goals, paths, and body poses sequentially.", "section": "3.3 INTERACTIVE BEHAVIOR GENERATION"}, {"figure_path": "2410.16259/figures/figures_7_0.png", "caption": "Figure 3: Comparison on multi-video scene reconstruction. We show birds-eye-view rendering of the reconstructed scene using the bunny dataset. Compared to TotalRecon that does not register multiple videos, ATS produces higher-quality scene reconstruction. Neural localizer (NL) and featuremetric losses (FBA) are shown important for camera registration. Scene annealing is important for reconstructing a complete scene from partial video captures.", "description": "Figure 3 shows a comparison of multi-video scene reconstruction results using different methods, highlighting the impact of neural localization, featuremetric losses, and scene annealing on reconstruction quality.", "section": "4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/figures/figures_9_0.png", "caption": "Figure 4: Analysis of conditioning signals. We show results of removing one conditioning signal at a time. Removing observer conditioning and past trajectory conditioning makes the sampled goals more spread out (e.g., regions both in front of the agent and behind the agent); removing the environment conditioning introduces infeasible goals that penetrate the ground and the walls.", "description": "Figure 4 shows an ablation study on the effect of conditioning signals for goal generation, demonstrating that all three signals (user, past trajectory, and environment) contribute to generating realistic goals.", "section": "Analysing Interactions"}, {"figure_path": "2410.16259/figures/figures_10_0.png", "caption": "Figure 5: Results of 4D reconstruction. Top: reference images and renderings. Background color represents correspondence. Colored blobs on the cat represent B = 25 bones (e.g., head is represented by the yellow blob). The magenta colored lines represents reconstructed trajectories of each blob in the world space. Bottom: Bird’s eye view of the reconstructed scene and agent trajectories, registered to the same scene coordinate. Each colored line represents a unique video sequence where boxes and spheres indicate the starting and the end location.", "description": "The figure shows the results of a 4D reconstruction of an agent (cat) and its environment from multiple video sequences, displaying both individual frames and a bird's-eye view of the registered trajectories.", "section": "4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/figures/figures_18_0.png", "caption": "Figure 6: Qualitative comparison with TotalRecon (Song et al., 2023) on 4D reconstruction. Top: reconstruction of the agent at at specific frame. Total-recon produces shapes with missing limbs and bone transformations that are misaligned with the shape, while our method produces complete shapes and good alignment. Bottom: reconstruction of the environment. TotalRecon produces distorted and incomplete geometry (due to lack of observations from a single video), while our method produces an accurate and complete environment reconstruction.", "description": "Figure 6 shows a qualitative comparison of 4D reconstruction results between the proposed method and TotalRecon, highlighting the superior quality of shape, alignment, and completeness achieved by the proposed method.", "section": "4.1 4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/figures/figures_18_1.png", "caption": "Figure 7: Qualitative comparison on 4D reconstruction (Tab. 3). We compare with TotalRecon on 4D reconstruction quality. We show novel views rendered with a held-out camera that looks from the opposite side. ATS is able to leverage multiple videos captured at different times to reconstruct the wall (blue box) and the tripod stand (red box) even they are not visible in the input views. Multi-video TotalRecon produces blurry RGB and depth due to bad camera registration. The original TotalRecon takes a single video as input and therefore fails to reconstruct the regions (the tripod and the wall) that are not visible in the input video.", "description": "Figure 7 shows a qualitative comparison of 4D reconstruction results between ATS and TotalRecon, highlighting ATS's ability to leverage multiple videos for improved reconstruction of scene details even when those details are not visible in any single video.", "section": "4.1 4D Reconstruction of Agent & Environment"}, {"figure_path": "2410.16259/figures/figures_19_0.png", "caption": "Figure 8: Visual ablation on scene awareness. We demonstrate the effect of the scene code \\(\\boldsymbol{\\omega}_s\\) through goal-conditioned path generation (bird’s-eye-view, blue sphere goal; gradient color generated path; gray blocks locations that have been visited in the training data). Conditioned on scene, the generated path abide by the scene geometry, while removing the scene code, the generated paths go through the wall in between two empty spaces.", "description": "Figure 8 shows the impact of scene awareness on path generation, demonstrating that incorporating scene information prevents the generated path from going through walls.", "section": "4.2 INTERACTIVE AGENT BEHAVIOR PREDICTION"}, {"figure_path": "2410.16259/figures/figures_19_1.png", "caption": "Figure 9: Given the 3D trajectories of the agent and the user accumulated over time (top), one could compute their preference represented by 3D heatmaps (bottom). Note the high agent preference over table and sofa.", "description": "Figure 9 shows agent and user's preference over the environment represented by 3D heatmaps generated from their accumulated trajectories.", "section": "4 Experiments"}, {"figure_path": "2410.16259/figures/figures_20_0.png", "caption": "Figure 11: Generalization ability of the behavior model. Thanks to the ego-centric encoding design (Eq. 12), a specific behavior can be learned and generalized to novel situations even it was seen once. Although there's only one data point where the cat jumps off the dining table, our method can generate diverse motion of cat jumping off the table while landing at different locations (to the left, middle, and right of the table) as shown in the visual.", "description": "The figure shows the generalization ability of the behavior model to generate diverse motions of a cat jumping off a table and landing at different locations, even with limited training data.", "section": "4.2 INTERACTIVE AGENT BEHAVIOR PREDICTION"}, {"figure_path": "2410.16259/figures/figures_20_1.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent's ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure illustrates the Agent-to-Sim (ATS) framework, showing how it reconstructs casual videos into a 4D representation and then uses that to train a generative model for simulating interactive agent behavior.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_21_0.png", "caption": "Figure 1: Learning agent behavior from longitudinal casual video recordings. We answer the following question: can we simulate the behavior of an agent, by learning from casually-captured videos of the same agent recorded across a long period of time (e.g., a month)? A) We first reconstruct videos in 4D (3D & time), which includes the scene, the trajectory of the agent, and the trajectory of the observer (i.e., camera held by the observer). Such individual 4D reconstructions are registered across time, resulting in a complete and persistent 4D representation. B) Then we learn a model of the agent for interactive behavior generation. The behavior model explicitly reasons about goals, paths, and full body movements conditioned on the agent's ego-perception and past trajectory. Such an agent representation allows generation of novel scenarios through conditioning. For example, conditioned on different observer trajectories, the cat agent chooses to walk to the carpet, stays still while quivering his tail, or hide under the tray stand. Please see videos results in the supplement.", "description": "The figure illustrates the Agent-to-Sim (ATS) framework, showing the 4D spacetime reconstruction from longitudinal casual videos and the interactive behavior simulator.", "section": "1 INTRODUCTION"}, {"figure_path": "2410.16259/figures/figures_21_1.png", "caption": "Figure 13: Robustness to layout changes. We find our camera localization to be robust to layout changes, e.g., the cushion and the large boxes (left) and the box (right). However, it fails to reconstruct layout changes, especially when they are only observed in a few views.", "description": "The figure shows the robustness of the camera localization method to changes in the environment layout, highlighting its limitations when dealing with changes only observed in a few views.", "section": "4.1 4D Reconstruction of Agent & Environment"}]